[
  {
    "post_id": "1pa1g36",
    "subreddit": "nyc",
    "title": "NYC man detained by ICE is released, reunited with disabled son in time for Thanksgiving",
    "author": "nydailynews",
    "created_utc": "2025-11-29T17:17:18",
    "score": 324,
    "num_comments": 14,
    "text": ">A Manhattan green card holder detained by Immigration and Customs Enforcement for more than three months was released to reunite with his disabled son just in time for the Thanksgiving holiday.\n\n>\n\n>When Heury Gomez returned home on Nov. 22, he said is first order of business was eating a decent meal, then seeing his mother and 18-year-old son Noah, who lives in a hospital in Westchester county. Gomez is the sole caretaker for Noah, who is non-verbal, suffers epilepsy and depends on a tracheostomy tube.\n\n>\n\n>Gomez’ cousin, Carolina Zapata, described the father and son’s reunion as a “beautiful moment,” that brought her to tears.\n\n[READ MORE](https://www.nydailynews.com/2025/11/29/nyc-man-detained-by-ice-is-released-reunited-with-disabled-son-in-time-for-thanksgiving/)",
    "url": "https://www.nydailynews.com/2025/11/29/nyc-man-detained-by-ice-is-released-reunited-with-disabled-son-in-time-for-thanksgiving/",
    "scraped_at": "2025-12-04T02:44:14.246436"
  },
  {
    "post_id": "1pdqqoc",
    "subreddit": "AskNYC",
    "title": "Cheap emergency dental",
    "author": "RoyaleMe",
    "created_utc": "2025-12-03T23:34:00",
    "score": 4,
    "num_comments": 12,
    "text": "What’s the cheapest emergency dental care I can get?\nI’m in a lot of pain from a wisdom tooth and possibly an abscess. I’ve taken more painkillers than I should. I have Medicaid but no managed care plan, so most places aren’t accepting it.\nI was thinking about going to a hospital ER, but I’m not sure if they’ll see me without a plan or how much it would cost.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pdqqoc/cheap_emergency_dental/",
    "scraped_at": "2025-12-04T02:44:15.196806"
  },
  {
    "post_id": "1pcln8h",
    "subreddit": "AskNYC",
    "title": "Physical Therapist recommendations for tension headaches?",
    "author": "Jyonnyp",
    "created_utc": "2025-12-02T16:48:53",
    "score": 2,
    "num_comments": 4,
    "text": "I've been dealing with them for months, basically daily and constantly. My current PT has been helpful to a point but I think I need someone who more specializes in them.\n\n\nIt's not a migraine, it's a tension headache. Been to a neuro and got imaging already: everything points to chronic tension headache.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pcln8h/physical_therapist_recommendations_for_tension/",
    "scraped_at": "2025-12-04T02:44:15.351072"
  },
  {
    "post_id": "1pck77s",
    "subreddit": "AskNYC",
    "title": "How long do you wait at your eye doctor?",
    "author": "FieryVenus",
    "created_utc": "2025-12-02T15:54:21",
    "score": 5,
    "num_comments": 29,
    "text": "We’re on hour three right now.  I switched from the last one because we were there for 2 ½ hours.  Is it like this at all offices?  \n\nEdit: if you’re willing to share or dm your opthamologist’s name and location, I’d be grateful.  ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pck77s/how_long_do_you_wait_at_your_eye_doctor/",
    "scraped_at": "2025-12-04T02:44:15.462705"
  },
  {
    "post_id": "1pch9dl",
    "subreddit": "AskNYC",
    "title": "The billboards on top the buildings at 480 Greenwich St./502 Canal St.",
    "author": "Prudent_Baker_2851",
    "created_utc": "2025-12-02T14:04:31",
    "score": 3,
    "num_comments": 2,
    "text": "For those who may not know, the building at 480 Greenwich/502 Canal near the Holland Tunnel is an historic structure built between 1816 and 1868. It would have had stores on the ground level and residences upstairs, and has served several purposes, including a hospital, in its time. Looks like Hurricane Sandy beat it up quite a bit, but it has since been through a great deal of renovation and restoration.\n\nMy question is about the billboards on the roof of this building. Recent photos make it appear that they're blank. Do they get rented regularly or are they blank most of the time? ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pch9dl/the_billboards_on_top_the_buildings_at_480/",
    "scraped_at": "2025-12-04T02:44:15.659025"
  },
  {
    "post_id": "1pc8hge",
    "subreddit": "AskNYC",
    "title": "How can I adjust/fix the radiators in my 4th floor (top floor) apartment?",
    "author": "LogMeln",
    "created_utc": "2025-12-02T08:30:38",
    "score": 1,
    "num_comments": 13,
    "text": "Ive been in my brooklyn apartment now for 7 years and I dont know if im just getting less tolerant or if its actually gotten worse but these pipes are not adequately heating my apartment during the winter time ([photos of pipes](https://imgur.com/a/8W6F0R3)).\n\nIve asked the landlord over the last several winters to help and he comes, tinkers with it, and when it eventually heats up he leaves and says its done. but the problem is that in the photo you see two pipes, only one of the pipes get warm and about an hour later one stops getting hot and the other gets hot. **im unsure if both are meant to get hot.** \n\nadditionally, there are also pipes in the bedroom that never get as hot. usually these pipes are so hot i cant even touch it but the ones in the bedroom only get warm to the touch so i can put my whole hand on it. \n\nit hasn't been very cold lately but in the last week the avg temp of our living room has been 64 degrees. \n\nwhats worse and why im trying to get things fixed this year is that we just had a newborn and the nursery is even colder at 61 degrees, dropping to 58 overnight. \n\nmost winters, ive had to keep a space heater on nearly 24hrs but for the baby im trying to see if theres anything i can do - also with electric bills skyrocketing, i dont know if i can/should keep paying for my own heat like this\n\nany suggestions would be helpful. im also afraid of the landlord retaliating as hes raised my rent already for having to fix things around the unit. so im trying to keep things quiet and easy to fix ideally on my own or calling a handyman myself.\n\nlast year, our bathroom floors caved in and he replaced our entire bathroom so he raised our rent by 12%",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pc8hge/how_can_i_adjustfix_the_radiators_in_my_4th_floor/",
    "scraped_at": "2025-12-04T02:44:15.771464"
  },
  {
    "post_id": "1pbt4ye",
    "subreddit": "AskNYC",
    "title": "NYU Langone PCP recommendations?",
    "author": "abhid2030",
    "created_utc": "2025-12-01T18:58:08",
    "score": 2,
    "num_comments": 11,
    "text": "I'm looking to find a regular doctor now that I'm getting older and sicker. NYU Langone system is easiest because I've had a bunch of dealings with them this year and they take my insurance. Anyone have a PCP they've been seeing for a while and can wholeheartedly recommend? I'm willing to wait a bit to get an appointment with someone good. I'm male and in my 40s, if that helps. Someone who knows their stuff but--crucially--will take the time to listen to issues and figure them out. I've had enough of assembly line doctors. (And yes, I know this is all easier said than done in our current dystopian time!)\n\nAnd if you have doctor names I should avoid or reasons I should not look to NYU Langone, please feel free to say so (with recommendations of where to look!).",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pbt4ye/nyu_langone_pcp_recommendations/",
    "scraped_at": "2025-12-04T02:44:15.940746"
  },
  {
    "post_id": "1pbsibt",
    "subreddit": "AskNYC",
    "title": "medical aid",
    "author": "tonytruand12",
    "created_utc": "2025-12-01T18:31:14",
    "score": 6,
    "num_comments": 18,
    "text": "Hello everyone,\nWe are a French couple who are going to New York from January 7 to 16 with friends.\nOne of us is undergoing medical treatment to have a child and is due to receive an injection on January 14.\nWe do not speak English very well, so we are looking for someone competent in the medical field (nurse, doctor, or other authorized professional), if possible French-speaking, who could administer the injection on site.\nOf course, we will pay the person for the service.\nIf you have any contacts, recommendations or if you can help us directly, do not hesitate to contact me thank you very much",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pbsibt/medical_aid/",
    "scraped_at": "2025-12-04T02:44:16.101897"
  },
  {
    "post_id": "1pbrxup",
    "subreddit": "AskNYC",
    "title": "Good happy hour walking distance from Webster hall?",
    "author": "ManaSora",
    "created_utc": "2025-12-01T18:07:22",
    "score": 2,
    "num_comments": 1,
    "text": "I'm not in Manhattan much since covid. Any good happy hour spots for before a show at Webster hall? It's a Friday if that matters. Should be able to get there 3/4pm. Happy hour food is a bonus but mostly hoping for drinks special. Thanks so much in advance. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pbrxup/good_happy_hour_walking_distance_from_webster_hall/",
    "scraped_at": "2025-12-04T02:44:16.263868"
  },
  {
    "post_id": "1p5p5a3",
    "subreddit": "newyorkcity",
    "title": "The Christmas Day, 1959 cover of The Bay Ridge Home Reporter, which was then published by J. Frank Griffin from 8117 3rd Avenue (Bay Ridge). The cover features four-year-old Elaine Perez just before joining the choir to sing Christmas carols at Church of the Good Shepherd, 7420 4th Avenue.",
    "author": "TheWallBreakers2017",
    "created_utc": "2025-11-24T13:36:23",
    "score": 4,
    "num_comments": 0,
    "text": "Hey everyone!, The next jam-packed episode of The Bay Ridge Digest Podcast will be out this Wednesday 11/26, but that’s not the only Bay Ridge-centric thing I’ve got going on.\n\nChristmas In Old Bay Ridge — A Brand New Walking Tour — Begins this Saturday 11/29!\n\nStep back in time and experience Christmas in mid-twentieth century Bay Ridge with site-specific stories, photos, audio, and more. I’m really excited to have put together and to lead this brand new walking tour five times during the holiday season. It's a bit different from my other walking tours and will feature a lot more on-site media. Below are the dates and links for more info and tickets:\n\nSaturday 11/29/2025 1PM\n\n\\[[https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729779606?aff=oddtdtcreator\\]](https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729779606?aff=oddtdtcreator])\n\nSaturday 12/6/2025 1PM\n\n\\[[https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729885924?aff=oddtdtcreator\\]](https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729885924?aff=oddtdtcreator])\n\nSunday 12/14/2025 1PM\n\n\\[[https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729888933?aff=oddtdtcreator\\]](https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729888933?aff=oddtdtcreator])\n\nSunday 12/21/2025 1PM\n\n\\[[https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729890939?aff=oddtdtcreator\\]](https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729890939?aff=oddtdtcreator])\n\nSunday 12/28/2025 1PM\n\n\\[[https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729892945?aff=oddtdtcreator\\]](https://www.eventbrite.com/e/christmas-in-old-bay-ridge-walking-tour-tickets-1962729892945?aff=oddtdtcreator])\n\nLed by James Scully — NYC historian, tour guide, podcaster, director / co-creator of the award-winning historical audio fiction soap opera, Burning Gotham, and creator of the Bay Ridge Digest Podcast — our unique holiday Bay Ridge experience will focus on and include:\n\n• The Birth of Bay Ridge: From a Change of Name to the Festive Rites Originated In Dim Ages Past, we’ll start with recollections that stretch back all the way to Bay Ridge’s name origin in December of 1853 while we talk about the origin of Christmas trees and other holiday accoutrements\n\n• Stories from the Shore Road USO, The Shore Road Hospital, FDR’s Christmas messages, The Battle of the Bulge, how Bay Ridge Christmas during World War II, and departing for the European theater from Bay Ridge Harbor with a Christmas message from President Roosevelt\n\n• Local Christmas tree and decorating memories as Bay Ridge became a diverse community three generations after Ellis Island opened while Jack Benny trimmed his Christmas tree\n\n• Bay Ridge’s Christmas Bells and an Atomic Christmas editorial from Fort Hamilton High School in 1961 as Cold War fears invaded Holiday cheer\n\n• Stories of Greek Christmases from Father Paul and St. Mary's Antiochian Orthodox Church\n\n• A Christmas Dream for Bay Ridge from J. Frank Griffin at the original Bay Ridge Home Reporter location\n\n• The many days of Norwegian Christmas with yule concerts, Christmas puddings, and other Norse traditions by Our Savior’s Lutheran Church\n\n• Bay Ridge’s happiest childhood Christmas memories and biggest Christmas surprises\n\n• Christmas caroling at the old Lincoln Savings Bank\n\n• Stories of what young Bay Ridge children wanted from Santa Claus\n\n• Bing Crosby, Holsten's, The Alpine, and White Christmas\n\n• And more!",
    "url": "https://i.redd.it/87badrme193g1.jpeg",
    "scraped_at": "2025-12-04T02:44:18.032903"
  },
  {
    "post_id": "1pdqv71",
    "subreddit": "Brooklyn",
    "title": "Pilates for back injury recovery",
    "author": "According_Pair8218",
    "created_utc": "2025-12-03T23:40:30",
    "score": 0,
    "num_comments": 1,
    "text": "Hi, does anyone have recommendations for a Pilates instructor for 1:1 mat Pilates in Brooklyn? Someone who is skilled at working with back injuries / aiding recovery. I have limited mobility & chronic pain right now, but a doctor recommended Pilates, so I am hoping to find someone I can trust not to worsen the injury (and hopefully help me to recover)!! ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1pdqv71/pilates_for_back_injury_recovery/",
    "scraped_at": "2025-12-04T02:44:19.632588"
  },
  {
    "post_id": "1p98xz0",
    "subreddit": "Brooklyn",
    "title": "DO NOT trust your pet with Pawsies!",
    "author": "novasdayi",
    "created_utc": "2025-11-28T18:06:17",
    "score": 879,
    "num_comments": 156,
    "text": "Our normal sitter was on a business trip, and we sadly couldn't bring our dog with us on a 10-day roadtrip, so we decided to entrust Timber, a 75(ish)lb coonhound, to Pawsies, a doggy daycare place. We thought that he would be safer with professional handlers as he has fear aggression (vs finding a friend who likes dogs and risking both parties.) We will never bring him back.\n\nOn Nov 17, at 9:30am, we were notified that a caretaker slammed a door on our puppy's tail while he was boarded, ripping off 2in of his tail. The picture they sent over TEN hours later shows our poor pup’s tail vertebrae exposed. He must have been in so much pain, but it took more than 10-12 hours to tell us and to bring him to an emergency vet.  \n\nPawsies paid for the amputation and cared for him afterwards, but when we respectfully asked for a way to deduct suture removal bills (or god forbid infection care) from the balance, Ivan (the owner) **accused us of caring more about money than our dog's health.**\n\nIn his last jarring and bizarre text, Ivan told us to never contact his phone again. \n\nPawsies was supposed to be keeping Timber safe, but they ransomed our dog refusing to release him to us until we paid the full 1K balance, even though we kept repeating we would be happy to if they allow us to deduct future bills or give us a way to forward them.\n\nTimber's nub was still raw and bleeding when we returned.\n\n—— \n\nWords from an ex staff member Kiean K9:\n\n “I was a staff member at Pawsies when they first opened years ago and quit because of how unsafe and inattentive they were to safety precautions. I’d say try and find someone independent to board your dog. Most daycares aren’t properly staffed to give your dog the quality care they need but ivan and Pawsies was nightmare.  \n\nAlso I’m sure whoever was at fault for timbers accident means well and would never intentionally hurt timber but if anything’s the same as it was 5-6 years ago the staff there is severely underpaid and overworked and expected to the job of 3 which leads to a dangerous environment.”\n\nSince posting this incident on ig, multiple people have come forward with testimonies against Pawsies. We have since learned from personal exp that Ivan **deletes negative reviews** off of Google. There are recurring dog injuries and staff issues here.",
    "url": "https://www.reddit.com/gallery/1p98xz0",
    "scraped_at": "2025-12-04T02:44:19.739072"
  },
  {
    "post_id": "1p94elt",
    "subreddit": "Brooklyn",
    "title": "Injured or sick pigeon on E 8 St and Church Ave",
    "author": "firstghostsnstuff",
    "created_utc": "2025-11-28T14:54:58",
    "score": 5,
    "num_comments": 0,
    "text": "there’s a juvenile pigeon outside the Farmacia and across the lofty pigeon bookstore that looks like it’s in need of help. I don’t have anything to take it in and the Wild Bird Fund won’t answer my call. Does anyone know who else I can call or can anyone help? ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1p94elt/injured_or_sick_pigeon_on_e_8_st_and_church_ave/",
    "scraped_at": "2025-12-04T02:44:20.690240"
  },
  {
    "post_id": "1p46ksp",
    "subreddit": "Queens",
    "title": "New subreddit alert: /r/QueensBusiness for Queens Builders, Biz Owners & People With Too Many Ideas!",
    "author": "jonbai",
    "created_utc": "2025-11-22T17:49:33",
    "score": 5,
    "num_comments": 0,
    "text": "Before I get into it, first of all a major shoutout to the r/Queens mods - the brave souls who wake up every day and choose to moderate this borough’s internet chaos. Absolute heroes. Saints. Urban shamans. Keepers of the peace. Protectors of the neighborhood energy.\n\n(They even said I could post this - legends. I salute you! 🫡)\n\nAnyway… let’s talk business. Literally.\n\nAs we all know, this sub gets flooded with people trying to:\n\n* launch a bakery\n* start a side hustle\n* navigate NYC permits without spiritually evaporating\n* freelance their way to freedom\n* escape corporate life\n* or cling to corporate life while working from a Queens kitchen table next to a rice cooker!\n\nAnd honestly… this chaos spoke to me.\n\nThe entrepreneurial spirit.\n\nThe “I’m running a whole company from a bodega table” energy.\n\nSo I did what any rational Queens resident would do:\n\nI made a subreddit.\n\nIntroducing r/QueensBusiness\n\naka the Times Square of Queens hustle,  \nthe Union Square Greenmarket of ambition,  \nthe 7 train at rush hour of networking.\n\nWho and what it’s for:\n\n🔥 freelancers surviving on cold brew + hope  \n🔥 side-hustlers doing 6 jobs with 0 days off  \n🔥 corporate warriors fighting the good fight in 47 Slack channels  \n🔥 people whose spreadsheets have spreadsheets  \n🔥 asking the questions you’re too tired to Google  \n🔥 sharing wins (big, small, or delusional)  \n🔥 getting advice that isn’t from your cousin who “does crypto”  \n🔥 learning, leveling up, and laughing through the madness\n\nIf you’ve ever had a business idea at 3AM and thought, **“Yeah this could work, I’m basically a genius,”** this community is for you.\n\nSo pull up, share your vibe, and help shape a community built on hustle, heart, immigrant energy, ambition, caffeine, and chaos... aka Queens.\n\nBig thanks again to the r/Queens mod squad for giving this the green light 🙌\n\nYou’re doing God’s work out here.\n\nAnd you in r/QueensBusiness... where the hustle is real, the memes are unhinged, and every day is “character-building.”🚀💼👑",
    "url": "https://www.reddit.com/r/Queens/comments/1p46ksp/new_subreddit_alert_rqueensbusiness_for_queens/",
    "scraped_at": "2025-12-04T02:44:22.552229"
  },
  {
    "post_id": "1ox5btf",
    "subreddit": "Queens",
    "title": "Queens officials demand Gov. Hochul sign hospital language services access bill before end of year",
    "author": "lilac2481",
    "created_utc": "2025-11-14T14:01:37",
    "score": 55,
    "num_comments": 5,
    "text": "",
    "url": "https://qns.com/2025/11/queens-officials-hochul-hospital-language-services/?fbclid=Iwb21leAOEW1hleHRuA2FlbQIxMQBzcnRjBmFwcF9pZAwzNTA2ODU1MzE3MjgAAR5ptqN3-PfL6lyDQwnhmE3dj4FxWPwat68m4VH5GwJMPFXEqZaM9iWy6jtnqA_aem_oDAEmeu1nRaiTivDJnBsqA",
    "scraped_at": "2025-12-04T02:44:22.676665"
  },
  {
    "post_id": "1or4lgz",
    "subreddit": "Queens",
    "title": "Please help us Keep Freedom Drive in Forest Park closed to cars!",
    "author": "Stube2000",
    "created_utc": "2025-11-07T15:00:11",
    "score": 72,
    "num_comments": 8,
    "text": "Freedom Drive has been closed to vehicles since COVID and a a small but vocal group in our community want to open it again.  It’s been a welcome change in our community and we would hate to go backwards and reintroduce cars.  Help us get signatures to stop this from happening before the community board meets this Thursday. Thank you!",
    "url": "https://c.org/FwYsFW9kQX",
    "scraped_at": "2025-12-04T02:44:22.811966"
  },
  {
    "post_id": "1pax01c",
    "subreddit": "bronx",
    "title": "Stalker Keeps Harassing me Need Help Identifying",
    "author": "MutedAd2377",
    "created_utc": "2025-11-30T18:33:24",
    "score": 100,
    "num_comments": 30,
    "text": "For the past year I have been getting followed and harassed by a man who throws a white substance on my posterior region. This happens around the 170st 4 train station. I don’t know what the white substance is, but he’s clearly doing this for some sexual gratification because of the region it is in. I just got harassed by him again for the third time Saturday (11/29/25) night and I’m so disgusted and angry. The police can’t do anything because I don’t know anything about this guy and this makes me even angrier because I’ve already reported him. I’m gonna tag the video I took of him and a picture of what he did to me. Please if anyone recognizes this man or knows of any one else he has done this to please report him to the police! I know I’m not the only girl he has done this to and I’m sick of this guy being on the loose.",
    "url": "https://v.redd.it/zhqdh5ltbh4g1",
    "scraped_at": "2025-12-04T02:44:24.929977"
  },
  {
    "post_id": "1oywhq0",
    "subreddit": "bronx",
    "title": "Anyone interested in adopting a Tortie Cat [pregnant] No Money Please",
    "author": "mulchintime4",
    "created_utc": "2025-11-16T15:38:52",
    "score": 198,
    "num_comments": 136,
    "text": "Hey Guys theres a couple of cats in my neighborhood. theres this pqrticularly friendly Tortie that lives on my block. She is currently pregnat  and I have a feeling when she gives birth people may try to steal her kittens or sell them for money.\n\nNormally i would just  let her be liek the other  neighborhood cats, which i give food and water to.  We even have a little house where they can go when its really cold or raining. \n\nI don't want to falsely accuse anyone but i have a feeling someone may have reached in the box and taken a kitten. i heard sounds that sounded like an animal crying for help and someone speaking and a door loudly shutting. I think a kitten was taken. This has nt been the first ive been told kittens have gone missing.  The guy i help has told me some stories as well.\n\n I want her and her kittens when they sre born to go to a good home to prevent this.\n\nIf you or anyone would like to adopt her please let me know I'm a bronx resident and I'm willing to travel to any borough to bring her to you.\n\nMy reasoning for putting no money is due to religious I am not allowed to sell Cats so I am giving her away for Free.",
    "url": "https://www.reddit.com/gallery/1oywhq0",
    "scraped_at": "2025-12-04T02:44:25.150161"
  },
  {
    "post_id": "1pd5q2u",
    "subreddit": "Manhattan",
    "title": "Help i dropped my keys in a catch basin its been a week",
    "author": "simsmax1",
    "created_utc": "2025-12-03T09:31:35",
    "score": 0,
    "num_comments": 22,
    "text": "I called 311, made a DEP ticket, received no response within 48 hours. Followed up with 311 on Friday and they told me to wait until Monday. Called DEP myself on Monday was told to leave my name and number, no call back. Tuesday I got a call back just to call another number which no longer exists and then I called another DEP number which redirected me to another number. I’ve left a million voicemails. Im running out of hope but I need to get these keys, my dorm keys were attached to them otherwise Ill have to pay a lot of money. What can i do new yorkers please help me\n\nEdit: Went magnet fishing for an hour 30 couldnt find. Even ppl stopped n helped. tried w hook on stick. nothing. Construction workers pried the grate up n used a shovel to dig out the dirt but theres a LOT. Only way will be when DEP responds ",
    "url": "https://www.reddit.com/r/manhattan/comments/1pd5q2u/help_i_dropped_my_keys_in_a_catch_basin_its_been/",
    "scraped_at": "2025-12-04T02:44:27.265888"
  },
  {
    "post_id": "1pckc45",
    "subreddit": "Manhattan",
    "title": "Fort Greene Full Moon Walk · Luma",
    "author": "Delicious-Prize-4207",
    "created_utc": "2025-12-02T15:59:26",
    "score": 0,
    "num_comments": 0,
    "text": "Details + RSVP ➜[ https://luma.com/odo0x8mx](https://luma.com/odo0x8mx)\n\nHi friends! ࿐ 🍃༄｡\n\nBuds On The Move (a *cannabis-friendly community walking group*) is hosting our first December walk on Thursday the 4th at 6:30 PM. We’ll kick things off at Soulmate BK with some glowsticks and then wander through Fort Greene Park to catch the Cold Supermoon. 🌕\n\nIt’s a relaxed, social walk — come hang out, get some fresh air, and meet a few new people.\n\nOur full calendar is here ➜[ https://luma.com/budsonthemovecalendar?k=c](https://luma.com/budsonthemovecalendar?k=c)",
    "url": "https://www.reddit.com/r/manhattan/comments/1pckc45/fort_greene_full_moon_walk_luma/",
    "scraped_at": "2025-12-04T02:44:27.468733"
  },
  {
    "post_id": "1ouqgcc",
    "subreddit": "Manhattan",
    "title": "First date ideas/spots in manhattan",
    "author": "exodiaous",
    "created_utc": "2025-11-11T19:24:00",
    "score": 0,
    "num_comments": 8,
    "text": " Hey everyone,\n\nI’m going on a first date this weekend with a girl who lives in Manhattan. I just moved to New Jersey, so I’m not too familiar with the city yet. We agreed to meet somewhere in Manhattan, and she’s free after 1 PM.\n\nI’m looking for ideas and specific spots for a cozy first date in the winter … somewhere we can talk and get to know each other. It could be a coffee shop, a cocktail bar, or maybe an activity if it’s not too cold. Ideally, I’d love a place with a relaxed, speakeasy-style vibe.\n\nI’m in my 30s and want the date to feel comfortable and a bit classy without being over the top. Any recommendations for places or ideas that fit that vibe?\n\nThanks in advance!\n",
    "url": "https://www.reddit.com/r/manhattan/comments/1ouqgcc/first_date_ideasspots_in_manhattan/",
    "scraped_at": "2025-12-04T02:44:27.583135"
  },
  {
    "post_id": "1p2lk4z",
    "subreddit": "StatenIsland",
    "title": "Any skaters or longboarders wanna chill?",
    "author": "Mission_Grapefruit92",
    "created_utc": "2025-11-20T20:33:25",
    "score": 10,
    "num_comments": 7,
    "text": "Not right now specifically especially since it’s cold and late but maybe on a warmer day or in the spring time\n\nI just started and I feel like I can learn by watching someone who knows what they’re doing",
    "url": "https://www.reddit.com/r/statenisland/comments/1p2lk4z/any_skaters_or_longboarders_wanna_chill/",
    "scraped_at": "2025-12-04T02:44:29.217547"
  },
  {
    "post_id": "1ozl181",
    "subreddit": "StatenIsland",
    "title": "found phone on post ave",
    "author": "bigeasterncottonwood",
    "created_utc": "2025-11-17T11:36:48",
    "score": 84,
    "num_comments": 14,
    "text": "my dad found this phone on post avenue walking my dog this morning; not sure what kind of phone this is. pintrest notifications were addressed to “shannon”,  but medical id has the name “avi issac”\n\nif you recognize the child on the phone or something related to the names above, please reach out to me! i live not far from where the phone was found. i will drop it off at the the 121 or 120 or bring it to the t-mobile on forest and barrett (near michaels) since that is the carrier, but i thought i’d try this route first as i prepare to brave the cold and wind 🫡",
    "url": "https://i.redd.it/to92uzmuhu1g1.jpeg",
    "scraped_at": "2025-12-04T02:44:29.339451"
  },
  {
    "post_id": "1oz2d63",
    "subreddit": "StatenIsland",
    "title": "New friends as an adult on the south shore",
    "author": "Feisty_Respond6611",
    "created_utc": "2025-11-16T19:46:55",
    "score": 51,
    "num_comments": 45,
    "text": "Good evening all,\n  My name is al, and let me just cut to the chase here. Im a 33 year old man and ive made some major life changes recently. Because of this I am looking for new friends. Im mostly sober so im not looking to meet people at bars or anything. Im also not looking to date so im not on any dating apps. Im just lonely and I dont know where to go to meet new people. I walk around the neighborhood (Richmond valley) and people are cold and rude. When my dog was alive I was able to meet other large dog owners but now that its just me it feels impossible. All in all im just a guy looking for friends. I love music im big into metal and hip hop and honestly I can dig all genres. I love animals, I talk to all of them. im good with my hands and love to work mechanically. I play guitar, I draw, I write poems snd songs. Im a big nerd but I enjoy the gym.\n\nIm not looking for a date here, im looking for other people like me. The shy ones who are too afraid to approach someone in the streets. \nSo all you weirdos, hit me up. Let's go take a stroll in the woods, get some coffee, smoke a doobie, go to a show, maybe even jam out. Or you hit me with something to do. I drive so im not sweating it if youre on the other side. Im not picky in what yo do either, im down for whatever All are welcome as long as youre 25 or older. This is a big step for me and I hope theres others out there looking for a friend.",
    "url": "https://www.reddit.com/r/statenisland/comments/1oz2d63/new_friends_as_an_adult_on_the_south_shore/",
    "scraped_at": "2025-12-04T02:44:29.519253"
  },
  {
    "post_id": "1p6m38m",
    "subreddit": "nyc",
    "title": "Congestion pricing lower level Queensboro into Manhattan",
    "author": "adam_the_great",
    "created_utc": "2025-11-25T14:35:31",
    "score": 21,
    "num_comments": 42,
    "text": "Can someone explain if the route highlighted by the arrow would be subject to congestion pricing? My research online indicates that you can only take the upper level of the Queensboro into Manhattan to avoid congestion pricing if you head uptown.  from my experience riding a bike over the Queensboro this route might not be subject to congestion pricing if you turn right and head up towards uptown on that small exit. I believe the plate cameras are further down the bridge as indicated in my picture. The turn off highlighted by the arrow is before them. This is the lower level of the Queensboro. Has anyone taken this route and not had congestion pricing? Am I missing something? Google maps obviously has it highlighted as in the congestion zone.",
    "url": "https://i.redd.it/aafntty0hg3g1.jpeg",
    "scraped_at": "2025-12-04T02:56:32.125592"
  },
  {
    "post_id": "1p27vdi",
    "subreddit": "nyc",
    "title": "Unclaimed New York Lottery Ticket worth $1 MILLION will Expire December 13, 2025",
    "author": "Bonbell822",
    "created_utc": "2025-11-20T11:37:11",
    "score": 406,
    "num_comments": 12,
    "text": "NYC residents who may have purchased a lottery ticket on Long Island:  \n  \n $1 Million Mega Millions Winner Sold in Valley Stream  \n  \nThe New York Lottery announced today that an unclaimed prize-winning ticket worth $1 million sold in Nassau County will expire next month.  A Mega Millions second prize-winning ticket was sold at Cold Cut Express located at 507 Dubois Avenue in Valley Stream.   \n  \nThe ticket will expire **December 13, 2025**. The numbers for the December 13, 2024 Mega Millions draw were **36-43-52-58-65 and Mega Ball 16**.   \n  \nPrizes may be claimed up to one year after the draw, which means the $1 million winner is running out of time to claim their prize.   \n  \nIf you are holding the winning ticket: Sign the back of the ticket, put it in a safe place and contact the NY Lottery at 518-388-3370 or visit [www.nylottery.ny.gov](http://www.nylottery.ny.gov/) for information on how to claim your prize.   \n\nHope this message finds the lucky winner! 🍀\n\n[Unclaimed $1 million Mega Millions ticket sold in Valley Stream set to expire soon](https://longisland.news12.com/unclaimed-usd1-million-mega-millions-ticket-sold-in-valley-stream-set-to)",
    "url": "https://i.redd.it/ummhqqagwf2g1.jpeg",
    "scraped_at": "2025-12-04T02:56:33.468415"
  },
  {
    "post_id": "1ozhwnp",
    "subreddit": "nyc",
    "title": "Things to Do in NYC: December 2025",
    "author": "richarizard",
    "created_utc": "2025-11-17T09:36:47",
    "score": 23,
    "num_comments": 6,
    "text": "People do not all take vacations in the same way. There are, of course, many who simply don’t. The expense is too great or the time away too untenable. Among those who are lucky enough to have one once in a while, some are already out exploring by breakfast, and others roll out of a hotel bed at noon, looking to sunbathe alongside a margarita. (And they marry each other.) Some people seek out new foods, others arts and museums. Some seek wild parties, others quiet spaces.\n\nI know where I fit among this, and some of my most successful vacations were with people who travel with similar goals in mind. But I respect all philosophies towards stepping away from the familiar for a little bit. In this highlights I lean into the reality that December is a heavy tourist month in this city and consider the full spectrum of what different tourists might want.\n\nAs usual, this is part of the more expansive [December 2025 Blankman List](https://www.blankmanlist.com/p/things-to-do-in-nyc-december-2025), which includes many more things to do this December in NYC and without all this annoying commentary, to boot. Here is my [November Reddit list](https://www.reddit.com/r/nyc/comments/1o44kzp/things_to_do_in_nyc_november_2025/) for the remainder of the month.\n\n*Disclaimer: Before going anywhere, please confirm the date, time, location, cost, and description using the listed website. Any event is at risk of being rescheduled, relocated, sold out, at capacity, or canceled. Costs are rounded to the nearest dollar and may change. I try to vet quality and describe accurately, but I may misjudge. All views are my own.*\n\n# The Hallmark Movie\n\nI learned early on that this list finds purpose among both residents and tourists, and December is—unsurprisingly—peak tourist season around here, during which this city welcomes [over 3 million tourists every day](https://edc.nyc/sites/default/files/2024-12/NYCEDC-Festive-Spending-Holiday-Shopping-Impact-NYC-Dec-2024.pdf). So for those of you among them, I begin with a short list of the traditional. If you’re visiting, please note that (1) the actual Rockefeller tree lighting is not open to the public (I think), (2) the *Home Alone* screening listed below is not in Manhattan, and (3) I absolutely do not recommend watching the ball drop live on New Year’s Eve, a famously insufferable experience. If you want to do that, [here’s a link](https://www.balldrop.com/) and godspeed.\n\n* After Wednesday, December 3: [Rockefeller Center Christmas Tree](https://www.rockefellercenter.com/holidays/rockefeller-center-christmas-tree-lighting/)\n   * Elaborately decorated 75-foot Christmas tree that is ceremoniously lit and broadcast on TV (Dec 3, 7–10 pm), then left on display through mid-January\n   * Free\n   * Rockefeller Center\n   * 30 Rockefeller Plaza (Midtown, Manhattan)\n* Friday, December 12: [A Nostalgic Night with Macaulay Culkin: ](https://www.kingstheatre.com/events/home-alone/)[*Home Alone*](https://www.kingstheatre.com/events/home-alone/)[ 35th Anniversary](https://www.kingstheatre.com/events/home-alone/)\n   * 35th anniversary screening of the 1990 film *Home Alone*, followed by a moderated interview with actor Macaulay Culkin; 7:30 pm (6:30 pm doors)\n   * $68–$314\n   * Kings Theatre\n   * 1027 Flatbush Ave (Flatbush, Brooklyn)\n* Various days in December: [George Balanchine’s ](https://www.nycballet.com/season-and-tickets/george-balanchines-the-nutcracker/george-balanchines-the-nutcracker)[*The Nutcracker*](https://www.nycballet.com/season-and-tickets/george-balanchines-the-nutcracker/george-balanchines-the-nutcracker)\n   * New York City Ballet company performance of [*The Nutcracker*](https://en.wikipedia.org/wiki/The_Nutcracker) with music by Pyotr Ilyich Tchaikovsky and choreography by George Balanchine; Nov 28–Jan 3\n   * $90–$372\n   * David H. Koch Theater\n   * 20 Lincoln Center Plaza (Lincoln Square, Manhattan)\n* Every day in December: [Christmas Spectacular Starring the Radio City Rockettes](https://www.rockettes.com/christmas/)\n   * Annual musical holiday stage show; multiple times each day, ranging from 9 am to 10 pm\n   * $54–$500+\n   * Radio City Music Hall\n   * 1260 6th Ave (Midtown, Manhattan)\n\n# Thespian Holidays\n\nI realize not everyone cares much for theater (“*yet*,” I would cheekily add if you admitted this to me in person), but NYC is one of its premiere world destinations. Browse the [r/Broadway subreddit](https://www.reddit.com/r/broadway/), and you will find people around the world who travel here for *only* that. For those looking to see a Broadway show but don’t know where to start, my top recommendation is the impeccably designed [B’way Rush](https://bwayrush.com/) website, which lists all shows playing in a Broadway theater, along with information about showtimes and discount options. From this list I call attention to the December premiere of [*Bug*](https://www.manhattantheatreclub.com/shows/2025-26-season/bug/), a 1996 play about two people being driven insane by conspiracy theories. Proceed with caution, but Off- and Off-Off-Broadway always has excellent work getting produced, too. I feel confident the world would be a better place if everyone got to hear the “[I Love You Song](https://www.youtube.com/watch?v=AWbz3FlsqRs)” from William Finn’s (1952–2025) zany [*The 25th Annual Putnam County Spelling Bee*](https://spellingbeenyc.com/) (playing Off-Broadway right now) at least once in their lives.\n\n* Thursday, December 4–Sunday, December 21: [Killing Mrs. Claus](https://theaterforthenewcity.net/shows/killing-mrs-claus/)\n   * One-act Off-Off-Broadway “ridiculously inappropriate” play written and directed by Peter Zachari; Thu, Fri & Sat at 8 pm; Sun at 3 pm\n   * $20 general / $15 student/senior\n   * Theater for the New City, Community Space\n   * 155 1st Ave (East Village, Manhattan)\n* Through Sunday, December 7: [Practice](https://www.playwrightshorizons.org/about/production-history/2020s/2526/practice)\n   * [Nazareth Hassan](https://www.nazarethhassan.com/)’s new Off-Broadway play about power, surrender, and what it takes to be a genius\n   * $64–$104\n   * Playwrights Horizons, Judith O. Rubin Theater\n   * 416 W 42nd St (Hell’s Kitchen, Manhattan)\n* Previews begin Tuesday, December 16: [Bug](https://www.manhattantheatreclub.com/shows/2025-26-season/bug/)\n   * Broadway premiere of the psychological thriller *Bug* by playwright Tracy Letts about two people being driven insane by conspiracy theories\n   * $99–$422\n   * Samuel J. Friedman Theatre\n   * 261 W 47th St (Times Square, Manhattan)\n* Throughout December: [The 25th Annual Putnam County Spelling Bee](https://spellingbeenyc.com/)\n   * Off-Broadway revival of William Finn’s 2005 musical about six adolescents competing in a fictional spelling bee\n   * $58–$194\n   * New World Stages\n   * 340 W 50th St (Midtown, Manhattan)\n\n# Quiet Among the Chaos\n\nEven during its quietest months, parts of New York City remain overwhelming. A cold, rainy March evening can still have you elbowing your way through giant Elmos on your way home from a Broadway show. Christmastime in Times Square specifically is perhaps better left to the movies. To the introverted, reflective, and shy among you: Quiet activities and low-key affairs are available in this city, too.\n\n* Wednesday, December 10: [PAUSE Sound Bath with Sara Auster & Alex Falk](https://shop.thus.org/products/pause-sound-bath-with-sara-auster-amp-alex-falk)\n   * Guided meditative sound bath from practitioners [Sara Auster](https://saraauster.com/) and [Alex Falk](https://atonalmeditation.com/) intended for reflection and renewal; 6:30 pm\n   * $35\n   * Tibet House US\n   * 22 W 15th St (Union Square, Manhattan)\n* Saturday, December 13: [Poets House 30th Showcase Exhibition Opening](https://poetshouse.org/event/30th-showcase-exhibition-opening/)\n   * Opening with readings and reception for an exhibition of poetry publications from 2024 and 2025 that documented key changes in the art form; 4–6 pm\n   * Free\n   * Poets House\n   * 10 River Terrace (Battery Park City, Manhattan)\n* Saturday, December 13: [Mindfulness in the Noguchi Museum Galleries](https://www.noguchi.org/museum/calendar/event/2025-12-13-1000-mindfulness-in-the-galleries/)\n   * Guided meditation and mindfulness exercise in the Noguchi Museum before it’s open to the public; 10–11:30 am\n   * $16 (includes museum admission)\n   * The Isamu Noguchi Foundation and Garden Museum\n   * 9-01 33rd Rd (Long Island City, Queens)\n* Tuesday, December 16: [Death Cafe](https://www.green-wood.com/event/death-cafe-21/)\n   * Informal, group-directed discussion of death with the purpose of increasing “awareness of death to help people make the most of their lives”; 6:30–8 pm\n   * Free\n   * Green-Wood Cemetery, Modern Chapel\n   * 500 25th St (Greenwood Heights, Brooklyn)\n\n# Off the Beaten Path\n\nThis is probably my favorite type of event type to discover: something away from Radio City Music Hall and Broadway and without celebrities or deep marketing budgets. Events like workshops, lectures, social meet-ups, the avant-garde. Events potentially far from where most tourists are staying. Learning about the full range of what NYC can offer is a big part of what makes the list so enjoyable for me to craft every month.\n\n* Monday, December 1: [How to Have Better Conversations](https://www.lifeshopny.com/events/how-to-have-better-conversations)\n   * Workshop taught by writer and journalist [Keshia Hannam](https://www.keshiahannam.com/) on how to read a room and ask better questions; 5:45–7:30 pm\n   * $26–$41\n   * Lifeshop\n   * 199 N 8th St (Williamsburg, Brooklyn)\n* Tuesday, December 2: [Piano Master Class with Corey Hamm](https://www.msmnyc.edu/performances/piano-master-class-corey-hamm-12-2-2025/)\n   * Public piano performance [master class](https://en.wikipedia.org/wiki/Master_class) given by Corey Hamm, “[one of the world’s foremost champions of contemporary piano music](https://bostonconservatory.berklee.edu/events/artistry-in-action-piano-masters-series-corey-hamm)”; 4 pm\n   * Free\n   * Manhattan School of Music, Greenfield Hall\n   * 130 Claremont Ave (Morningside Heights, Manhattan)\n* Sunday, December 7: [Sylvie Courvoisier with Mary Halvorson and Wadada Leo Smith](https://roulette.org/event/sylvie-courvoisier-with-mary-halvorson-and-wadada-leo-smith/)\n   * Experimental classical pianist-composer [Sylvie Courvoisier](https://sylviecourvoisier.com/) performs duos with guitarist Mary Halvorson and trumpeter Wadada Leo Smith; 8 pm (7 pm doors)\n   * $25 advance / $30 doors / $20 student/senior\n   * Roulette\n   * 509 Atlantic Ave (Boerum Hill, Brooklyn)\n* Tuesday, December 16: [Collage Party: Holiday Card Edition](https://withfriends.events/event/6RfrPxxI/collage-party-holiday-card-edition/)\n   * Social collage-making space with supplies available for participants to craft their own holiday cards; 7–10 pm; every third Tuesday\n   * $5–$15 suggested donation\n   * Footlight Presents\n   * 552 Grandview Ave (Ridgewood, Queens)\n\n# Les’ Fuggin’ Go!\n\nI think many NYC residents would agree that the “city that never sleeps” seems to have gotten a bit more shuteye ever since Covid. Fewer places are open late, and parts of the city feel calmer. But hey, if you’re into loud music, late nights, and a little bit of chaos, this city’s still got you covered. (Even in a list of events specifically dedicated to people who wanna go nuts around Christmas time, I still refuse to formally list [SantaCon](https://santacon.nyc/).)\n\n* Thursday, December 4: [KONTUSION, Satanic Magick, Shatter, Heretic Bodyhammer](https://wl.eventim.us/event/kontusion-satanic-magick-shatter-heretic-bodyhammer/668572?afflky=TVEye)\n   * Concert featuring death metal band [KONTUSION](https://kontusionkontusion.bandcamp.com/), NYC-based thrash metal band [Satanic Magick](https://satanicmagick.bandcamp.com/), and others; 7 pm\n   * $16\n   * TV Eye, The Ballroom\n   * 1647 Weirfield St (Ridgewood, Queens)\n* Friday, December 12: [Teksupport x Outworld: Klangkuenstler (All Night Long)](https://brooklynstorehouse.com/whats-on/)\n   * All-night techno rave from event collective Teksupport featuring German DJ [Klangkuenstler](https://www.instagram.com/klangkuenstler/); 10 pm–5 am\n   * As of this writing, all remaining tickets are $91\n   * Brooklyn Storehouse\n   * Assembly Rd, Building 293 (Navy Yard, Brooklyn)\n* Saturday, December 13: [Infinite Good Times’ ](https://partiful.com/e/ml8zi8ymauJ2mXns0Nsl)[*Die Hard*](https://partiful.com/e/ml8zi8ymauJ2mXns0Nsl)[ Holiday Spectacular](https://partiful.com/e/ml8zi8ymauJ2mXns0Nsl)\n   * *Die Hard*\\-themed holiday party with film screening and DJ, with proceeds going to the [NYC Resistor](https://www.nycresistor.com/) hacker space; 6:30 pm doors; 7:30 pm film\n   * $15 suggested donation (includes open bar)\n   * NYC Resistor\n   * 87 3rd Ave, 4th Floor (Gowanus, Brooklyn)\n* Saturday, December 27: [Yaasssferatu by House of Yes](https://shotgun.live/en/events/yaasssferatu-dec-27-2025)\n   * Gothic-themed late-night dance party “where vampiric glamour meets campy chaos”; 10 pm–4 am\n   * $11–$16\n   * House of Yes\n   * 2 Wyckoff Ave (Bushwick, Brooklyn)\n\n# Religious Traditions\n\nChristmas is obviously the big one, but Hanukkah begins December 15, Kwanzaa begins December 26, and on the whole, this melting pot of a city has holidays and festivities throughout the month (or year, for that matter). In developing these lists each month, I often check the calendars of different religious spaces. I look primarily for events geared to people of all faiths, like talks, concerts, and art exhibitions. This month, along with a few other religiously-themed events, I call attention to a heavenly—in all senses of the word—[Baroque music performance](https://stlukeinthefields.org/music-arts/concert-season/) happening at the Church of St. Luke in the Fields in the West Village.\n\n* Thursday, December 4: [A Baroque Christmas in Rome](https://stlukeinthefields.org/music-arts/concert-season/)\n   * Concert with Baroque period instruments that “might have been heard on Christmas Eve in the basilica,” with pre-concert lecture; 7:30 pm (6:30 pm lecture)\n   * $45\n   * Church of St. Luke in the Fields\n   * 487 Hudson St (West Village, Manhattan)\n* Monday, December 15: [54 Celebrates Hanukkah: A Festival of Writers](https://54below.org/events/54-celebrates-hanukkah-a-festival-of-writers-5/)\n   * Fifth annual cabaret concert of new, original Hanukkah songs written by Jewish musical theater writers; 7 & 9:30 pm\n   * $35–$74+, plus $25 food and beverage minimum\n   * 54 Below\n   * 254 W 54th St, Cellar (Midtown, Manhattan)\n* Tuesday, December 26–Saturday, December 30: [Celebrate Kwanzaa at the Brooklyn Children’s Museum](https://www.brooklynkids.org/events/celebrate-kwanzaa/)\n   * Annual mix of repeating and unique programs designed for all ages that celebrate the traditions of Kwanzaa; 10 am–5 pm\n   * $15\n   * Brooklyn Children’s Museum\n   * 145 Brooklyn Ave (Crown Heights, Brooklyn)\n* Through Saturday, December 27: [Jewish Worlds Illuminated: A Treasury of Hebrew Manuscripts](https://www.grolierclub.org/Default.aspx?p=DynamicModule&pageid=384828)\n   * Exhibition of books and manuscripts from the Jewish Theological Seminary library showcasing the different lands in which Jews resided; 10 am–5 pm\n   * Free\n   * The Grolier Club\n   * 47 E 60th St (Upper East Side, Manhattan)\n\n# Holiday Feasts\n\nOkay, one of these events is less a *feast* and more a, well, *soy sauce sampling in a department store*. But (1) it seemed absurd to only list things that require dressing up and dropping a few Benjamins, and (2) enjoying the food that NYC has to offer includes much more than indulgent multi-course meals. As a bonus list of sorts (this is the first time I’ve provided *seven* categories here!) here are a few ideas for eating your way through NYC in December.\n\n* Friday, December 12: [Chef Rasika Venkatesa](https://www.meetresident.com/chef-rasika-venkatesa-friday-dec-12)\n   * Five-course tasting menu, each with a beverage pairing, from renowned South Indian chef [Rasika Venkatesa](https://www.instagram.com/chefrasikav/); 7–10 pm\n   * $195\n   * The Brooklyn Point Chef’s Table\n   * 138 Willoughby St (Downtown Brooklyn)\n* Saturday, December 13: [Heydoh’s Single Origin Soy Sauce Sampling](https://pearlriver.com/pages/upcoming-events)\n   * Free public sampling of [Heydoh’s soy sauce](https://pearlriver.com/products/heydoh-classic-soy-sauce) from Taiwan in a Chinese American department store; 3–5 pm\n   * Free\n   * Pearl River Mart\n   * 452 Broadway (SoHo, Manhattan)\n* Wednesday, December 13: [Rijsttafel Reimagined: An Indonesian Ceremonial Banquet](https://www.jamesbeard.org/events/platform-dinner-indonesian-ceremonial-banquet)\n   * Multi-course traditional Indonesian meal from chef [Cedric Vongerichten](https://www.instagram.com/cedvongerichten/), with cocktail reception and wine or beverage pairings; 6:30 pm\n   * $195–$250\n   * Pier 57\n   * 25 11th Ave\n* Wednesday, December 24: [Christmas Eve at Union Square Café](https://www.unionsquarecafe.com/holidays/)\n   * Special Christmas Eve four-course [“Feast of the Seven Fishes” menu](https://www.unionsquarecafe.com/menus/#feast-of-the-seven-fishes); reservation slots available 4–9:30 pm\n   * $195\n   * Union Square Café\n   * 101 E 19th St (Union Square, Manhattan)",
    "url": "https://www.reddit.com/r/nyc/comments/1ozhwnp/things_to_do_in_nyc_december_2025/",
    "scraped_at": "2025-12-04T02:56:34.883296"
  },
  {
    "post_id": "1ovb4sl",
    "subreddit": "nyc",
    "title": "Northen Lights Viewing Tonight",
    "author": "Terrible-Media-657",
    "created_utc": "2025-11-12T12:15:46",
    "score": 21,
    "num_comments": 5,
    "text": "Do we think we'll see anything around the city tonight? Anyone going up north to try and view the lights? Friends are considering going up to cold spring or poughkeepsie... ",
    "url": "https://www.cbsnews.com/newyork/news/northern-lights-nyc-map/",
    "scraped_at": "2025-12-04T02:56:35.019212"
  },
  {
    "post_id": "1otf7qd",
    "subreddit": "nyc",
    "title": "This is what I'd like the IBX stations to look like at the platform level. Also here is information for Public Comments, Scoping Meetings and Open Houses.",
    "author": "Jacky-Boy_Torrance",
    "created_utc": "2025-11-10T09:28:48",
    "score": 22,
    "num_comments": 34,
    "text": "Or at least a more compact version of this type of design if space would be an issue. I think not having open air stations would be good for hot and cold seasons, at least if it's climate controlled. Both pictures are of the Réseau Express Métropolitain (REM) system in the Greater Montreal Region of Canada. The top picture is Île-des-Sœurs station, the bottom picture is Du Quartier station.\n\n#Info for Public Comments, Scoping Meetings and Open Houses regarding the Interborough Express: https://www.mta.info/project/interborough-express\n\n##Public comment\nWe’re accepting comments on the Draft Scoping Document for the Interborough Express environmental review phase. \n\nSubmit comments online: https://contact.mta.info/s/forms/public-hearing-form?Id=a0gcr000006jROn\n\nYou may also mail comments to:​  \nJordan Smith, Director, IBX  \n2 Broadway, C6.87​  \nNew York, NY 10004\n\nComments will be accepted until November 26, 2025.\n\n##Scoping meetings\nThree public scoping meetings will be held for the community to provide comments in person in Brooklyn and Queens, and via Zoom. Only one left remains.\n\n- November 12, 2025 \n    - 10 AM to 12 PM, online via Zoom \n    - 6 to 8 PM, online via Zoom\n\nRegister for the meetings: https://contact.mta.info/s/forms/public-hearing-form?Id=a0mcr000005UMg9&pId=PH\n\n##Open houses (just walk in)\nTwo public open houses will be held where the public can learn about the project and speak with IBX team members. \n\n- November 19, 2025, 6 to 8 PM\n    - Trinity Lutheran Church, 63-70 Dry Harbor Rd, Middle Village, NY 11379\n- November 20, 2025, 6 to 8 PM \n    - Brooklyn Public Library Sunset Park Branch, 5108 4th Av, Brooklyn, NY 11220",
    "url": "https://i.redd.it/xsofxfsmwf0g1.jpeg",
    "scraped_at": "2025-12-04T02:56:36.179308"
  },
  {
    "post_id": "1otetry",
    "subreddit": "nyc",
    "title": "Low Traffic Neighborhoods Are the Next Step for NYC’s Streets",
    "author": "TalR24",
    "created_utc": "2025-11-10T09:12:47",
    "score": 68,
    "num_comments": 24,
    "text": "New York has made major strides in rethinking its streets and prioritizing pedestrians again, from Open Streets to the Congestion Relief Zone, but these programs are fragmented, temporary, or do not do enough to prevent traffic deaths. Meanwhile, neighborhoods like the Lower East Side and East Village see heavy pedestrian and bike use, low car ownership, and frequent traffic accidents (think, the recent crashes coming off the Manhattan Bridge). The result is that streets meant for community life are still doubling as dangerous shortcuts for thru traffic. \n\n\n\nThe next Mayoral administration, with its bold plans, must adopt more forward-thinking in redesigning our streets as well.\n\nIn my latest article, I argue that the next logical step for NYC is to pilot Low Traffic Neighborhoods (LTNs): permanent redesigns that keep car access for residents but eliminate through routes. They’ve already worked in London and other cities, cutting crashes and pollution while boosting local livability. The East Village, especially around Tompkins Square Park, is perfectly suited to be NYC’s first LTN pilot. Would love to hear thoughts from others who live or spend time here on what you would want to see from an East Village LTN?",
    "url": "https://nycuriosity.substack.com/p/low-traffic-neighborhoods",
    "scraped_at": "2025-12-04T02:56:36.375789"
  },
  {
    "post_id": "1oojuj8",
    "subreddit": "nyc",
    "title": "NYC congestion pricing: Trump once again threatening to terminate program",
    "author": "statenislandadvance",
    "created_utc": "2025-11-04T16:27:53",
    "score": 132,
    "num_comments": 44,
    "text": "",
    "url": "https://www.silive.com/news/2025/11/nyc-congestion-pricing-trump-once-again-threatening-to-terminate-program.html?utm_source=redditsocial&utm_campaign=redditor",
    "scraped_at": "2025-12-04T02:56:37.552201"
  },
  {
    "post_id": "1omb6ga",
    "subreddit": "nyc",
    "title": "This is the funniest SNL has been in a while. Mayoral Debate Cold Open",
    "author": "femaiden",
    "created_utc": "2025-11-02T02:26:55",
    "score": 683,
    "num_comments": 145,
    "text": "",
    "url": "https://youtu.be/FWSM8pDKYkU?si=WaAkSMV7rt8aP3-n",
    "scraped_at": "2025-12-04T02:56:38.971505"
  },
  {
    "post_id": "1ohejt1",
    "subreddit": "nyc",
    "title": "Cat in need of home!!",
    "author": "Rabbitlover96",
    "created_utc": "2025-10-27T09:34:17",
    "score": 62,
    "num_comments": 9,
    "text": "UPDATE: She was brought to the vet and no microchip was found, and she was given to a friend of a friend \n\nMy friend and I found this poor sweet girl dumped outside in the cold. We found her left with food and with a collar with no information. She did not run away when she saw us, she let us pet and hold her which lets us know she had a home. I brought her in my home to keep her warm and give her food. She loves treats! I’m unable to keep her so if someone can take her and give her a loving forever home that would be amazing. Please help ",
    "url": "https://i.redd.it/uxi4078vonxf1.jpeg",
    "scraped_at": "2025-12-04T02:56:41.579837"
  },
  {
    "post_id": "1ofybim",
    "subreddit": "nyc",
    "title": "Help us test ParkingSwap — a neighbor-powered way to find street parking in NYC",
    "author": "C4004",
    "created_utc": "2025-10-25T14:06:30",
    "score": 0,
    "num_comments": 0,
    "text": "**TL;DR:** NYC parking is a headache. ParkingSwap lets neighbors post and request spots for quick, curbside hand-offs. Beta testing now—looking for honest feedback from local drivers. \n\n\n\n\n\nFinding street parking in NYC can be brutal—especially in busy parts of Brooklyn where you can circle for 20 minutes and still come up empty.\n\nI’m building **ParkingSwap**, a simple, neighbor-powered app where:\n\n* People leaving a spot can post it (free or with a small reward).\n* Drivers nearby can see it on the map and request it.\n* You meet at the curb for a quick hand-off.\n\nWe’re in **beta** and looking for early NYC users (Brooklyn especially) to try it and share feedback. We’re not selling anything—just asking for honest thoughts so we can polish the experience.\n\n**Why join the beta**\n\n* Save time (and stress) finding a spot\n* Optional small rewards when you share one\n* Help shape a tool built for NYC drivers\n\n**How to participate**  \nDrop your email on our site and we’ll send the beta invite. Try it, tell us what worked (and what didn’t), and help us make street parking less painful.",
    "url": "https://parkingswap.io/",
    "scraped_at": "2025-12-04T02:56:41.704758"
  },
  {
    "post_id": "1oda3z9",
    "subreddit": "nyc",
    "title": "Injured or sick opossum on street",
    "author": "GoHuskies858",
    "created_utc": "2025-10-22T10:39:55",
    "score": 83,
    "num_comments": 11,
    "text": "This little guy is clearly sick and/or injured near our house :( \n\nI’ve called a bunch of numbers and got into contact with the NY Department of Environmental Conservation, they said they’d be in contact, but anyone know anyone who would do opossum rescues?",
    "url": "https://i.redd.it/s3eo55fadowf1.jpeg",
    "scraped_at": "2025-12-04T02:56:43.302397"
  },
  {
    "post_id": "1pbkk5r",
    "subreddit": "AskNYC",
    "title": "Winter staple recommendation",
    "author": "Narrow_Valuable7220",
    "created_utc": "2025-12-01T13:27:27",
    "score": 1,
    "num_comments": 11,
    "text": "We moved to NY/NJ from Texas and my husband works in Manhattan outside 70% of the time going from building to building for work. Now that’s it’s getting colder what are some recommendations to keep him warm but also looking professional (he visits medical offices for his job) that I can buy? I bought him Uniqlo heattech but is there a warm coat that would help keep him warm as he goes around Manhattan but also look professional (pea coat or puffer for appearance?) do the Uniqlo hats and scarves and gloves actually keep you warm or is there another brand that’s recommended? \n\nAnd is the secret for your feet just to buy good winter socks? I know boots are important but is there a practical good style that looks professional or do people not look too deep in winter? He wears business dress shoes but those arent working too great with the cold now. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pbkk5r/winter_staple_recommendation/",
    "scraped_at": "2025-12-04T02:56:45.692911"
  },
  {
    "post_id": "1pbce1u",
    "subreddit": "AskNYC",
    "title": "how much is the norm to pay for a annual physical without insurance?",
    "author": "Great_Present_6584",
    "created_utc": "2025-12-01T08:11:02",
    "score": 16,
    "num_comments": 42,
    "text": "$100? $400? $800?\n\n  \ni guess it depends on what work get done but like an exam with blood pressure, basic screening you know the standard procedures. \n\nand will it cost more if you have specific concern like cough you want to address?'\n\n  \nsay mount sanai or nyu langone",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pbce1u/how_much_is_the_norm_to_pay_for_a_annual_physical/",
    "scraped_at": "2025-12-04T02:56:45.879453"
  },
  {
    "post_id": "1pb7top",
    "subreddit": "AskNYC",
    "title": "Running in Central Park",
    "author": "snamerino",
    "created_utc": "2025-12-01T03:48:52",
    "score": 0,
    "num_comments": 16,
    "text": "Hi all, might would have tagged as dumb question but I have conflicted information from google. I might visit NY mid January and wanted to know how doable is it to run in Central Park? Not due to the cold but more related to snow or ice. \n\nThank you all!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pb7top/running_in_central_park/",
    "scraped_at": "2025-12-04T02:56:46.149764"
  },
  {
    "post_id": "1payhy7",
    "subreddit": "AskNYC",
    "title": "Where to buy sea glass?",
    "author": "Mysticalmessenger",
    "created_utc": "2025-11-30T19:39:05",
    "score": 2,
    "num_comments": 2,
    "text": "Hi! I’m wondering if anyone knows of any little shops in the city that might sell sea glass? I need 5 pieces so I don’t want to buy online since usually you can only buy big quantities. I know lots of little kitschy beach shops will sell individual pieces but I also know a lot of the beachy shops here close for the cold season. Any help is appreciated !",
    "url": "https://www.reddit.com/r/AskNYC/comments/1payhy7/where_to_buy_sea_glass/",
    "scraped_at": "2025-12-04T02:56:46.316931"
  },
  {
    "post_id": "1pamwdz",
    "subreddit": "AskNYC",
    "title": "Pay Tolls By Mail toll with existing E-ZPass account",
    "author": "M_Silvers",
    "created_utc": "2025-11-30T11:46:31",
    "score": 6,
    "num_comments": 5,
    "text": "I've gone through this before but cannot remember how I solved it last time. I have had an existing E-ZPass account registered to my car for years, but got a Tolls By Mail bill in the mail for a handful of CRZ (congestion zone) tolls. Same car, same plate. You're supposed to be able to convert/transfer these tolls to your E-ZPass account to save some money on them, but I cannot for the life of me figure out how to do this without clicking in circles on the website. Anybody know the trick? Thank you!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1pamwdz/pay_tolls_by_mail_toll_with_existing_ezpass/",
    "scraped_at": "2025-12-04T02:56:46.423894"
  },
  {
    "post_id": "1p9zakf",
    "subreddit": "AskNYC",
    "title": "NY Health Insurance question: Do you have to see the primary care provider listed on your card?",
    "author": "rattlesnake30",
    "created_utc": "2025-11-29T15:43:51",
    "score": 5,
    "num_comments": 4,
    "text": "This is for NY Medicaid.  Asking here because I didn't get a clear answer in the medicaid sub and the healthinsurance sub didn't respond.\n\nThe FAQ says you can choose a new PCP at any time by changing it on the website or calling. The handbook says, \"If you need to, you can change your PCP in the first 30 days after your first appointment with your PCP. After that, you can change before the 1st of every month without cause, or more often if you have a good reason.\"\n\nSo if I change my PCP after the 1st of the month, I can't see the new one until the month after?\n\nWhat happens if I see a different doctor that's not on my card? Does it factor if I see someone else in the same office vs a different office? What if the doctor I chose is unavailable that day and I really need to see someone?\n\nI'm looking to change my doctor because although he's a nice guy, he wasn't helpful in getting the appropriate care for my serious health issue. The end of the month is approaching and I'm trying to decide between a few doctors who to switch to.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p9zakf/ny_health_insurance_question_do_you_have_to_see/",
    "scraped_at": "2025-12-04T02:56:47.385558"
  },
  {
    "post_id": "1p9rygk",
    "subreddit": "AskNYC",
    "title": "Where to read a book in a cozy holiday environment?",
    "author": "Dougiebrowngetsdown",
    "created_utc": "2025-11-29T10:41:08",
    "score": 30,
    "num_comments": 20,
    "text": "Looking for a lobby, cafe, bar or otherwise, where it’s a nice scene, festive, that I can have a drink or coffee and read my book to escape the cold and my apartment at the same time!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p9rygk/where_to_read_a_book_in_a_cozy_holiday_environment/",
    "scraped_at": "2025-12-04T02:56:47.517791"
  },
  {
    "post_id": "1p9att9",
    "subreddit": "AskNYC",
    "title": "Doctor for tinnitus?",
    "author": "dreeeeea",
    "created_utc": "2025-11-28T19:31:09",
    "score": 1,
    "num_comments": 7,
    "text": "Does anyone have a good recommendation for an ENT in the city, specifically for treating/soothing tinnitus? \n\n",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p9att9/doctor_for_tinnitus/",
    "scraped_at": "2025-12-04T02:56:47.741444"
  },
  {
    "post_id": "1p8yu5w",
    "subreddit": "AskNYC",
    "title": "Drive Time: La Guardia >Manhattan Valley",
    "author": "Civil_Lengthiness971",
    "created_utc": "2025-11-28T11:16:43",
    "score": 0,
    "num_comments": 9,
    "text": "I’m picking up a rental car at La Guardia on 12/23 and driving to the Manhattan Valley area. I’d like to pick up as early as possible, but also prefer to avoid as much daily commute congestion as possible. Any advice or guidance greatly appreciated if anyone commutes along this route. Thank you!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p8yu5w/drive_time_la_guardia_manhattan_valley/",
    "scraped_at": "2025-12-04T02:56:47.886000"
  },
  {
    "post_id": "1p8ks39",
    "subreddit": "AskNYC",
    "title": "NYC Congestion Pricing Multiple Charges on EZ Pass",
    "author": "Manic66",
    "created_utc": "2025-11-27T22:36:44",
    "score": 6,
    "num_comments": 5,
    "text": "I've been reviewing my charges on my EZ pass and have been charged getting double or triple charged on the congestion pricing tolls.\n\nWe've been in contact with EZ Pass and they say that they're working on it but it's been several months.\n\nWe use our car every day and are continuing to get double and triple charged every time we pass through a congestion toll. The EZ Pass customer service keeps saying that they are working on it every time we contact them. \n\nWe're just one car, I can't imagine how much fraudulent charges EZ Pass is charging people from congestion pricing every day. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p8ks39/nyc_congestion_pricing_multiple_charges_on_ez_pass/",
    "scraped_at": "2025-12-04T02:56:48.041498"
  },
  {
    "post_id": "1p8jzbr",
    "subreddit": "AskNYC",
    "title": "Can I drive from Brooklyn over the Brooklyn Bridge, south on the FDR, then up the West Side Highway without paying congestion pricing?",
    "author": "SavageMutilation",
    "created_utc": "2025-11-27T21:53:35",
    "score": 11,
    "num_comments": 18,
    "text": "Haven’t been able to find an answer to what should be an obvious question.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p8jzbr/can_i_drive_from_brooklyn_over_the_brooklyn/",
    "scraped_at": "2025-12-04T02:56:48.180594"
  },
  {
    "post_id": "1p8cwwl",
    "subreddit": "AskNYC",
    "title": "Free vet help for sick feral?",
    "author": "LeahHylia",
    "created_utc": "2025-11-27T15:59:34",
    "score": 3,
    "num_comments": 4,
    "text": "Is there any way I can get help for a feral from my local colony? She seems fairly old and has some breathing issues. We’re tight on money and can’t afford to take her in ourselves…does anyone know of any organizations that could help? ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p8cwwl/free_vet_help_for_sick_feral/",
    "scraped_at": "2025-12-04T02:56:48.388126"
  },
  {
    "post_id": "1p7qm2p",
    "subreddit": "AskNYC",
    "title": "Pharmacy is closed - need medication (Eliquis)",
    "author": "Engibeeros",
    "created_utc": "2025-11-26T21:26:28",
    "score": 11,
    "num_comments": 5,
    "text": "Hi everyone.\n\nMy family member is being treated, and I usually pick up prescription meds from the pharmacy close to my home. Today I found out that the pharmacy will be closed for the next few days, and unfortunately I forgot to pick it up and no pills left.\n\nDoes anyone know if it's possible to get the prescription filled at a different pharmacy without waiting for this one to reopen?\nIf anyone has experience with this situation, I'd appreciate any advice on what I should do.\n\nOr maybe someone has an extra Eliquis?\n\nThanks so much!\n\nUPD: thank you for your answers. \nI called my doctor and they send it to a different pharmacy. But in the pharmacy my insurance denied to pay for meds because they I’d had already paid it in my main pharmacy. \n\nSo I bought 5 pills for $56 ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p7qm2p/pharmacy_is_closed_need_medication_eliquis/",
    "scraped_at": "2025-12-04T02:56:48.524705"
  },
  {
    "post_id": "1p7mz3z",
    "subreddit": "AskNYC",
    "title": "Which are the best bartending jobs in Midtown East NYC over the holidays?",
    "author": "Cheap-Currency3404",
    "created_utc": "2025-11-26T18:29:38",
    "score": 0,
    "num_comments": 23,
    "text": "**Hi everyone, I’m looking for recommendations for holiday money/bartending jobs in Midtown East during the holiday season.**\n\nI’m open to a variety of spots, including:\n\n* **Weekday lunch shifts**\n* **Weekend brunch shifts**\n* **Holiday/seasonal weekend gigs near Rockefeller Center**\n* **Busy neighborhood bars or dives**\n\nI’d appreciate any insight. :) Is it still a decent time to make money behind the bar? Pre-covid yes, but how is it now?\n\nThanks in advance! **(You guys, RELAX. It's just a question. Others are reading and would probably like to know too. The world is a mess)**",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p7mz3z/which_are_the_best_bartending_jobs_in_midtown/",
    "scraped_at": "2025-12-04T02:56:49.946817"
  },
  {
    "post_id": "1p5wge8",
    "subreddit": "AskNYC",
    "title": "how does uninsured annual checkup work?",
    "author": "Great_Present_6584",
    "created_utc": "2025-11-24T18:14:39",
    "score": 0,
    "num_comments": 17,
    "text": "just so there's no surprises basically i'm self employed. This is first time I'll be completely uninsured for the year. I'm planning to register for next year using the marketplace but this year I have a annual checkup coming up. \n\nI want to tell my doctor all the issues I have like lingering cough, maybe do some blood work, you know the standard procedures, and also discuss what insurance they'll accept in the future. but i fear mentioning cough or w/e else will cost me more in my bill. What is the standard cost for uninsured annual checkup can I expect? \n\nThis is with NYU langone ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p5wge8/how_does_uninsured_annual_checkup_work/",
    "scraped_at": "2025-12-04T02:56:50.166410"
  },
  {
    "post_id": "1p5tc90",
    "subreddit": "AskNYC",
    "title": "I thought the Hudson was horrifically polluted; do people normally swim in it?",
    "author": "ZevlorTheTeethling",
    "created_utc": "2025-11-24T16:12:33",
    "score": 112,
    "num_comments": 82,
    "text": "I was reading Schlossburg’s essay, and I came across this line: “I did not—could not—believe that they were talking about me. I had swum a mile in the pool the day before, nine months pregnant. I wasn’t sick. I didn’t feel sick. I was actually one of the healthiest people I knew. I regularly ran five to ten miles in Central Park. I once swam three miles across the Hudson River—eerily, to raise money for the Leukemia and Lymphoma Society. I work as an environmental journalist…”\n\nSo clearly she wouldn’t go swimming in a heavily polluted river. Are parts of it pristine or something? I’m just really confused, and I don’t want to sift through reports.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p5tc90/i_thought_the_hudson_was_horrifically_polluted_do/",
    "scraped_at": "2025-12-04T02:56:50.327880"
  },
  {
    "post_id": "1p52zxm",
    "subreddit": "AskNYC",
    "title": "radiator = hell?",
    "author": "SuddenImagination232",
    "created_utc": "2025-11-23T19:41:41",
    "score": 58,
    "num_comments": 113,
    "text": "Surely this can't be the way people live every year? I was relocated to NY for work and this is my first winter here (please save the transplant comments, I promise I'm a good one) \n\nEver since temperatures dropped, I feel like I've had a nonstop sinus infection. My ENT track is constantly irritated. I'm not sick - I just feel like I constantly need to clear my throat, or don't feel 100% non-congested ever. I have mild headaches. \n\nIve started sleeping with a humidifier and I move it from room to room, but the upkeep with cleaning and de-molding seems insane - and it doesn't seem to be making a significant difference. \n\nWe've turned the knob next to the radiator off, but everything is still very hot and dry. \n\nAm I a weak human with a weak nasal path? Has everyone just accepted this as normal? Plz plz help, my fragile Californian mind can't comprehend continuing on like this. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p52zxm/radiator_hell/",
    "scraped_at": "2025-12-04T02:56:51.573851"
  },
  {
    "post_id": "1p3m8ec",
    "subreddit": "AskNYC",
    "title": "What can I do about heating in my apt?",
    "author": "quickAdvantage9504",
    "created_utc": "2025-11-22T01:27:10",
    "score": 6,
    "num_comments": 23,
    "text": "I live in a pre war building. The temperature in my apartment during the day is 67-68 and at night it drops to 64-65. That’s super cold for me and I’ve been struggling with waking up in the morning, taking showers, or being productive at home. I have a heated blanket but that only makes it harder to leave my bed. I use space heaters but try to limit their use because my electric bill is stupid high. \n\nI spoke to my super who said he’ll raise the building temp but nothing has happened. \nI feel like I can’t complain to 311 because my temperature is right at the limit. The issue is it’s too cold for me, I wish the limits were a bit higher. I am most comfortable when home temperature is closer to 72. \n\nWhat can I do about this? Appreciate any thoughts ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p3m8ec/what_can_i_do_about_heating_in_my_apt/",
    "scraped_at": "2025-12-04T02:56:53.013982"
  },
  {
    "post_id": "1p2ep9l",
    "subreddit": "AskNYC",
    "title": "Jackson Heights Buffets?",
    "author": "BigDragonfly3975",
    "created_utc": "2025-11-20T15:50:45",
    "score": 7,
    "num_comments": 4,
    "text": "I know after covid and honestly a little before that, a lot of buffets have closed down. I'm assuming there are at least a good one or two left. I'm looking for either like a Bangladeshi/Indian buffet. Any recommendations? if not in Jackson Heights any in the city? ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p2ep9l/jackson_heights_buffets/",
    "scraped_at": "2025-12-04T02:56:53.250824"
  },
  {
    "post_id": "1p2d48u",
    "subreddit": "AskNYC",
    "title": "How would you personally benefit from free MTA buses?",
    "author": "newengineerhere",
    "created_utc": "2025-11-20T14:50:29",
    "score": 10,
    "num_comments": 166,
    "text": "Not a political post nor am I trying to start a political fight here. Just genuinely curious on how my fellow new yorkers (and tourists) would benefit from free buses.\n\nWhile on the bus this morning, I started thinking about the whole free bus initiative. At face value, it sounds great - free is better than paying roughly 3 bucks. But I’m struggling to understand the actual end goal here is.\n\nIf the goal is to increase ridership, I’m not convinced the fare is the main barrier. If people genuinely can't afford it, NYC already has a reduced fare program. If the goal is to get people out of their cars and into buses, the $3 wasn’t what kept those people from switching because even with the congestion fee, they still use their cars (don't even start with the outer boroughs, you couldn't pay me $3 to take the bus over driving a car unless my destination was close by). \n\nThen there's also the potential of mentally unwell people using the buses to live in. There'll be nothing to stop them from get on and eventually causing problems for others\n\nAll of this makes me feel like I’m missing a key piece of the argument, which is why I’m asking - how would you benefit from free buses? What positive impacts do you see that I might be overlooking?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p2d48u/how_would_you_personally_benefit_from_free_mta/",
    "scraped_at": "2025-12-04T02:56:53.360320"
  },
  {
    "post_id": "1p1was4",
    "subreddit": "AskNYC",
    "title": "Has NYC become more unsafe recently?",
    "author": "shaquando",
    "created_utc": "2025-11-20T01:42:43",
    "score": 0,
    "num_comments": 14,
    "text": "Today, as we were walking back to the Sheraton in Downtown Brooklyn from the nearby subway station, a man standing outside a pizza store walked towards my partner and spit his mouthful of food towards her. We quickly ran and avoided any confrontation.\n\nI used to live in the NYC area for college and then work for about a decade up until covid. Never faced any incidents as a single male that made me feel unsafe.\n\nNow 5 years later, I moved back here along with my partner, and in just 1 month, we have already faced 2 scary incidents.\n\nThe previous incident was a couple weeks ago in the subway, but I guess subway incidents are more common.\n\nWhat I'm trying to understand is why does NYC feel more unsafe? Have things changed in recent years? Or are females/couples more likely to be targeted? My partner is traumatized and afraid of traveling alone because of this. I don't know if it matters here but our race is South Asian.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p1was4/has_nyc_become_more_unsafe_recently/",
    "scraped_at": "2025-12-04T02:56:54.167627"
  },
  {
    "post_id": "1p1nkzh",
    "subreddit": "AskNYC",
    "title": "Mold inspections",
    "author": "willow212",
    "created_utc": "2025-11-19T18:34:13",
    "score": 1,
    "num_comments": 4,
    "text": "Hey all, I’m looking for advice on getting a mold inspection of my apartment. I recently had a leak from a burst pipe, which led to mold growing on walls (visible) and a really strong mold smell in the flooring. I did an at home test (one of those Petri dish swab kits) of the floors, walls, and air, and all came back with pretty significant mold growth. The walls have been painted over and they retiled the floor in the room with the burst pipe but I’m worried this is just covering up the mold and it will continue to grow. I feel like I can still smell it in the apartment although maintenance assures me that there is no smell. \n\nI do have some significant health issues which make it risky for me to keep breathing in mold. Management is not going to do anything (it was a huge headache to get them to respond at all and replace the flooring) so I’ve been considering paying someone to come in and test the air and floors in a professional capacity, just to make sure it’s really been resolved. Has anyone hired a mold inspector in the past and if so do you have recommendations? How much is it likely to cost?\n\n",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p1nkzh/mold_inspections/",
    "scraped_at": "2025-12-04T02:56:54.311080"
  },
  {
    "post_id": "1p1gfeo",
    "subreddit": "AskNYC",
    "title": "Drivers priced out of driving in NYC CBD due to congestion pricing, how did you adjust your lives?",
    "author": "roenthomas",
    "created_utc": "2025-11-19T13:58:28",
    "score": 0,
    "num_comments": 5,
    "text": "Did you end up paying everyday?\n\nDid you change to an alternative form of transportation?\n\nDid you just not go into the CBD any longer?\n\nDid you change jobs so that you wouldn’t have to drive into the CBD?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p1gfeo/drivers_priced_out_of_driving_in_nyc_cbd_due_to/",
    "scraped_at": "2025-12-04T02:56:55.388999"
  },
  {
    "post_id": "1p0sfxn",
    "subreddit": "AskNYC",
    "title": "Place to get blood work done for free/low cost?",
    "author": "southernaerialist",
    "created_utc": "2025-11-18T19:06:10",
    "score": 6,
    "num_comments": 10,
    "text": "Hi, I'm a student from KY who's living in Brooklyn for the semester. I have health insurance, but it's through a hospital system in KY and doesn't cover any expenses out of state except for emergency room visits. I've been experiencing some weird symptoms and my doctor is wanting to run some blood work, but I don't go back to KY for another month. Is there any where in the city that I can have my doctor send lab orders to that I can get blood work done for free or low cost (preferably less than $100)? ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p0sfxn/place_to_get_blood_work_done_for_freelow_cost/",
    "scraped_at": "2025-12-04T02:56:55.523572"
  },
  {
    "post_id": "1p0gp04",
    "subreddit": "AskNYC",
    "title": "Any suggestions for a caterer for a thanksgiving office party around or close to Lincoln Hospital",
    "author": "_QTJAY_",
    "created_utc": "2025-11-18T11:36:59",
    "score": 0,
    "num_comments": 0,
    "text": "Any suggestions for a caterer for a thanksgiving office party around or close to Lincoln Hospital? Big plus for a place that can also offer options for Halal/kosher",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p0gp04/any_suggestions_for_a_caterer_for_a_thanksgiving/",
    "scraped_at": "2025-12-04T02:56:55.660949"
  },
  {
    "post_id": "1p0dn8u",
    "subreddit": "AskNYC",
    "title": "best practices for an air shaft bedroom",
    "author": "tendergrandma",
    "created_utc": "2025-11-18T09:40:16",
    "score": 16,
    "num_comments": 14,
    "text": "somehow in my years of living here i have never had a bedroom facing the airshaft. i have two (2) questions \n1. they heat my new place within an inch of its life. not complaining, i’d rather that than no heat. however, where i would normally just open the windows to regulate the temp, it doesn’t work that well in my room bc the airshaft a) doesn’t have much airflow and b) the air isn’t often that cold. other than fans, any tips to cool it down? i’m trying to avoid resorting to using my a/c in winter, lol.\n2. the darkness oh god the darkness. my room gets very little light. any life hacks for making it less depressing? i have some lamps, getting some string lights, etc, but would welcome any suggestions for things people have found to help in the past!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1p0dn8u/best_practices_for_an_air_shaft_bedroom/",
    "scraped_at": "2025-12-04T02:56:55.755935"
  },
  {
    "post_id": "1ozrtgc",
    "subreddit": "AskNYC",
    "title": "tips for nervousness about driving test",
    "author": "Early_Sundae5999",
    "created_utc": "2025-11-17T15:45:24",
    "score": 2,
    "num_comments": 3,
    "text": "Hi, good afternoon everybody. My name is Anika, and I’m from Queens, NYC.  Right now, I have just completed my second set of 10 driving lessons, but this one had 90-minute classes, whereas the previous 10-class package had 45-minute classes. I took my exam with another driving school in Fresh Meadows. I know three reasons why I failed, including my nervousness with my driving examiner, who was very cold, and three reasons, which included: I failed to stop before the stop line, I was unable to change lanes appropriately to make a left turn properly, and I failed in parallel parking as I went over the curb. Now that I’ve completed my second set of lessons with another school, I’m taking it at the exact location. Still, I feel a lot more confident in my skills than before, as my previous driving instructor did not take me on any main roads and was not as stern with me. I still feel nervous about taking it at the same place where I failed the first time. I know it’s not the location, and it’s biased to say that the examiner's day or mood can make or break your exam. It’s not those two things, but the students' performance, but I feel like the two factors I mentioned in this are making me nervous, so does anybody have any tips or advice for me?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ozrtgc/tips_for_nervousness_about_driving_test/",
    "scraped_at": "2025-12-04T02:56:56.868889"
  },
  {
    "post_id": "1ozniqw",
    "subreddit": "AskNYC",
    "title": "Chefs that do weekly premade meals or meal prepping?",
    "author": "WWHarleyRider",
    "created_utc": "2025-11-17T13:07:53",
    "score": 6,
    "num_comments": 1,
    "text": "I'm an office manager and I was wondering if there are any chefs that would want to offer my staff weekly premade meals or meal prepping? \nPre-covid we used to work with someone who would send us a weekly menu and people would pick which meals they wanted and how many for the following week. The chef then brought all of the made food to the office on Monday for distribution. Because we were doing a bulk buy, it ended up being cheaper than a lot of the pre-made meal services available, but he moved away from the city during the pandemic. \n\nDoes anyone know someone who does this?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ozniqw/chefs_that_do_weekly_premade_meals_or_meal/",
    "scraped_at": "2025-12-04T02:56:56.982532"
  },
  {
    "post_id": "1ozio3y",
    "subreddit": "AskNYC",
    "title": "PET PARENTS: any recommendations on USDA Certification for traveling abroad?",
    "author": "Organic_hair1996",
    "created_utc": "2025-11-17T10:06:40",
    "score": 0,
    "num_comments": 2,
    "text": "Hey everyone, happy Monday! \n\nI’m on the hunt for a vet that can give USDA certification for traveling abroad. \n\nTwo years ago, I had one that charged $600, which was a bit steep, but everything went smoothly. Now, we’re back at the same place, and they’re asking for $1000! They want an additional piece of paper that would cost $300!! \n\nDo you have any recommendations for a cheaper vet? I need to pay my rent by the end of the month, haha!\n\nThanks a bunch! Have a lovely day, even in this cold weather! \n",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ozio3y/pet_parents_any_recommendations_on_usda/",
    "scraped_at": "2025-12-04T02:56:57.089211"
  },
  {
    "post_id": "1oz97jg",
    "subreddit": "AskNYC",
    "title": "66 degrees at home (after 10pm), how do you stay warm?",
    "author": "gmnhs",
    "created_utc": "2025-11-17T01:33:13",
    "score": 71,
    "num_comments": 86,
    "text": "i know the law mandates the landlords to warm the apartments to minimum 68f during the day and 62f at night, and my landlord (small house) is doing exactly that. they make sure the temperature does not fall below these thresholds, and my downstair neighbors prefer being on the cooler side, which makes my apartment (on the 2nd floor/top floor, likely not insulated) feel unbearably cold. \n\ni did message my landlord a few times when it gets too cold, and they do raise the temperature, but then the temperature resets at the next heating cycle. i also get self conscious for asking for too many times. i feel like i don't really have the right to ask for more heat when my landlord is doing everything by the book.\n\non the bright side, my landlord said that they will install a sensor in my apartment and make the temperature in my apartment the driving factor that kicks on the boiler in the basement. i don't know when the installation will take place yet.\n\ni have been wearing hoodies, sweat pants, fluffy socks, and still feel cold. i have a small space heater but it jacks up the bill so much. i'm not a person that tends to get too warm or too hot, so i'm really curious how other people stay warm when the law makes the lowest temperature so low.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oz97jg/66_degrees_at_home_after_10pm_how_do_you_stay_warm/",
    "scraped_at": "2025-12-04T02:56:57.220958"
  },
  {
    "post_id": "1oz3cgm",
    "subreddit": "AskNYC",
    "title": "cafes near Columbus Circle?",
    "author": "MJ-NYC",
    "created_utc": "2025-11-16T20:31:36",
    "score": 0,
    "num_comments": 1,
    "text": "I'm looking for a cafe near Columbus Circle where I can work for an hour before a doctor's appointment. Thanks in advance for recs! ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oz3cgm/cafes_near_columbus_circle/",
    "scraped_at": "2025-12-04T02:56:57.651568"
  },
  {
    "post_id": "1oydm4n",
    "subreddit": "AskNYC",
    "title": "Loud Mouse Infestation in Apartment Walls/Ceilings/Floors--But never once gotten inside",
    "author": "firstnametwice",
    "created_utc": "2025-11-16T00:35:36",
    "score": 8,
    "num_comments": 6,
    "text": "I've lived in my apartment now for 4 years and every time the weather gets cold, I can hear mice scurrying around inside my walls/ceilings/floors. They've never once gotten through and I've never seen any signs of them.\n\n  \nI had mice in my previous apartment that did find entry points, and it was frustrating, but I managed.\n\nThis is almost worse, because they're so goddamn loud when they move around. I can hear them squeaking and kicking up debris.\n\n  \nOver the summer I finally got a cat, thinking that would deter these mice, but no. These mice have no fear. My cat is going insane and I feel really bad.\n\nI've tried banging on the walls, and that has sort of worked, but I feel like I have to do it every single day, multiple times a day. I don't want my neighbors to think I'm banging at them making noise.\n\nI want to email the property manager, but he'll probably just send an exterminator who won't be able to do anything since the mice are in the walls. I highly doubt they'd be willing to cut a whole in the wall, and honestly I don't want them to.\n\nI have those high frequency things you plug in, and I plugged a bunch of them in. Still, the mice don't care. Probably got used to the sound. Or those things are BS to begin with.\n\n  \nIf anyone has any advice or tips or has dealt with this specific issue before I would love to hear it. I'm paying close to $2K to live here.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oydm4n/loud_mouse_infestation_in_apartment/",
    "scraped_at": "2025-12-04T02:56:57.763684"
  },
  {
    "post_id": "1oy7ndp",
    "subreddit": "AskNYC",
    "title": "Sunday evening date ideas",
    "author": "xonatos",
    "created_utc": "2025-11-15T19:33:55",
    "score": 0,
    "num_comments": 11,
    "text": "Early 30s. Coming off a dating hiatus. I hit it off with someone that I like, and we have a date on a Sunday evening. She's a teacher and has work the next day, so we are somewhat limited time-wise. It's Sunday, stuff closes earlier than on a weeknight, and it's cold and dark now, so anything outside is probably a no-go. \n\nAny suggestions? We already did the dinner and drinks thing, so I'm hoping for something that stands out. Right now, a comedy club is the best I can come up with. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oy7ndp/sunday_evening_date_ideas/",
    "scraped_at": "2025-12-04T02:56:57.895391"
  },
  {
    "post_id": "1oxtorr",
    "subreddit": "AskNYC",
    "title": "I'm a graphic designer, and I really want to work in the production side, but I can't find many openings for print shops. What's the best way to put myself out there?",
    "author": "three3dee",
    "created_utc": "2025-11-15T09:55:10",
    "score": 1,
    "num_comments": 3,
    "text": "Title. I was a package design intern at Mattel/Fisher Price when their NYC office was still open, and it put me hands on with various production tasks. I found I enjoyed working with physical prints a lot, and I'd like to get into that.\n\nI applied to a lot of print production jobs through indeed an LinkedIn, but it feels like I'm just shouting into a void. Should I just walk into a shop and cold apply, build up experience by working with Staples or something? Do print shops even care about that? I don't know, I feel pretty lost about what my first step should be because nothing has worked so far. Any advice would be appreciated.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oxtorr/im_a_graphic_designer_and_i_really_want_to_work/",
    "scraped_at": "2025-12-04T02:56:58.052905"
  },
  {
    "post_id": "1owlspa",
    "subreddit": "AskNYC",
    "title": "Desperately looking for a thorough Gastroenterologist",
    "author": "mhylas",
    "created_utc": "2025-11-13T22:29:39",
    "score": 1,
    "num_comments": 17,
    "text": "Hello,\n\nA family member has been going through a lot of medical issues relating to the GI. The last Doctor we worked with was ok, but there were some mistakes made and we are trying to see if there are any better options out there.  \nCan anyone recommend a good GI doctor that is extremely thorough and trusted? Willing to travel to any borough.  ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1owlspa/desperately_looking_for_a_thorough/",
    "scraped_at": "2025-12-04T02:56:59.199501"
  },
  {
    "post_id": "1owgjue",
    "subreddit": "AskNYC",
    "title": "Permanent punctal plugs?",
    "author": "Men-Are-Trash",
    "created_utc": "2025-11-13T18:29:18",
    "score": 1,
    "num_comments": 0,
    "text": "Does anyone know if an eye doctor in Brooklyn or Manhattan (ideally) that will place permanent punctal plugs? I had them for about 15 years but then one fell out and I can only find doctors that will place the ones that dissolve after 3 months. I really am hoping to find a more permanent solution again! Thank you 😊",
    "url": "https://www.reddit.com/r/AskNYC/comments/1owgjue/permanent_punctal_plugs/",
    "scraped_at": "2025-12-04T02:56:59.390297"
  },
  {
    "post_id": "1owc50m",
    "subreddit": "AskNYC",
    "title": "Ankylosing Spondylitis Dr?",
    "author": "guyrsi",
    "created_utc": "2025-11-13T15:32:50",
    "score": 1,
    "num_comments": 1,
    "text": "Does anyone have a recommendation of a rheumatologist, physical therapist, or other doctor highly specialized in Ankylosing Sponylitis in or near NYC?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1owc50m/ankylosing_spondylitis_dr/",
    "scraped_at": "2025-12-04T02:56:59.479043"
  },
  {
    "post_id": "1ow8hly",
    "subreddit": "AskNYC",
    "title": "Doctor practices in NY that are not owned by private equity ?",
    "author": "screens_sun",
    "created_utc": "2025-11-13T13:15:41",
    "score": 94,
    "num_comments": 37,
    "text": "# Is there a map of doctor practices in NY that are not owned by private equity (obgyn, dermatologist, physician, dentist)? I reached my breaking point last week when a screen with a \"person (?)\" replaced the medical secretary, and I spent 30 minutes on the phone trying to finally reach someone at my practice, talk to a \"human-like\" automated voice that is waaaay more annoying than the old-fashioned one.\n\nI know this map for hospital owned by PE, [https://pestakeholder.org/private-equity-hospital-tracker/](https://pestakeholder.org/private-equity-hospital-tracker/)\n\n  \nED: \n\nMy post wasn’t about saving a few pennies. I have excellent insurance through my employer. What I want is a practice that hires and pays enough staff so I can actually reach someone by phone to ask a quick question, especially when they’re billing my insurance $500+ for certain services, and that doesn’t try to sell me a new “venture” at every visit (from startup Rx delivery to AI add-ons).\n\nYes I’m a millennial, but I genuinely enjoy living somewhere where I can interact with actual people beyond my family, friends, and colleagues, and that includes my healthcare providers. The problem with venture-capital-backed, corporate healthcare models is the lack of transparency around their many pipelines of “partners” for tests, exams, pharmacies, and more. My previous OB-GYN practice was owned by six practitioners, and the difference was huge. Now that I’m stuck with a large corporate group, every visit feels like a sales push I have to resist.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ow8hly/doctor_practices_in_ny_that_are_not_owned_by/",
    "scraped_at": "2025-12-04T02:56:59.580743"
  },
  {
    "post_id": "1ow6n7k",
    "subreddit": "AskNYC",
    "title": "Helping My Homeless Staff  - Looking for Clothing",
    "author": "Tall_Specialist305",
    "created_utc": "2025-11-13T12:07:38",
    "score": 127,
    "num_comments": 20,
    "text": "Hey neighbors, I am a small business owner, and I often hire market staff who are on the street looking for work. Many of my staff live in men's shelters and are often under-dressed for work, but are rising stars. This week, my staff was working for another vendor, wearing sneakers working outside on a very cold day, and he had to leave. I would like to buy him some boots, but my partner says I've already been over generous, as I feed them nearly every work day, donated clothing, and pay them for hours I probably shouldn't. \n\n  \nWhere can I pick up - or send him - to get some second hand work boots, winter boots, possibly a winter coat and some layers. He is also very tall about 6'3\" and very thin, 160lbs/28-30in waist, so probably has a hard time finding these staples that fit him second hand. Thrift stores and Good Will have become so trendy, and are no longer affordable the way they used to be...its all trendy cowboy boots and high fashion. \n\n",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ow6n7k/helping_my_homeless_staff_looking_for_clothing/",
    "scraped_at": "2025-12-04T02:56:59.829067"
  },
  {
    "post_id": "1ow5knd",
    "subreddit": "AskNYC",
    "title": "Looking for a Personal Injury Lawyer",
    "author": "WrongPop1655",
    "created_utc": "2025-11-13T11:27:38",
    "score": 1,
    "num_comments": 2,
    "text": "My aunt was recently struck by a mail truck in Queens, New York and she has a concussion. She is still in the hospital and we’re looking into getting a persona injury lawyer. She’ll definitely have to be out of work for a couple weeks, maybe months. She’s unable to walk by herself because she’s so dizzy from the concussion.\n\nI’m her only family and I’ve never dealt with a legal case or lawyers before. Does anyone have any recommendations on personal injury lawyers? I’ve looked at a couple online but they have a lot of mixed reviews where their websites will have 5 stars but then people in the Google Reviews will say they were terrible to work with. Just want to know if anyone had had to deal with something similar and if there are any trusted lawyers i can start contacting?\n\nAny help would be appreciated!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ow5knd/looking_for_a_personal_injury_lawyer/",
    "scraped_at": "2025-12-04T02:57:00.019247"
  },
  {
    "post_id": "1ow006n",
    "subreddit": "AskNYC",
    "title": "NYC Nurses, which hospital is best?",
    "author": "Standard_Sky22",
    "created_utc": "2025-11-13T07:40:04",
    "score": 1,
    "num_comments": 4,
    "text": "Hi everyone, I've been looking for jobs in the last couple months and have been mostly in between NYP and NYU. I've heard pretty good things about both but I wanted to hear from nurses what the working environment, pay, etc. is like to get a better idea between the two. I work in the OR so if anyone would happen to know anything about that unit specifically that would be great but will take any info on them generally! Thanks ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ow006n/nyc_nurses_which_hospital_is_best/",
    "scraped_at": "2025-12-04T02:57:00.122488"
  },
  {
    "post_id": "1ovsxt7",
    "subreddit": "AskNYC",
    "title": "Freelancer promised a 2-week full branding + website project, took a 50% deposit, dodged calls, delivered nothing usable, and then slow-rolled a bizarre “my partner died” story. NYC creatives — would you pursue small claims or walk away?",
    "author": "Alonzomosley226",
    "created_utc": "2025-11-13T00:31:23",
    "score": 26,
    "num_comments": 60,
    "text": "I’m posting here because I’m hoping to get honest perspective from freelancers, creative directors, designers, and anyone familiar with the NYC/NJ creative scene. I want to understand what’s normal, what isn’t, and how someone in your shoes would handle this situation. I run a small business in New Jersey, and this entire experience has been one of the strangest I’ve had.\n\nA creative director based in Brooklyn had been trying to work with us for over a year. She was persistent, enthusiastic, and extremely confident about her abilities. We eventually agreed to move forward when she emphasized — repeatedly — that she could complete the entire project in two weeks. That timeline was crucial for us because we have a major event on November 15 and needed everything ready beforehand.\n\nThe scope she proposed was big but straightforward: a refreshed logo, full brand package redesign, updated brand templates, a five-page website, email integration, newsletter setup, some digital prep for our event, and even an EMR integration idea she pitched so clients could create accounts, sign consents, and schedule with us. She presented herself as someone who specialized in fast, high-pressure turnarounds. Honestly, we believed her because she sounded so sure of herself.\n\nWe paid her 50% upfront, and almost immediately the entire energy of the project shifted.\n\nThe first week went by with almost no visible progress. Every attempt since then to get on an actual phone conversation was met with excuses or delays. By the second week, it was clear she wasn’t taking initiative on anything. Every time I checked in, the reason she hadn’t moved forward was different: she was sick, she had wrist pain, she forgot to hit send, her dog had an emergency, a page “glitched,” something disappeared, or she was suddenly going “offline until Thursday.” But even with all these dramatic reasons, there was still zero real work being produced. All she did was create endless folders — no functional pages, no design templates, nothing usable.\n\nShe kept reassuring me that everything was on track, and she guaranteed several times that the site would go live November 1, “no matter what.” November 1 passed without any output and she suddenly responded again, acting like everything was normal, while our entire event preparation timeline had been derailed.\n\nAnd then things took an unexpected and very odd turn: she started building up a story about her project partner dying.\n\nShe didn’t tell me directly at first. She hinted around it over the weekend. She randomly asked if I had heard from him — which made no sense because I’d never spoken to him. Then she mentioned his Type 1 diabetes “just to be transparent.” Only later did she finally say he had passed away. She gave me a detailed explanation of how she found out, but the timing felt extremely convenient: it all happened right when she was supposed to be delivering major parts of the project.\n\nThe details were confusing, too. She was in Florida house-sitting for a friend who was getting married in Hawaii. When I asked if she needed time or had to travel, she flatly said no because the family was Jewish and “the arrangements would be very quick.” I also noticed there was no obituary anywhere. And the way she told the story was unsettlingly flat — no emotion, no hesitation, nothing.\n\nShe also denied a conversation she initiated about exchanging services — something she was enthusiastic about before suddenly pretending it never happened. And anytime I questioned the lack of progress, she framed it as me having “trust issues from past developers,” even though my previous developers, yes the overseas ones that ended up scamming us, delivered more reliably and communicated better than she has.\n\nOur contract ends November 15, and I still have absolutely nothing I can use.\n\nSo now I’m trying to understand: from a freelancer’s perspective, how would you handle this if you were me? Would you pursue small claims to recover the deposit, and if so, does it make more sense to file in NJ — where my business is — or NY, since that’s where she partially resides? And if I decide to walk away instead, is there even anywhere meaningful to report this kind of behavior so other small businesses don’t get caught in the same situation?\n\nI’m worn out and genuinely trying to make a rational, fair decision here. I just want an honest, grounded opinion from people who actually understand how freelancing is supposed to work in the NYC creative world.\n\nTL;DR:\nHired an NYC creative director who promised she could deliver a full branding + five-page website project in two weeks for my NJ business’s Nov 15 event. Paid her 50% upfront, and the project immediately stalled — she avoided every call, barely replied to texts, produced no usable work, marked things “completed” that I actually had to do myself, and kept giving nonstop excuses. She then slow-rolled a strange story about her project partner dying right when major deadlines were approaching. Our contract ends Nov 15 and we still have nothing. Not sure whether to pursue small claims (NJ or NY) or just walk away — and if I walk away, where can I even report this so it doesn’t happen to someone else?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ovsxt7/freelancer_promised_a_2week_full_branding_website/",
    "scraped_at": "2025-12-04T02:57:00.260689"
  },
  {
    "post_id": "1ovl0th",
    "subreddit": "AskNYC",
    "title": "Any WFH jobs I can do?",
    "author": "No_Lingonberry_2401",
    "created_utc": "2025-11-12T18:22:02",
    "score": 0,
    "num_comments": 16,
    "text": "I’m tired of working and bussing my ass everyday to go to work in this cold ass weather. \n\nI work as a Teacher Assistant and don’t like it very much …I just want to self isolate and work from home. \n\nAny suggestions???my bachelors degree is in speech therapy (I can’t practice speech therapy I need the masters for that btw) if that helps much ? ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ovl0th/any_wfh_jobs_i_can_do/",
    "scraped_at": "2025-12-04T02:57:00.586523"
  },
  {
    "post_id": "1oux8ss",
    "subreddit": "AskNYC",
    "title": "ENT doctor recommendation in the city?",
    "author": "citymatryoshka",
    "created_utc": "2025-11-12T00:52:35",
    "score": 1,
    "num_comments": 1,
    "text": "Looking for an experienced, good ENT doctor to get a second opinion on my tinnitus issue. If any of you have had a good experience please send a rec my way. I’m in Manhattan.  \n\nThank you! ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oux8ss/ent_doctor_recommendation_in_the_city/",
    "scraped_at": "2025-12-04T02:57:01.413710"
  },
  {
    "post_id": "1ouqek8",
    "subreddit": "AskNYC",
    "title": "First date ideas/spots in Manhattan",
    "author": "exodiaous",
    "created_utc": "2025-11-11T19:21:49",
    "score": 1,
    "num_comments": 15,
    "text": " Hey everyone,\n\nI’m going on a first date this weekend with a girl who lives in Manhattan. I just moved to New Jersey, so I’m not too familiar with the city yet. We agreed to meet somewhere in Manhattan, and she’s free after 1 PM.\n\nI’m looking for ideas and specific spots for a cozy first date in the winter … somewhere we can talk and get to know each other. It could be a coffee shop, a cocktail bar, or maybe an activity if it’s not too cold. Ideally, I’d love a place with a relaxed, speakeasy-style vibe.\n\nI’m in my 30s and want the date to feel comfortable and a bit classy without being over the top. Any recommendations for places or ideas that fit that vibe?\n\nThanks in advance!\n",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ouqek8/first_date_ideasspots_in_manhattan/",
    "scraped_at": "2025-12-04T02:57:01.542689"
  },
  {
    "post_id": "1ouli50",
    "subreddit": "AskNYC",
    "title": "Need help disputing a parking ticket NYC",
    "author": "jackjackson123456789",
    "created_utc": "2025-11-11T16:05:07",
    "score": 0,
    "num_comments": 2,
    "text": "I parked my car in Manhattan and paid on the parking meter. The screen displayed “No need to display receipt.” The receipt itself says the same thing.\n\nUpon viewing the ticket, I see it was issued at 1427 hrs. My receipt shows 1428 hrs. I am unbelievably frustrated because what else am I supposed to do? It was freezing cold, the machine was like a 30 second walk away and utilizing it took another minute or 2. \n\nIs this something that can be thrown out? I wasn’t given a ticket for non payment, just for not showing a valid receipt. Does that matter?\n\nThanks for the help. Dont wanna sound like a crybaby but this is really annoying. Thank you.",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ouli50/need_help_disputing_a_parking_ticket_nyc/",
    "scraped_at": "2025-12-04T02:57:01.672848"
  },
  {
    "post_id": "1oujdz2",
    "subreddit": "AskNYC",
    "title": "Advice on burning radiator smell",
    "author": "deftones5554",
    "created_utc": "2025-11-11T14:46:04",
    "score": 0,
    "num_comments": 11,
    "text": "I have 3 radiators and they all smell horribly when the heat turns on. Two “fin” style cast iron ones and a pipe one in the bathroom. I think it’s a combo of burning paint and burning pipe sealant. Either way it’s so strong I feel like I get a headache when they turn on. I turned the two fin style ones off but I can’t turn the bathroom one off. \n\nAny advice on what to do here? My super doesn’t care and the management company won’t call me back about it. Could 311 help at all?",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oujdz2/advice_on_burning_radiator_smell/",
    "scraped_at": "2025-12-04T02:57:01.795063"
  },
  {
    "post_id": "1oudy65",
    "subreddit": "AskNYC",
    "title": "Bronx radiator: perpetually sick and extremely reactive",
    "author": "DimensionSolid8672",
    "created_utc": "2025-11-11T11:27:52",
    "score": 15,
    "num_comments": 20,
    "text": "I have an old steam radiator in my (prewar) apartment. I’ve gotten *horribly* sick every year after the first time the radiator turns on, and it lasts until around March when they start turning off. I do think it’s worth mentioning that I’ve lived in the same apartment and I’ve never had a similar style of heater anywhere else. \n\nMy main concern is the radiator in my bedroom. My body reacts with nearly immediate coughing fits galore and skin that cannot retain moisture—for the ENTIRE winter. The paint is chipped, but otherwise nothing seems to be wrong with it. Yet, in every other room I’m nearly fine, and I feel like I wouldn’t be sick if I didn’t have to sleep here. \n\nDoes this happen to anyone else? Is it possible that the chipped paint is causing my symptoms? Google essentially says heater sickness is a thing caused by dust and pollen. I do give the radiator a wipe down a few times a year with a wet towel. But a regular amount of dust and pollen don’t cause 4 month long illnesses. Any help would be much appreciated. ",
    "url": "https://www.reddit.com/r/AskNYC/comments/1oudy65/bronx_radiator_perpetually_sick_and_extremely/",
    "scraped_at": "2025-12-04T02:57:01.947587"
  },
  {
    "post_id": "1ouafbq",
    "subreddit": "AskNYC",
    "title": "Are people’s heat finally on?",
    "author": "gerund",
    "created_utc": "2025-11-11T09:11:01",
    "score": 45,
    "num_comments": 26,
    "text": "It is showing 67 in my apartment unit and 68 on the thermostat my landlord has in the hallway. I am in a 3 family home and have no idea if it’s a dummy thermostat or actually controls heat, and don’t want to fuck with it. We have the typical steam radiators. They were pretty weak when we moved in last March but they were on. I just read a previous thread about outside temp versus indoors and right now it’s 37 so I feel like it has GOT to come on at this point?\n\nNever dealt with this in a smaller building; previously lived in a larger tenement unit where shit came on Oct 1st and blasted a heatwave. Any advice is helpful and I know I can also just breakout the smaller heater. Just curious if at this point it should in fact be on.\n\nUpdate: okay said fuck it and decided to finagle the thermostat in the hallway before calling and was able to open up more of the radiators (one was open and rest were mostly closed) and the heat came on! i thought it was set to heat on but it wasn’t as I finally clicked some buttons. Thank you everyone for your advice and the breakdown of laws were helpful. Knowing the heat should in fact be on gave me the push!",
    "url": "https://www.reddit.com/r/AskNYC/comments/1ouafbq/are_peoples_heat_finally_on/",
    "scraped_at": "2025-12-04T02:57:02.112496"
  },
  {
    "post_id": "1oynm6z",
    "subreddit": "newyorkcity",
    "title": "Suggestion: Make It Fun for New Yorkers to Pay a Lot of Taxes",
    "author": "podkayne3000",
    "created_utc": "2025-11-16T09:50:31",
    "score": 0,
    "num_comments": 34,
    "text": "Some rich people truly are jerks, but plenty give huge sums to charity.\n\nThey don’t really object to the idea that they should share their wealth with others; the tax system is simply cold and adversarial. It makes taxpayers feel bad. \n\nThe whole war on millionaires or billionaires makes things worse. It must make any decent rich people, including those who simply lucked out and never did anything tough or illegal, feel paranoid and misunderstood. \n\nBut New York is a great city with wonderful services and support programs. Decent people who pay taxes to New York should feel proud, not looted. \n\nAn idea for Mamdani: Maje it rewarding and fun to pay city taxes. \n\n- Whenever any people pay city taxes, at least send them an email praising them for doing their civic duty and showing them a picture of a New Yorker helped by a city program. Include a short explanation of how the city budget works, and give taxpayers a voluntary survey asking them for their spending priorities. Use the survey results to create reports about what taxpayers say they want. \n\n- Whenever any people pay enough taxes so that sending them a paper thank you letter would be less than, say, 0.01% of the tax payment, send them a paper letter and an explanation of city spending, along with a chance to participate in the online survey. \n\n- Whenever any people pay the new proposed tax on millionaires, bring them to a party at City Hall or some other interesting city property. Have cool celebrity guests, who’ve been helped by city programs, talk about how they were helped. Have a couple of children who were helped by city programs talk about how they were helped. Bring in a choir of city workers to lead a “This Land Is Your Land” sing-along. Help the millionaire taxpayers understand what great things their tax payments do. Make them want to increase what they send to wonderful city programs, instead of feeling as if they’re being forced to pump cash into a mysterious, useless black hole.",
    "url": "https://www.reddit.com/r/newyorkcity/comments/1oynm6z/suggestion_make_it_fun_for_new_yorkers_to_pay_a/",
    "scraped_at": "2025-12-04T02:57:05.585665"
  },
  {
    "post_id": "1otfi9d",
    "subreddit": "newyorkcity",
    "title": "This is what I'd like the IBX stations to look like at the platform level. Also here is information for Public Comments, Scoping Meetings and Open Houses.",
    "author": "Jacky-Boy_Torrance",
    "created_utc": "2025-11-10T09:40:36",
    "score": 31,
    "num_comments": 3,
    "text": "Or at least a more compact version of this type of design if space would be an issue. I think not having open air stations would be good for hot and cold seasons, at least if it's climate controlled. \n\nBoth pictures are of the Réseau Express Métropolitain (REM) system in the Greater Montreal Region of Canada. The top picture is Île-des-Sœurs station, the bottom picture is Du Quartier station.\n\n#Info for Public Comments, Scoping Meetings and Open Houses regarding the Interborough Express: https://www.mta.info/project/interborough-express\n\n##Public comment\nWe’re accepting comments on the Draft Scoping Document for the Interborough Express environmental review phase. \n\nSubmit comments online: https://contact.mta.info/s/forms/public-hearing-form?Id=a0gcr000006jROn\n\nYou may also mail comments to:​  \nJordan Smith, Director, IBX  \n2 Broadway, C6.87​  \nNew York, NY 10004\n\nComments will be accepted until November 26, 2025.\n\n##Scoping meetings\nThree public scoping meetings will be held for the community to provide comments in person in Brooklyn and Queens, and via Zoom. Only one left remains.\n\n- November 12, 2025 \n    - 10 AM to 12 PM, online via Zoom \n    - 6 to 8 PM, online via Zoom\n\nRegister for the meetings: https://contact.mta.info/s/forms/public-hearing-form?Id=a0mcr000005UMg9&pId=PH\n\n##Open houses (just walk in)\nTwo public open houses will be held where the public can learn about the project and speak with IBX team members. \n\n- November 19, 2025, 6 to 8 PM\n    - Trinity Lutheran Church, 63-70 Dry Harbor Rd, Middle Village, NY 11379\n- November 20, 2025, 6 to 8 PM \n    - Brooklyn Public Library Sunset Park Branch, 5108 4th Av, Brooklyn, NY 11220",
    "url": "https://i.redd.it/ed46mtmqyf0g1.jpeg",
    "scraped_at": "2025-12-04T02:57:05.842021"
  },
  {
    "post_id": "1oteuow",
    "subreddit": "newyorkcity",
    "title": "Low Traffic Neighborhoods Are the Next Step for NYC’s Streets",
    "author": "TalR24",
    "created_utc": "2025-11-10T09:13:51",
    "score": 132,
    "num_comments": 12,
    "text": "New York has made major strides in rethinking its streets and prioritizing pedestrians again, from Open Streets to the Congestion Relief Zone, but these programs are fragmented, temporary, or do not do enough to prevent traffic deaths. Meanwhile, neighborhoods like the Lower East Side and East Village see heavy pedestrian and bike use, low car ownership, and frequent traffic accidents (think, the recent crashes coming off the Manhattan Bridge). The result is that streets meant for community life are still doubling as dangerous shortcuts for thru traffic.\n\nThe next Mayoral administration, with its bold plans, must adopt more forward-thinking in redesigning our streets as well.\n\nIn my latest article, I argue that the next logical step for NYC is to pilot Low Traffic Neighborhoods (LTNs): permanent redesigns that keep car access for residents but eliminate through routes. They’ve already worked in London and other cities, cutting crashes and pollution while boosting local livability. The East Village, especially around Tompkins Square Park, is perfectly suited to be NYC’s first LTN pilot. Would love to hear thoughts from others who live or spend time here on what you would want to see from an East Village LTN?",
    "url": "https://nycuriosity.substack.com/p/low-traffic-neighborhoods",
    "scraped_at": "2025-12-04T02:57:05.969311"
  },
  {
    "post_id": "1ost3ui",
    "subreddit": "newyorkcity",
    "title": "NBC News Now 2025 Election Night coverage cold open (includes 2025 NYC Mayoral Election)",
    "author": "Ezeitgeist",
    "created_utc": "2025-11-09T15:00:04",
    "score": 0,
    "num_comments": 0,
    "text": "",
    "url": "https://youtu.be/bq2VRmi4GWA?si=dH3rvkIK9C-5Ad1J",
    "scraped_at": "2025-12-04T02:57:06.175660"
  },
  {
    "post_id": "1oojv2y",
    "subreddit": "newyorkcity",
    "title": "NYC congestion pricing: Trump once again threatening to terminate program",
    "author": "statenislandadvance",
    "created_utc": "2025-11-04T16:28:28",
    "score": 37,
    "num_comments": 4,
    "text": "",
    "url": "https://www.silive.com/news/2025/11/nyc-congestion-pricing-trump-once-again-threatening-to-terminate-program.html?utm_source=redditsocial&utm_campaign=redditor",
    "scraped_at": "2025-12-04T02:57:07.838426"
  },
  {
    "post_id": "1oj6nmc",
    "subreddit": "newyorkcity",
    "title": "I just got screamed at by an unhoused person on the C train @110th; I’m voting for Sliwa I’m so sick of this abuse",
    "author": "SexyPeanut_9279",
    "created_utc": "2025-10-29T10:52:58",
    "score": 0,
    "num_comments": 60,
    "text": "",
    "url": "https://www.reddit.com/r/newyorkcity/comments/1oj6nmc/i_just_got_screamed_at_by_an_unhoused_person_on/",
    "scraped_at": "2025-12-04T02:57:09.768133"
  },
  {
    "post_id": "1nffyqc",
    "subreddit": "newyorkcity",
    "title": "Capital one cafe in union square",
    "author": "cactus_flower702",
    "created_utc": "2025-09-12T17:49:12",
    "score": 81,
    "num_comments": 12,
    "text": "To the guy that let me cut for the bathroom you’re a life saver. I hope your pillow is always\ncold. ",
    "url": "https://www.reddit.com/r/newyorkcity/comments/1nffyqc/capital_one_cafe_in_union_square/",
    "scraped_at": "2025-12-04T02:57:18.373653"
  },
  {
    "post_id": "1na1wdu",
    "subreddit": "newyorkcity",
    "title": "Want your COVID booster? Walgreens said try again next week.",
    "author": "echelon_01",
    "created_utc": "2025-09-06T11:07:49",
    "score": 54,
    "num_comments": 54,
    "text": "If you were hoping to get your booster soon, are under 65 and have no medical conditions, Walgreens isn't taking appointments yet.",
    "url": "https://www.reddit.com/r/newyorkcity/comments/1na1wdu/want_your_covid_booster_walgreens_said_try_again/",
    "scraped_at": "2025-12-04T02:57:18.536315"
  },
  {
    "post_id": "1n71bfu",
    "subreddit": "newyorkcity",
    "title": "Brooklyn Power Broker Files Raft of Lawsuits for Doctor Tied to…",
    "author": "barweis",
    "created_utc": "2025-09-02T21:09:24",
    "score": 0,
    "num_comments": 3,
    "text": "",
    "url": "https://nysfocus.com/2025/08/18/frank-seddio-no-fault-parisien",
    "scraped_at": "2025-12-04T02:57:18.882283"
  },
  {
    "post_id": "1n3d3xm",
    "subreddit": "newyorkcity",
    "title": "Updates on Leggionaires' outbreak in Harlem: 2 sources identified, investigation closed",
    "author": "Menschlichkat",
    "created_utc": "2025-08-29T13:07:00",
    "score": 22,
    "num_comments": 0,
    "text": "\"Health + Hospitals commisioner Michelle Morse announced today that Harlem Hospital and a nearby Skanska construction site contracted by NYCEDC have been IDed as the sources of the infections. This came after a city hall flack sought to wave The Daily News off from reporting the above.\"     \n\nSpecifically, \"before we ran this story, Adams spokeswoman Kayla Mamelak claimed we would be \"wrong\" if we published.\" (Quoting NYDN reporters Chris Sommerfeldt and Evan Simko-Bednarski on X)   \n\nQuote from Commissioner Morse: \"After an extensive investigation, we were able to identify two cooling towers that had a genetic match with patient specimens. We are working with building owners on next steps to protect the health and safety of Harlem residents and to prevent future clusters.\"     \n\nYou can read the accurate reporting of NYDN at the link above, or an excerpt below.    \n\n----     \n\nLegionnaires’ outbreak that has killed 7 in NYC potentially traced to Harlem Hospital     \n\nThe current outbreak of Legionnaires’ disease — the second largest in New York City history — may have its origins in  two city-run buildings, including Harlem Hospital, sources familiar with the matter tell the Daily News.     \n\nTwo buildings in uptown Manhattan — Harlem Hospital and a building leased by the city’s Economic Development Corporation  — are being eyed as sources of the outbreak, The News has learned. The outbreak killed its seventh victim on Thursday. Other sources are possible as well.     \n\nThe news comes as tests for the Legionella bacteria in New York City’s cooling towers have, under the Adams administration, fallen to a post-pandemic low, according to reporting by Gothamist earlier this month.      \n\nThe towers — which serve as evaporators for water coursing through the air conditioning systems of large buildings — can become an ideal environment for bacterial growth if not inspected and cleaned regularly.\n",
    "url": "https://www.nydailynews.com/2025/08/29/legionnaires-outbreak-that-has-killed-7-in-nyc-potentially-traced-to-harlem-hospital-sources/",
    "scraped_at": "2025-12-04T02:57:21.190302"
  },
  {
    "post_id": "1mlpvtc",
    "subreddit": "newyorkcity",
    "title": "This detail of an 1868 Dripps Map shows the town of New Utrecht. If you look closely you can see three villages clustered on the map: Fort Hamilton in the southwest, the tiny enclave known as Bay Ridge in the northwest, and New Utrecht towards the town’s eastern border with Gravesend.",
    "author": "TheWallBreakers2017",
    "created_utc": "2025-08-09T09:48:28",
    "score": 66,
    "num_comments": 4,
    "text": "In a couple of weeks i’m debuting a new historical walking tour of Old New Utrecht, Brooklyn complete with maps and photos, which I’m very excited to give! it’ll make for a great addition to my Bay Ridge Tours. I'm leading the Old New Utrecht walking tour on consecutive weekends: \n\nSunday 8/24 at 1PM — [https://www.eventbrite.com/e/freedom-fun-and-film-in-old-new-utrecht-walking-tour-tickets-1507960533549?aff=oddtdtcreator](https://www.eventbrite.com/e/freedom-fun-and-film-in-old-new-utrecht-walking-tour-tickets-1507960533549?aff=oddtdtcreator)\n\n\n\nSunday 8/31 at 1PM — [https://www.eventbrite.com/e/labor-day-weekend-old-new-utrecht-walking-tour-tickets-1507960854509?aff=oddtdtcreator](https://www.eventbrite.com/e/labor-day-weekend-old-new-utrecht-walking-tour-tickets-1507960854509?aff=oddtdtcreator)\n\n\n\nI’m also leading “Murder, Mayhem, Money and History in Old Southern Bay Ridge (Fort Hamilton) next Sunday 8/17 at 12:30PM — [https://www.eventbrite.com/e/murder-mayhem-money-and-history-in-old-southern-bay-ridge-tickets-1508238765749?aff=oddtdtcreator](https://www.eventbrite.com/e/murder-mayhem-money-and-history-in-old-southern-bay-ridge-tickets-1508238765749?aff=oddtdtcreator)\n\n\n\nNow to some of the details we can identify on this 1868 map:\n\n\n\n• In 1868 the southern end to the city of Brooklyn was 60th street, as seen here by the street grid in the upper left-hand corner of the map. \n\n\n\n• Bay Ridge was renamed such in 1853. This area of Kings County had been known as Yellow Hook (for the color of its natural soil), but yellow fever epidemics led to town leaders suggesting for a name change to distance themselves from the (at times fatal) disease. The Ovington artists' colony had been established in 1850. It was located on the former Ovington farm, which extended from Third Avenue to Seventh Avenue near Bay Ridge Avenue. The area around the Ovington Artist’s Colony had begun to refer to themselves as Bay Ridge, and florist James Weir (today remembered for the greenhouse across from Greenwood Cemetery) spearheaded the town’s name change suggestion. In the 1860s the village of Bay Ridge was centered around the intersection of Third Avenue and Bay Ridge Avenue and served by a dock at the foot of Bay Ridge Avenue (today’s 69th street pier). \n\n\n\n•Third avenue had been extended southward to Fort Hamilton’s Army Base and the Hamilton House hotel in 1848. By 1868 public transportation was traveling down third avenue all the way to the town of Fort Hamilton and the nearby army base of the same name. In 1868 horsecars were still the mode of public transportation. In 1878 steam motors would replace the horse cars\n\n\n\n• The tract of land labeled “Murphy” just above the “Bay” in Bay Ridge had been bought from Henry C. Murphy just two years prior by Eliphalet William Bliss. In 1867 Bliss founded the US Projectile Company. His company manufactured tools, presses, and dies for use in sheet metal work, as well as shells and projectiles. He owned 26 acres, eventually passing away in 1903. Upon his death, Bliss willed the estate to NYC provided it be used for parkland. The park is today known as Owl’s Head Park.  \n\n\n\n• Steward avenue is shown on this map extending north from the village of Fort Hamilton. Most often spelled as Stewart Avenue, Stewart Avenue roughly follows the path of Fourth/Fifth Avenue south of 86th Street. North of 85th Street, Stewart Avenue was a forest road, just thirty-three-feet wide and was named for James and Rime Stewart. It once ran all the way north to roughly 65th street and 7th avenue to the home of George T. Hope, president of the Continental Insurance Company. James Weir florist, is on the map as well. He was the western neighbor of George T. Hope. \n\n\n\n• The road extending from the southern border of the town of New Utrecht shown on this map is the State Road, but you can see that it also extends east into Gravesend. Today that road ends at what the borderline of the towns (now neighborhoods) of Bensonhurst (New Utrecht) and Gravesend at 78th street and Bay Parkway. You probably know this road. It’s Kings Highway. On this map you can see that the State Road turns south, connecting to what was then Fort Hamilton Avenue (today’s Fort Hamilton Parkway). \n\n\n\n• Speaking of the border of Gravesend and New Utrecht, today that border is Bay Parkway (or 22nd avenue as it was originally known). You can find that border (by the color change on the map, but also) by seeing the The Indian Pond in the right-hand portion of the map. It sits on the dividing line between the towns of New Utrecht and Gravesend. The pond was drained at the beginning of the 20th Century and eventually turned into Seth Low Park, sitting roughly between 73rd and 75th streets. Beyond the color of this map, if you’re in the area, you can tell the difference in towns because the grid changes. Gravesend’s streets run east-west (as in West 12th street), and its avenues are lettered. Today the next avenue running northeast-southwest south of Bay Parkway and 72nd street is Avenue O, which means if you’re standing on Bay Parkway you’re technically in Bensonhurst/New Utrecht… if you walk into the park, you’re technically in Gravesend.\n\n\n\n• The railroad running diagonally northwest from the northwest portion of New Utrecht is the Brooklyn and Bath Plank Road into New Utrecht. In 1864 it began service a steam railroad between 25th St and 5th Ave in South Brooklyn to what is today 65th Street and New Utrecht Avenue. In 1867, the steam line reached Coney Island, making it the first steam railroad to reach the Atlantic Ocean at this location. Jumping way ahead to 1885, it eventually became the Brooklyn, Bath and West End Railroad. It’s the forerunner to today’s West End Elevated which the D Train runs on. There was a station not far from where today’s 18th Avenue West End D Train station is located. Today it runs on New Utrecht Avenue. This road ran all the way south to the water. Today Bay 16th is wider than the other Bay Streets, as it was previously this railroad’s path.  \n\n\n• What is today 18th avenue already exists on this map, but it wasn’t known as 18th avenue at the time. It was then the road that connected the towns of New Utrecht and Flatbush, running from the eastern portion of New Utrecht’s town square, north to roughly where 53rd street is today, before heading northwest at the Van Nuyse property into the town of Flatbush, connecting with the now gone Lott Lane. Today 18th avenue runs relatively straight until curving northeast at 47th street and becoming Ditmas Avenue once it passes Coney Island Avenue in the old town of Flatlands. A small portion of this originally road still exists as Old New Utrecht Road.  \n\n\n• The small Cross at the southeastern section of the New Utrecht town square is for the Dutch Reformed Church. The Church which stood when this map was published in 1868 is very much still standing today. It’ll be a prominent stop on my Old New Utrecht Tour.\n\n\n\n• Egbert Benson owned a huge tract of land. The area near his holdings later became “Bensonhurst By The Sea” by the end of the 19th Century. Today we know some of this area as Bensonhurst and the rest of it as Bath Beach. The original Egbert Benson  (June 21, 1746 – August 24, 1833) was an American lawyer, jurist, politician and Founding Father who represented New York State in the Continental Congress, Annapolis Convention, and United States House of Representatives. He served as a member of the New York constitutional convention in 1788 which ratified the United States Constitution. He also served as the first attorney general of New York, chief justice of the New York Supreme Court, and as the chief United States circuit judge of the United States circuit court for the second circuit.\n\n\n\n• The Delaplaine land east of Fort Hamilton is part of today’s location of Dyker Golf Course and Dyker Park. You can see there were already woods/parkland there by its delineation with grass drawn on the map\n\n\n\n• There are several prominent family names you might recognize like Remsen, Bergen, Van Brunt, Bennett, Benson, Cropsey, Stillwell, Wycoff, and Bennett… and a few others once prominent that are foreign to most of us now like Cowenhoven.  \n\n\n• The famed Washington Cemetery already existed in 1868 on the border of New Utrecht and Gravesend, though it’s tiny compared to it’s current size. In 1868 It didn’t run further Northeast past Bergen Lane.  Bergen Lane no longer exists and the road which divides the cemetery shown here on the map takes the path of what was formerly called Gravesend Avenue and is today McDonald Avenue south of the Washington Cemetery. ",
    "url": "https://i.redd.it/4owltkhvzzhf1.jpeg",
    "scraped_at": "2025-12-04T02:57:22.407880"
  },
  {
    "post_id": "1p6imcb",
    "subreddit": "Brooklyn",
    "title": "Do Not Stay at Outpost Club Greepoint House: Cockroach Infestation",
    "author": "PowerfulDocument1568",
    "created_utc": "2025-11-25T12:29:14",
    "score": 67,
    "num_comments": 9,
    "text": "https://preview.redd.it/oqhygssguf3g1.jpg?width=4032&format=pjpg&auto=webp&s=bb25eb3b8c431da5e26dd51f233c0db617c05dab\n\nhttps://preview.redd.it/y55versguf3g1.jpg?width=3024&format=pjpg&auto=webp&s=c58dd47b4347a33d1c65b1c6c7a706571fdf8e25\n\nhttps://preview.redd.it/mxfzuqsguf3g1.png?width=980&format=png&auto=webp&s=e7bb641b2b6c03bede46d8f32a1f405db538a442\n\nhttps://reddit.com/link/1p6imcb/video/37brkqihuf3g1/player\n\n  \n  \n**TL;DR:** Cockroach infestation, awful customer service, and terrible value for paying at least $2.3k.\n\nJust sending out a warning to anyone considering staying at Outpost Club Greenpoint House.\n\nFirst off, the entire building has a cockroach problem, and customer service is horrible. We begged them to fix the living conditions through maintenance tickets, emails, and phone calls. Their solution? They sent an “exterminator” who put down two sticky traps and left, as if that would solve an infestation hiding in every nook and cranny of the kitchen.\n\nBecause of that, the provided kitchenware and utensils basically became cockroach breeding grounds. You’d open a cabinet and a roach the size of your thumb would crawl out onto the counter.\n\nI wouldn’t wish this on my worst enemy, especially when you’re paying at least $2.3k+ for a room that’s about half the size of a Starbucks bathroom, where the bed alone takes up half the space.\n\nOn top of that, since people usually stay short-term, they just ditch their stuff and leave it for the next person to deal with: rotting food (in and out of the fridge), nasty ripped-up couches, stinky luggage, heavy broken speakers, etc.\n\nYou’d hope that at least the “amenities” would make up for it, but nope. They’re all crammed into this creepy, dusty boiler-room-style dungeon with narrow hallways and terrible lighting (basically the Paris Catacombs). You have to play scavenger hunt in this weird maze just to find the amenities, and when you do, half of them are locked. Also, you don’t even get a regular fob; you have to download this fuckass app to unlock doors, and if you forget your phone in your apartment, you’re completely screwed.\n\nAs for the actual amenities:\n\n* The gym is basically a sad hotel gym in a dim basement with ripped-up flooring and no ventilation.\n* There’s a tiny yoga room next to it, also with no ventilation, so if you actually try to work out, you’ll just end up feeling like you’re going to pass out.\n* The game room and “theater” (really just a small room with a big TV that doesn’t even work) both have a foul odor, like some kind of rotten gas leak, so it doesn’t even feel healthy to be in there.\n* The library and co-working spaces have poor air circulation too, so staying there for long periods can easily give you a headache.\n\nI signed a nine-month lease (without touring, because they don’t let you tour unless you’re signing for a full year), and I didn’t realize how bad the value was until I moved in. Just trying to keep other people from making the same mistake I did.",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1p6imcb/do_not_stay_at_outpost_club_greepoint_house/",
    "scraped_at": "2025-12-04T02:57:25.277773"
  },
  {
    "post_id": "1p1ssuo",
    "subreddit": "Brooklyn",
    "title": "Home for the holidays? Foster kittens!",
    "author": "sunsetparkcats",
    "created_utc": "2025-11-19T22:32:19",
    "score": 44,
    "num_comments": 6,
    "text": "Will you be home for the Thanksgiving or winter holidays? Cat rescues in Brooklyn are in desperate need of fosters. \n\nMy rescue has 2 litters of kittens who would bring so much holiday joy,  are healthy, fun and beautiful.  They just need a little room to stretch out.  \n\nAnd in winter we routinely come across situations so urgent due to the cold that without fosters,  cats may literally die while we try to arrange help. \n\nFostering is a very rewarding experience.  Cat cuteness without a 20year commitment! \n\nIf you are up for some short term buddies  please ask any questions here or apply at sunsetparkcats.org/foster",
    "url": "https://www.reddit.com/gallery/1p1ssuo",
    "scraped_at": "2025-12-04T02:57:25.436927"
  },
  {
    "post_id": "1p0t5dy",
    "subreddit": "Brooklyn",
    "title": "How is Berry Park in Williamsburg during the winter?",
    "author": "pretty_in_possible",
    "created_utc": "2025-11-18T19:37:51",
    "score": 4,
    "num_comments": 2,
    "text": "Do they have the rooftop bar insulated or heated at all? What’s it like? I’m looking for a rooftop bar somewhere you don’t need a reservation and I’ve heard this is nice, but I don’t know about the cold situation. \n\nTHANKS!",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1p0t5dy/how_is_berry_park_in_williamsburg_during_the/",
    "scraped_at": "2025-12-04T02:57:26.834515"
  },
  {
    "post_id": "1p0kaed",
    "subreddit": "Brooklyn",
    "title": "covered steam pipe heating is too hot",
    "author": "tendergrandma",
    "created_utc": "2025-11-18T13:48:21",
    "score": 5,
    "num_comments": 26,
    "text": "EDIT: just to reiterate, I HAVE OPENED THE WINDOW!!! i say it in my post but people seem to be missing it. obviously opening the window is the obvious fix, but the air from the airshaft is hot already so it doesn't help. i've lived in buildings like this my whole life, this is just the first time that opening the window didn't solve the problem\n\ndisclaimer: i’d rather my apartment be too warm than have the landlord neglect to heat the building at all! but it is still brutal in here\n\ni just moved into a new apartment and oh boy is it TOASTY. our old place erred on the side of being too cold, and when it did get toasty we would just open the windows and it was fine. for the new place, at least in my bedroom, that doesn’t work. the heat is intense and my window faces the airshaft, so opening the window doesn’t get much airflow anyway (and often times the air the does blow in is warm anyway, i assume there’s some sort of exhaust that lets out in the airshaft). \n\nthe heat in my room doesn’t come from a normal steam radiator but from a steam pipe that’s covered—pictured here. if the pipe was exposed, my instinct would be to wrap it in insulation. since it’s not, i’m not sure how to proceed. i guess i could just use pipe insulation on the casing and hope for the best? or cover up the grates with foam somehow? any suggestions would be appreciated, i sleep hot at the best of times and so with the room being so toasty and not being able to let the cold air in from outside, it’s been dire ",
    "url": "https://i.redd.it/c9kcote8a22g1.jpeg",
    "scraped_at": "2025-12-04T02:57:26.940853"
  },
  {
    "post_id": "1oxdivr",
    "subreddit": "Brooklyn",
    "title": "Custom shutters?",
    "author": "alisonilyse",
    "created_utc": "2025-11-14T19:31:43",
    "score": 19,
    "num_comments": 30,
    "text": "Know a carpenter that can make interior shutters? I need to block the noise and cold. Pics for reference \nThanks :) ",
    "url": "https://www.reddit.com/gallery/1oxdivr",
    "scraped_at": "2025-12-04T02:57:27.141130"
  },
  {
    "post_id": "1ox1dn4",
    "subreddit": "Brooklyn",
    "title": "Hospital with Private rooms post childbirth?",
    "author": "Salty-Scholar3654",
    "created_utc": "2025-11-14T11:36:05",
    "score": 7,
    "num_comments": 40,
    "text": "Brooklyn Methodist has no straight answers for rooms being private, it's not guaranteed. I don't mind paying. \n\n  \nAny recs for a hospital near Park Slope/Windsor Terrace/Kensington with a great L&D department with private rooms?\n\n  \nThank you!",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ox1dn4/hospital_with_private_rooms_post_childbirth/",
    "scraped_at": "2025-12-04T02:57:27.373761"
  },
  {
    "post_id": "1ougewz",
    "subreddit": "Brooklyn",
    "title": "Best pizza places to find in winter season?",
    "author": "KaleidoArachnid",
    "created_utc": "2025-11-11T12:57:58",
    "score": 4,
    "num_comments": 39,
    "text": "Just looking for some good pizzerias in Brooklyn, NY specifically because now that it’s cold outside, I want to dine in on warm pizza.\n\n\n\nBasically, what I am looking for are calzones worth at least $15 as I am a glutton for hot and spicy food, so I was looking for activities to do in the season.",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ougewz/best_pizza_places_to_find_in_winter_season/",
    "scraped_at": "2025-12-04T02:57:28.732466"
  },
  {
    "post_id": "1othj01",
    "subreddit": "Brooklyn",
    "title": "This is what I'd like the IBX stations to look like at the platform level. Also here is information for Public Comments, Scoping Meetings and Open Houses.",
    "author": "Jacky-Boy_Torrance",
    "created_utc": "2025-11-10T10:58:07",
    "score": 12,
    "num_comments": 0,
    "text": "Or at least a more compact version of this type of design if space would be an issue. I think not having open air stations would be good for hot and cold seasons, at least if it's climate controlled. \n\nBoth pictures are of the Réseau Express Métropolitain (REM) system in the Greater Montreal Region of Canada. The top picture is Île-des-Sœurs station, the bottom picture is Du Quartier station.\n\n#Info for Public Comments, Scoping Meetings and Open Houses regarding the Interborough Express: https://www.mta.info/project/interborough-express\n\n##Public comment\nWe’re accepting comments on the Draft Scoping Document for the Interborough Express environmental review phase. \n\nSubmit comments online: https://contact.mta.info/s/forms/public-hearing-form?Id=a0gcr000006jROn\n\nYou may also mail comments to:​  \nJordan Smith, Director, IBX  \n2 Broadway, C6.87​  \nNew York, NY 10004\n\nComments will be accepted until November 26, 2025.\n\n##Scoping meetings\nThree public scoping meetings will be held for the community to provide comments in person in Brooklyn and Queens, and via Zoom. Only one left remains.\n\n- November 12, 2025 \n    - 10 AM to 12 PM, online via Zoom \n    - 6 to 8 PM, online via Zoom\n\nRegister for the meetings: https://contact.mta.info/s/forms/public-hearing-form?Id=a0mcr000005UMg9&pId=PH\n\n##Open houses (just walk in)\nTwo public open houses will be held where the public can learn about the project and speak with IBX team members. \n\n- November 19, 2025, 6 to 8 PM\n    - Trinity Lutheran Church, 63-70 Dry Harbor Rd, Middle Village, NY 11379\n- November 20, 2025, 6 to 8 PM \n    - Brooklyn Public Library Sunset Park Branch, 5108 4th Av, Brooklyn, NY 11220",
    "url": "https://i.redd.it/2tel4dgkcg0g1.jpeg",
    "scraped_at": "2025-12-04T02:57:28.964597"
  },
  {
    "post_id": "1oqyfxr",
    "subreddit": "Brooklyn",
    "title": "Letter to send Zohran on Behalf of Disabled New Yorkers",
    "author": "Sea-Ad-5248",
    "created_utc": "2025-11-07T11:08:12",
    "score": 144,
    "num_comments": 77,
    "text": "My life and body was destroyed by Covid 4 years ago, there is really NO support for those of us who have been sick and struggling with disablity due to covid for years . Its extraordinarily difficult to get people to care unless they are sick themselves but this could happen to you, I was insanely healthy prior to 2022 and my body has fallen apart completely due to repeat covid infections all the while being lied to by doctors and shuffled around at \"covid centers' where doctors arent even slightly educated in my illness. At my worst I was bed bound up to 22 hours a day, I couldnt watch TV or speak on the phone, I couldnt sleep, I was in absolute HELL and terrified for my life. I raised money for treatment via specialists which currently paying out of pocket is the only way to get treatment as nothing is FDA approved. I have confirmed mitochondrial dysfunction, severe immune dysfunction, nervous system dysregulation via testing and neurological issues .None of this is currently curable or treatable under insurance. If I get better its on my own dime and will take years of expensive treatments and pacing. My life has STOPPED and Ive been sick for 4 years total. I am lucky Ive been able to raise money and have access to two respected specialists in NY.  Most in my position are not so lucky and are deteriorating or are unable to improve due to lack of care. This WILL happen to more of you, I thought it would never happen to me and I was wrong.  Im sharing a letter of asks for our new mayor to advocate for New Yorkers with long covid please help protect New Yorkers from further harm. Pleased take a minute and support it would mean the world to those of us affected .\n\nThank you!\n\nEmail : [mamdaniz@nyassembly.gov](mailto:mamdaniz@nyassembly.gov).\n\n Dear Assembly member Mamdani,\n\n  I am a New Yorker, and I am asking you to take leadership on Long COVID as a mass disabling event that is still ongoing on behalf of sick and disabled New Yorkers.\n\nUp to half a million New Yorkers are now chronically ill post-COVID. Roughly 1 in 10 adults develop long-term functional impairment after infection. Tens of millions of American children have already been infected, meaning hundreds of thousands will reach adulthood already physiologically damaged.\n\nThis is not limited to “long COVID patients.” Millions of New Yorkers who are already sick or disabled — including those who are immunocompromised, chronically ill, or medically vulnerable for any reason — face heightened risk of further harm from repeat COVID infections, even if they never develop the classic “long COVID” label. We cannot continue to abandon them.\n\nNew York needs:\n\n1. A presumptive disability category for Long COVID after 3 months\n2. Public post-viral clinics in every borough\n3. Home care access for disabled adults under 65\n4. Guaranteed remote work rights as an ADA accommodation\n5. Housing stabilization for newly disabled tenants\n6. Public education on reinfection and chronic disability risk, Public education is PREVENTION. Most don’t know that ever\n\ny reinfection can cause permanent organ damage or trigger long-term disability. When the state fails to communicate this clearly, people can’t make informed choices — and the long-term cost of that silence lands on our Medicaid system, our disability system, and our workforce. Prevention is cheaper — and far more humane — than managing more disabled New Yorkers.\n\n7) Weekly transparent surveillance of infection + disability data\n\n8) State-funded mental health support for chronic illness disability — including support groups and therapy programs led by clinicians trained in post-viral illness trauma and chronic illness psychology\n\n9) Mandatory statewide continuing medical education in post-viral illness, so clinicians in New York are actually informed by current science rather than leaving patients to know more than their own doctors\n\nNew York policymakers have swept this pandemic under the rug since 2021 — and the continued refusal to implement basic protections like the ones above during an ongoing mass disabling event is a moral and civic failure. It is, frankly, a crime against New Yorkers, and it must be corrected immediately.\n\nThank you for your leadership,\n\n\\[Name\\]  \n\\[Neighborhood / Borough\\] \\[Email\\]\n\n  \nNOTE:  I understand the mayor cannot do these things himself however he has influence and may actually be sympathetic to the mass abandonment of human beings damaged by covid in this city please don't lecture me about how the government works Its dismissive and besides the point and In my opinion is a deflection technique IE the content makes you uncomfortable so you dismiss it by telling yourself I don't know what Im talking about. I hope to be part of change in this country and I hope to see the rampant ableism and complete abandonment of sick and disabled people in this sick country become socially unacceptable. I write a lot of letters to policy makers this is just one of them. \n\n  \n🖕 LUXTRESS",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oqyfxr/letter_to_send_zohran_on_behalf_of_disabled_new/",
    "scraped_at": "2025-12-04T02:57:29.066217"
  },
  {
    "post_id": "1oqviu6",
    "subreddit": "Brooklyn",
    "title": "Cat injury to nail/paw",
    "author": "Such-Hovercraft7580",
    "created_utc": "2025-11-07T09:15:01",
    "score": 12,
    "num_comments": 1,
    "text": "So I adopted this stray cat (M, tabby, 8m) I found recently who’s been great but recently got out by accident trying to explore my roommates room that led to the backyard tuesday night. He now has an injured nail on his paw that seems to have been ripped out by accident. It was bleeding yesterday and when it was cleaned out by petco they said it looks like a deeper wound and that he may need surgery. I then took him to a vet ER and they wanted to charge me $859 for all the blood work, medication, and the procedure. I can’t get approved for a medical credit card or scratch so I’m at a loss of what to do. The vet yesterday told me that I need to take him to get that taken care of by latest today or he could risk infection. I don’t know what to do I can’t get an ASPCA appointment and it’s Friday so most things are going to close for the weekend. ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oqviu6/cat_injury_to_nailpaw/",
    "scraped_at": "2025-12-04T02:57:29.492976"
  },
  {
    "post_id": "1ooik9a",
    "subreddit": "Brooklyn",
    "title": "I hear Brooklyn was friendlier pre COVID. People cared for each other. How to bring it back?",
    "author": "Concentric_Mid",
    "created_utc": "2025-11-04T15:36:41",
    "score": 0,
    "num_comments": 56,
    "text": "I made Brooklyn my home ~3y ago. \n\nI've heard of NYC people being rude, but the erosion of societal norms is something new, long life New Yorkers tell me. They say everything changed after COVID. \n\nIs this true? \n\nIf yes, is this something we're stuck with? Do people have real ideas to turn things around? \n\nPLEASE don't use this to bash each other, \"transplants,\" immigrants, blacks, whites, boomers, Gen Z, etc etc. I would love to hear from people who helped create the fabric of this city.\n\n**EDIT: I know I'm not describing something unique to Brooklyn, but I am looking to have a conversation about Brooklyn**",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ooik9a/i_hear_brooklyn_was_friendlier_pre_covid_people/",
    "scraped_at": "2025-12-04T02:57:30.659169"
  },
  {
    "post_id": "1oo35um",
    "subreddit": "Brooklyn",
    "title": "Any band looking for a singer? Bed Stuy/Brooklyn area",
    "author": "Agitated_Leopard_479",
    "created_utc": "2025-11-04T04:38:23",
    "score": 4,
    "num_comments": 0,
    "text": "Hey I’m 25F and I love to sing. I’ve been in bands before, but they just didn’t work out. I’m more settled now w a 9-5 job, but I want to take music more srsly.\n\nMy music style/taste ranges from emo/punk (think Paramore, pierce the veil, sleeping w sirens) to doing r&b (think Kehlani, HER, jhene aiko). \n\nI would love to make a reincarnated Paramore of sorts - powerful vocals, guitar, and sick drums/bass. Otherwise I’m open to different vibes depending on the ppl I work w. \n\nI have the ability/ willingness to practice 2-3x a week and do AT LEAST 1 show/ month. It would be awesome if this band lead somewhere big!\n\nComment or DM me if ur a band looking for a singer like me! Hopefully we can work together and do great things 🥰",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oo35um/any_band_looking_for_a_singer_bed_stuybrooklyn/",
    "scraped_at": "2025-12-04T02:57:30.945947"
  },
  {
    "post_id": "1ojv8c7",
    "subreddit": "Brooklyn",
    "title": "Anyone foster or can help with kittens in Brooklyn",
    "author": "Realistic-Tailor-86",
    "created_utc": "2025-10-30T05:40:30",
    "score": 52,
    "num_comments": 16,
    "text": "I live in Brooklyn I care for some feral cats in my neighborhood. Last week a kitten only a few months old started to show up for feeding. She’s super friendly and I want to find her a home. Unfortunately I have cats and  I am about to start a move out of my parents house and it’s not the right time. Now my new concern is on my outside camera last night I just noticed two even smaller kittens probably around 9-10 weeks and it’s cold and now raining. Is there anyone or any place anyone knows who are willing to take small kittens in or to at least foster. Last summer I had one cat fixed and all her babies rehomed but now am running out of people who want kittens. I hate that winter is coming and to leave them out there?",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ojv8c7/anyone_foster_or_can_help_with_kittens_in_brooklyn/",
    "scraped_at": "2025-12-04T02:57:32.187980"
  },
  {
    "post_id": "1ojfkhj",
    "subreddit": "Brooklyn",
    "title": "Any restaurants sell pastina? Looking for the cooked version not the dry pasta box",
    "author": "ButtholeCastles",
    "created_utc": "2025-10-29T16:25:00",
    "score": 6,
    "num_comments": 1,
    "text": "I know it's easy to make but my kitchen isn't unpacked yet and it's so cold and cloudy outside it's all I want and I can't find it on any menus ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ojfkhj/any_restaurants_sell_pastina_looking_for_the/",
    "scraped_at": "2025-12-04T02:57:32.389410"
  },
  {
    "post_id": "1ohtoxe",
    "subreddit": "Brooklyn",
    "title": "Avoid BK Hospital & Dr. Nadeem Chaudhry for hand/finger injuries!",
    "author": "Flashy_Analysis_5395",
    "created_utc": "2025-10-27T19:12:58",
    "score": 185,
    "num_comments": 24,
    "text": "Hey all,\n\nI just wanted to warn the community about Dr. Nadeem Chaudhry, the surgeon who works with Brooklyn Hospital for any major hand injuries. I broke my finger and had to see him as a result and he was awful. Kept discounting my pain (I'm a woman, he told me to \"man up\"), wrapped my hand so tightly/incorrectly I had to go back to the hospital, billed me for a surgery he had to do to fix HIS mistake, etc. All this to say - if you think you've broken your hand/finger - avoid Brooklyn Hospital at all costs!!",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ohtoxe/avoid_bk_hospital_dr_nadeem_chaudhry_for/",
    "scraped_at": "2025-12-04T02:57:32.500644"
  },
  {
    "post_id": "1oevivj",
    "subreddit": "Brooklyn",
    "title": "Homeless Issues",
    "author": "Lone-Swimmer-2218",
    "created_utc": "2025-10-24T07:46:06",
    "score": 0,
    "num_comments": 5,
    "text": "Seems like the Clinton/Washington station the C line is a new makeshift shelter.  Is there any help out there for them? This is an annual thing at numerous stations when it starts to get cold.",
    "url": "https://i.redd.it/l7pvzvy3s1xf1.jpeg",
    "scraped_at": "2025-12-04T02:57:34.202772"
  },
  {
    "post_id": "1oeec0q",
    "subreddit": "Brooklyn",
    "title": "Update: Storage Unit Help (Sold- we just want our personal belongings back the rest can go)",
    "author": "seensumstrangefish09",
    "created_utc": "2025-10-23T16:32:18",
    "score": 14,
    "num_comments": 4,
    "text": "EDIT: our unit was cleared out and sold today. The staff at our storage u it was kind enough to leave our number with the purchases to get in touch. We received some of our documents but we know a lot of our personal documents were not organized in the unit. As we said we are more than happy to part ways with electronics and valuable items. We are also willing to even pay to have the opportunity juat to retrieve some sentimental items and important documents lile social security cards and birth certificates that were mixed into our unit. Please if anyone purchased a storage unit in Brooklyn this morning please reach out. We are hoping for a Hail Mary. Times have been rough for us and wer are all just hanging in we’re hoping we can reach out to a fellow human being and help each other out. Thank you so much for reading. 💚🙏🏾\n\n\nEDIT: I am still learning how to update and edit the posts as to not to have to make a new one over and over. \n\nFirstly I want to say thank you truly for everyone who has been so kind to reach out and to provide any info and help on Reddit. As I said it’s been a rough year and I think this was a huge amount of grief surrounding losing all of our belongings. We got to go to the facility this morning. I am grateful we were able to have an in person conversation. I am aware there is only so much info they can give over the phone. They gave us an email to contact to see if we can reach out to the purchaser. As we said we are happy to see our items to go a good home or to any use. It was truly the sentimental items that was the breaking point and of course our documents. We hope we hear back by tomorrow, but honestly this was one of the greatest outcomes we could have had.\n\n\nThank you guys so much. I know if you seen my post my partner and I have been on a wild ride, but we truly made it this far with the kind people who have supported us along the way. I know atm we don’t have much but we have connection and love. I definitely want to make it clear if I’m ever able to help y’all in any capacity please feel free to reach out. Thank you guys truly 💚💚💚🙏🏾🙏🏾🙏🏾\n\n\n_________\n\nI am adding additional into to my post and copy and pasted the original post below. I was unable to update the original post. \n\nSadly the unit sold within the hour. My partner and I are more than happy to part with most of our unit if it means it goes to a good home and to someone who needs it. There were important documents of ours, a pair of winter boots for the upcoming season and sentimental items like photos and a signed book from a deceased loved one that we would only ask to be able to collect. We aren’t sure if this will work but I am putting this out there if anyone can connect with me if they recently purchased this unit.\n\nhttps://www.storagetreasures.com/auctions/ny/brooklyn/5587399\n\nIt has been a rough past year and we are doing our best to overcome despite the odds. I know it isn’t guaranteed but we are asking for just a bit of kindness. Thank you so much 🙏🏾\n\nHey guys I am making this post because I am in desperate need of help.  My storage unit is being auction off within an hour.\n\nMy partner and I were facing homeless during the time we had our unit. I fell ill and had a major surgery, lost my job, and was stroll trying to finish school. My partner  has been the one supporting us through this whole time.\n\nI am in a much better place physically now. I am healthy and able to move, and just graduated this month after being put on full time since my school knee of my situation and wanted me to have a better opportunity career wise this season. I do odd jobs here and there as well to help out at the moment.  We are also set to find a place to have stable living at the end of this month. \n\nWe are more than happy to give anything of value in our unit. We would rather it go to someone we can trust and to even have the opportunity to get sentimental items like childhood photos, documents, and small items passed down from childhood. We have sold many of our items in our storage unit just to get by  and are trying our best to even pay off what we fell behind on this month. \n\nIf anyone understands our predicament please reach out. Our unit is set to be auctioned within an hour so far the highest bid has been $10 so even an $11 bid helps. We would appreciate anything you can do to help. Thank you 🙏🏾",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oeec0q/update_storage_unit_help_sold_we_just_want_our/",
    "scraped_at": "2025-12-04T02:57:34.333409"
  },
  {
    "post_id": "1oe6xla",
    "subreddit": "Brooklyn",
    "title": "Storage Unit Help",
    "author": "seensumstrangefish09",
    "created_utc": "2025-10-23T11:51:31",
    "score": 2,
    "num_comments": 4,
    "text": "I hope this post is allowed here I would appreciate any help. Thank you in advanced 🙏🏾. \n\nHey guys I am making this post because I am in desperate need of help.  My storage unit is being auction off within an hour.\n\nMy partner and I were facing homeless during the time we had our unit. I fell ill and had a major surgery, lost my job, and was stroll trying to finish school. My partner  has been the one supporting us through this whole time.\n\nI am in a much better place physically now. I am healthy and able to move, and just graduated this month after being put on full time since my school knee of my situation and wanted me to have a better opportunity career wise this season. I do odd jobs here and there as well to help out at the moment. We are also set to find a place to have stable living at the end of this month. \n\nWe are more than happy to give anything of value in our unit. We would rather it go to someone we can trust and to even have the opportunity to get sentimental items like childhood photos, documents, and small items passed down from childhood. We have sold many of our items in our storage unit just to get by  and are trying our best to even pay off what we fell behind on this month. \n\nIf anyone understands our predicament please reach out. Our unit is set to be auctioned within an hour so far the highest bid has been $10 so even an $11 bid helps. We would appreciate anything you can do to help. Thank you 🙏🏾 \n\nEdit UPDATE: The bidder who won the auction has cleared out our unit today. While some documents were returned to us, we had other documents in the unit that werent organized. I am going for a Hail Mary if anyone who purchased our unit today could be in touch with us. The storage staff were kind and I beleive shared our number with the buyer but we are asking if you purchased a storage unit in Brooklyn today can you please contact me. My partner and I are also willing to even pay for the time\nJust to have access to some sentiment owl items and our personal documents as we said the rest such as video games etc can freely go. We are just hoping who ever purchased it is kind enough to reach out. Thank you. ❤️🙏🏾",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oe6xla/storage_unit_help/",
    "scraped_at": "2025-12-04T02:57:34.478353"
  },
  {
    "post_id": "1oe5qr8",
    "subreddit": "Brooklyn",
    "title": "Taco place in West Elm",
    "author": "morganzabeans20",
    "created_utc": "2025-10-23T11:06:02",
    "score": 5,
    "num_comments": 4,
    "text": "I'm desperately searching for this spot I used to go to  \n\n  \nI used to work in dumbo (pre-covid) and there was a taco place that did pop ups under the manhattan bridge AND in the west elm they were in the west elm most weekdays and then on Wednesdays they were under the bridge.  \n\nDoes anyone remember the name of that spot and if they ever got a permanent location? I've been randomly thinking about their carnitas tostada. ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1oe5qr8/taco_place_in_west_elm/",
    "scraped_at": "2025-12-04T02:57:34.650935"
  },
  {
    "post_id": "1ockqzx",
    "subreddit": "Brooklyn",
    "title": "Weird Illness - anyone else?",
    "author": "dreaming_wide_awake",
    "created_utc": "2025-10-21T14:25:13",
    "score": 111,
    "num_comments": 145,
    "text": "The past week or so I've come down with this weird sickness where I had a sore throat for 3/4 days, but it never turned into a full blown cold (not really that much of a runny nose). I tested for covid 5ish days after my first symptoms, but it came back negative (but who knows at this point ha).\n\nI still feel super fatigued, a tich achy, sore/sensitive eyes (?), slightly feverish - I've had pretty bad cases of the flu before, and this doesn't feel quite as bad as then. Maybe just a weird viral thing? Who knows! Was curious if anyone else was experiencing this and their timeline for recovery. I also got my flu and covid shot in September.\n\nEdit: I also have 0 appetite, and somewhat loss of taste and smell, which led me to assume covid. Either way, hunkering for the moment lol.",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ockqzx/weird_illness_anyone_else/",
    "scraped_at": "2025-12-04T02:57:34.778369"
  },
  {
    "post_id": "1ocdjrc",
    "subreddit": "Brooklyn",
    "title": "Looking for a quote on a sewer repair for a building I manage. Any recommendations for an experienced and affordable contractor?",
    "author": "ABCD170",
    "created_utc": "2025-10-21T09:51:58",
    "score": 4,
    "num_comments": 7,
    "text": "It’s been an ongoing problem, and I need to take care of it. Looking for a long term solution to a leaky pipe. It’s causing a stink, and some of the tenants are getting sick of it. So, I organized and clean work done. From someone who knows what they are doing.",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1ocdjrc/looking_for_a_quote_on_a_sewer_repair_for_a/",
    "scraped_at": "2025-12-04T02:57:35.409515"
  },
  {
    "post_id": "1o8ldwn",
    "subreddit": "Brooklyn",
    "title": "Looking for good sushi places for my upcoming birthday",
    "author": "ADepressedthr0waway",
    "created_utc": "2025-10-16T19:15:03",
    "score": 8,
    "num_comments": 25,
    "text": "my birthday is coming up soon   \n  \nLooking for a place that has good food and service in one of those all you can eat  sushi places. we usually go to a place in like SI but not looking to go that far.  the hour and a half drive kills me lol.\n\n tried a few here and was disappointed & don't wanna get sick so figured i'd ask",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1o8ldwn/looking_for_good_sushi_places_for_my_upcoming/",
    "scraped_at": "2025-12-04T02:57:36.656315"
  },
  {
    "post_id": "1o7fxsk",
    "subreddit": "Brooklyn",
    "title": "Local Nicola Tanzi, 64, Is Fatally Beaten in a Subway Station After Chance Encounter",
    "author": "DealerEquivalent3558",
    "created_utc": "2025-10-15T12:34:37",
    "score": 562,
    "num_comments": 179,
    "text": "Nick Tanzi was a fixture in Downtown Brooklyn & also our local business improvement district security officer.\n\nWe've known Nick Tanzi for over 10 years and we are still so sick that this horrible unnecessary murder happened right in our neighborhood. He was just about to retire as well.  We witnessed his service and humility in the neighborhood almost each and every day.\n\nPeople should be more outraged. He was just trying to help a person open the emergency subway gate at Willoughby & Lawrence St at 3 PM in the afternoon after his shift. Turned out it was for his murderer.\n\nNick was a warm, brave individual who provided much needed support to our community, which we know is non-existent from the NYPD in Downtown Brooklyn.\n\n[NYT Link](https://www.nytimes.com/2025/10/09/nyregion/brooklyn-nyc-subway-attack-beating.html?unlocked_article_code=1.tk8.lnq4.EJmj2yYwMTca&smid=url-share)\n\n[Obituary](https://www.torregrossafuneralhome.com/obituaries/obituary-listings?obId=45854255)",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1o7fxsk/local_nicola_tanzi_64_is_fatally_beaten_in_a/",
    "scraped_at": "2025-12-04T02:57:36.855605"
  },
  {
    "post_id": "1o5s03j",
    "subreddit": "Brooklyn",
    "title": "Where the heck do I buy a case of cold beer?",
    "author": "chickenDrunkenNoodle",
    "created_utc": "2025-10-13T14:31:37",
    "score": 31,
    "num_comments": 96,
    "text": "I'm feeling like a real bumpkin on this. ***Where does one go to buy a case of cold beer?*** What kind of store do I even look for??\n\nWhere I'm from, the only place you can buy beer is liquor stores. Some grocery stores have light beer (less than 3.5 percent abv) but if you're looking for wide selection of cold beer by the case, you go to a liquor store.\n\nEvery liquor store here seems to exclusively sell *liquor.* Bodegas/convenience stores sell by the can, so you're stuck paying like 3-6 bucks per can. Grocery stores seem to have beer but all the ones I've been to have it sitting out at room temperature.\n\n**I'm looking for cheap beers** (PBR, Yeungling, Genesee, etc), but any kind of beer by the case will do. Bonus points if you have a specific suggestion **near Morgan and Grand in East Williamsburg**. \n\nThanks for any insights.\n\n**Edit:** lots of great advice here, thanks to everyone who helped me out (and those who made me laugh)! I knew it was a dumb question, but as a foreigner who has only been here a few weeks, this has been super helpful!",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1o5s03j/where_the_heck_do_i_buy_a_case_of_cold_beer/",
    "scraped_at": "2025-12-04T02:57:39.192210"
  },
  {
    "post_id": "1o1sqyk",
    "subreddit": "Brooklyn",
    "title": "Should I get a second job, roommates, or go back to school?",
    "author": "No_Lingonberry_2401",
    "created_utc": "2025-10-08T21:04:38",
    "score": 0,
    "num_comments": 31,
    "text": "I’m 26 and live in Brooklyn in apartment with my grandpa/mom. My mom mentally ill paranoid and think her family is out to get her and even her 84 year old father is out to kill her. She doesn’t help him pay the rent or bills. \n\nI recently started working as a Teacher Assistant making 25/hour 8-3pm. \n\nThankfully I have my dad to help and support me in this.\n\nHe suggest I stay at the apartment as NYC is expensive everywhere else.the rent just 700/month. \n\nSo I’m going to help my grandpa pay down the rent . \n\nI just don’t know what to do …this whole situation is causing me anxiety and depression and I feel hopeless. \n\nI dint know if I should get a second job? Move out and get a roommate ? Or get a a job so that I can relocate and move. \n\nI really just want to get my masters in mental health counseling and to help getting better pay. \n\nBut I dint know if I can do that in my situation. Probably need to hole on from extra school….just get a second job to survive and move out or something.\n\nAny advice? ",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1o1sqyk/should_i_get_a_second_job_roommates_or_go_back_to/",
    "scraped_at": "2025-12-04T02:57:39.699541"
  },
  {
    "post_id": "1nw7ltk",
    "subreddit": "Brooklyn",
    "title": "LF recommendations for my solo weekend trip",
    "author": "Snoo_29332",
    "created_utc": "2025-10-02T11:53:40",
    "score": 4,
    "num_comments": 6,
    "text": "I'm flying in to NYC tomorrow night for a week long work trip, but Ill have Sat., Sun. and Mon. to do whatever I want. I used to live over there but its been a long time since I've been back. Looking for some cool stuff to get into.\n\n**Daytime,** I'm hoping to get into some more \"local\" events during the day - pop ups, markets, or one off events. Ill probably just wander around on foot, stop at some cafes, etc. I've already been to all the touristy spots in the past (museums, landmarks, etc.). I might swing by mood fabrics to get some materials for my wife.\n\n**Night time** is what I'm most excited about. I was hoping to find some good electronic/edm concert, a cool art show, or maybe a metal show at a crusty dive bar. I'm pretty open!\n\n**About me**: I'm 33/M. I was a goldsmith for 10 years but now I work in tech. I'm an artist, musician, craftsman, and extrovert. I love all kinds of music, but prefer smaller venues & house show vibes. Some of my favorite artists right now are Pinegrove, Fred Again, Max Cooper, Ty Segall, Amen Dunes, and generally anything mid-west emo/hardcore",
    "url": "https://www.reddit.com/r/Brooklyn/comments/1nw7ltk/lf_recommendations_for_my_solo_weekend_trip/",
    "scraped_at": "2025-12-04T02:57:40.871192"
  },
  {
    "post_id": "1mky9o5",
    "subreddit": "Queens",
    "title": "Filipino bakery pop-up in LIC // Sundays in August at Fifth Hammer Brewing",
    "author": "PandesalNYC",
    "created_utc": "2025-08-08T11:28:32",
    "score": 56,
    "num_comments": 0,
    "text": "**Kumusta, Astoria friends!**\n\nWe’re popping up every Sunday in August, right nearby in LIC at **Fifth Hammer Brewing**, from **12:30–3PM** 🍻🍞\n\nI’m Jen, and I run **Arellano Pandesal** with my husband — we’re a small-batch Filipino bakery based in Queens, focused on *pandesal*, *ensaymada*, and unique Fil-Am treats.\n\nEverything is made fresh just down the road at Tiny Drumsticks in Sunnyside. We use only premium and organic ingredients, a blend of four flours (including whole wheat), and no preservatives or anything artificial.\n\n🥯 *Classic pandesal rolls* — perfect toasted, or for DIY ice cream sandwiches\n\n👑 *Ensaymada* in multiple flavors — including our macapuno-cream-cheese favorite\n\n🌀 *Unswirly* pastries — like calamansi cinnamon roll or three-cheese\n\n✨ *Walk-up-only surprises* every week (before they’re available for pre-order)  \n  \nAnd everything pairs great with a cold pint from Fifth Hammer!\n\nCheck out the weekly menu at: [**PANDESAL.NYC**](http://pandesal.nyc) ",
    "url": "https://www.reddit.com/gallery/1mky9o5",
    "scraped_at": "2025-12-04T02:57:42.921041"
  },
  {
    "post_id": "1ltrqfd",
    "subreddit": "Queens",
    "title": "Queens has a cold brew problem…",
    "author": "Stube2000",
    "created_utc": "2025-07-07T07:29:22",
    "score": 0,
    "num_comments": 17,
    "text": "I Iove Queens.  I moved here from Brooklyn 6 years ago.  Every summer though I run into the same issue.   It is so hard to get a REAL Cold Brew coffee.  It’s either called Cold Brew, but it’s really iced coffee (brewed hot and put in the fridge) or coffee shops simply don’t know what it is or don’t carry it.  It’s so easy to make and tastes so much better than bitter iced coffee.  What gives Queens?!  Up your coffee game!",
    "url": "https://www.reddit.com/r/Queens/comments/1ltrqfd/queens_has_a_cold_brew_problem/",
    "scraped_at": "2025-12-04T02:57:44.688044"
  },
  {
    "post_id": "1lol15i",
    "subreddit": "Queens",
    "title": "Queens doctor pleads guilty to drugging and raping patients and aquaintances, filming assaults",
    "author": "MargszieBargszie",
    "created_utc": "2025-06-30T18:17:52",
    "score": 58,
    "num_comments": 14,
    "text": "",
    "url": "https://abc7ny.com/post/astoria-queens-doctor-rape-case-dr-zhi-alan-cheng-pleads-guilty-drugging-sexually-assaulting-patients/16892012/",
    "scraped_at": "2025-12-04T02:57:44.861145"
  },
  {
    "post_id": "1lh12de",
    "subreddit": "Queens",
    "title": "Rockaway Beach Water Temp. Too cold still?",
    "author": "BebophoneVirtuoso",
    "created_utc": "2025-06-21T12:50:47",
    "score": 15,
    "num_comments": 18,
    "text": "Normally I wait until July-September but with the temps spiking for a few days next week was considering spending a day at the beach. Anyone go swimming yet? Tolerable without a wetsuit? I see it's 65 right now and was considering taking a weekday and heading out on the ferry but don't want to go if I'm just baking on the beach for a few hours. ",
    "url": "https://www.reddit.com/r/Queens/comments/1lh12de/rockaway_beach_water_temp_too_cold_still/",
    "scraped_at": "2025-12-04T02:57:45.011464"
  },
  {
    "post_id": "1obsz7a",
    "subreddit": "bronx",
    "title": "Any good halal food spots?",
    "author": "Undead-VTX",
    "created_utc": "2025-10-20T16:34:44",
    "score": 17,
    "num_comments": 32,
    "text": "I used to go to this one halal truck on east tremont in throggs neck by a CVS run by a guy called Tamer, he isn’t there anymore but it was my favorite spot to get lamb over rice, for a couple years now its been gone and i have tried various spots like the truck at Parkchester and the one by Einstein hospital but tbh they don’t really taste good (i know my palate may be different from everybody else’s), also its been my experience that generally lamb over rice from deli’s pretty much never taste good and i’ve gone to like 20 different halal deli’s but the food just tastes the same, probably because they’re food is kept cold then reheated vs kept on a rack and roasted in a cart or truck. Any suggestions would be appreciated, i think Tamers halal truck was yemenese if it helps but im not 100% sure, im not very familiar with middle eastern food but i was always a fan of the lamb over rice from his spot ",
    "url": "https://www.reddit.com/r/bronx/comments/1obsz7a/any_good_halal_food_spots/",
    "scraped_at": "2025-12-04T02:58:00.894090"
  },
  {
    "post_id": "1obp5mm",
    "subreddit": "bronx",
    "title": "Beware of this man — he tortures and k!lls cats",
    "author": "seetherisneither",
    "created_utc": "2025-10-20T14:07:54",
    "score": 16,
    "num_comments": 3,
    "text": "Beware of this utterly depraved individual. He “sacrifices” cats to some entity and does so on YouTube and instagram live. It is horrifying and the images I came across made me sick to my stomach. Please watch out for him and be vigilant with your cats. ",
    "url": "https://www.reddit.com/gallery/1obp5mm",
    "scraped_at": "2025-12-04T02:58:01.102907"
  },
  {
    "post_id": "1oa9163",
    "subreddit": "bronx",
    "title": "How safe is Bronxcare area?",
    "author": "bethedragons",
    "created_utc": "2025-10-18T18:13:56",
    "score": 0,
    "num_comments": 10,
    "text": "Hi, I am applying to a residency at the Bronx care hospital and I wanted to get an idea of the safety in the area. Thank you ",
    "url": "https://www.reddit.com/r/bronx/comments/1oa9163/how_safe_is_bronxcare_area/",
    "scraped_at": "2025-12-04T02:58:01.237123"
  },
  {
    "post_id": "1o9riu8",
    "subreddit": "bronx",
    "title": "Please Help Save 3 Week Old Rescued Kitten!",
    "author": "Front_Grocery_6311",
    "created_utc": "2025-10-18T05:40:45",
    "score": 22,
    "num_comments": 21,
    "text": "Pleaseeeee Help Save 3 Week Old Rescued Kitten!\n\nI had found a tiny, abandoned kitten about 3 days old and I'm doing everything I can to care for him. But he urgently needs a vet visit and most likely medication because he's been having bad diarrhea, I really require help because I've been laid off and it's SO difficult, I haven't been getting unemployment either as that process has been affected :(\n\nIf you're able to help, PLEASEEEEEE donate via:\n\n1. Venmo: @pbnj27\n\n2. Zelle: 8135342628\n\nAnything helps, thank you so much for your support!!!!\n\nP.S: Shelters have refused, another org said he'd be euthanized given his age and symptom of diarrhea, ASPCA doesn't take anyone from my particular zip code, I did extensive research and it's so hard to find a vet who would help! Basically I have done a lot of research and I know in general how to take care of him, but diarrhea is out of my hands and he most definitely has an infection 😞 which I gotta get treated stat!",
    "url": "https://i.redd.it/9hhb9wx9cuvf1.jpeg",
    "scraped_at": "2025-12-04T02:58:01.377286"
  },
  {
    "post_id": "1o56wms",
    "subreddit": "bronx",
    "title": "Who remembers the McDonald’s inside Jacoby hospital?",
    "author": "Superlegend29",
    "created_utc": "2025-10-12T21:44:47",
    "score": 173,
    "num_comments": 30,
    "text": "This would be a highlight of the night after trip to the ER back in the day ",
    "url": "https://i.redd.it/604z93usasuf1.jpeg",
    "scraped_at": "2025-12-04T02:58:01.552536"
  },
  {
    "post_id": "1o4twuu",
    "subreddit": "bronx",
    "title": "City Island - Early Ruth Antiques",
    "author": "crashingjets",
    "created_utc": "2025-10-12T12:42:32",
    "score": 5,
    "num_comments": 6,
    "text": "Does anyone know if Early Ruth Antiques on City Island is open?  I last visited pre-COVID.  It has been listed as \"temporarily closed\" on Google since 2020 or so, but I wanted to see if any locals could provide up-to-date information.\n\nThanks either way!",
    "url": "https://www.reddit.com/r/bronx/comments/1o4twuu/city_island_early_ruth_antiques/",
    "scraped_at": "2025-12-04T02:58:01.743797"
  },
  {
    "post_id": "1nwbxha",
    "subreddit": "bronx",
    "title": "Any one ever file a complaint for Jacobi hospital? Any outcome ?",
    "author": "godsaveme2355",
    "created_utc": "2025-10-02T14:33:17",
    "score": 29,
    "num_comments": 20,
    "text": "Not to be a karen but went with my mom for the first time ever to an appointment and wow the way the front desk person tried to talk to her until I stepped in is wild . \n\nJust incredibly rude condescending and flat out disgusting . \n",
    "url": "https://www.reddit.com/r/bronx/comments/1nwbxha/any_one_ever_file_a_complaint_for_jacobi_hospital/",
    "scraped_at": "2025-12-04T02:58:01.880987"
  },
  {
    "post_id": "1myf1bp",
    "subreddit": "bronx",
    "title": "Grocery shopping?",
    "author": "Real-Internal-4445",
    "created_utc": "2025-08-23T18:29:16",
    "score": 8,
    "num_comments": 34,
    "text": "I'm moving here in the coming weeks and I need to map out the areas where I can buy groceries- coming from CA, I loved grocery outlet (close-out food retailer selling a wide variety of high quality items at a deep discount). But I dont see one in the Bronx. Ill be near Devoe Park.\n\nWhat are the best, most economical places to shop for food? I appreciate local stores but I know theyre on the higher end of prices... thanks in advance",
    "url": "https://www.reddit.com/r/bronx/comments/1myf1bp/grocery_shopping/",
    "scraped_at": "2025-12-04T02:58:04.965016"
  },
  {
    "post_id": "1mnht3k",
    "subreddit": "bronx",
    "title": "Paid Research Study at Mount Sinai Hospital in Harlem (Anybody From Ages 21-35)",
    "author": "clark_neuro_lab_nyc",
    "created_utc": "2025-08-11T12:32:22",
    "score": 10,
    "num_comments": 0,
    "text": "Researchers at Mount Sinai are seeking participants to be in a study examining health perceptions and behaviors in young adults who are between 21 and 35 years old. The study includes up to 3 in-person visits at our 96th St. East Harlem location. Participants will be compensated for their time, up to $330. For more information, call us at the Icahn School of Medicine at Mount Sinai at, 212- 241-6582 \\[or use the QR code attached to our flyer above to email a study team member for more information!\\]\n\nhttps://preview.redd.it/7n2snwmg3fif1.jpg?width=2400&format=pjpg&auto=webp&s=5b85c8ffe982a69e6c168338f52bfe31895fbd05\n\n",
    "url": "https://www.reddit.com/r/bronx/comments/1mnht3k/paid_research_study_at_mount_sinai_hospital_in/",
    "scraped_at": "2025-12-04T02:58:06.603939"
  },
  {
    "post_id": "1m6hg7q",
    "subreddit": "bronx",
    "title": "As of 9:26 am today Ice was spotted by Jacobi Medical Center Hospital in The Bronx. These Nazis have no shame. If you are or know anyone in the area or go to that hospital be on alert",
    "author": "SuperKE1125",
    "created_utc": "2025-07-22T11:40:03",
    "score": 220,
    "num_comments": 278,
    "text": "",
    "url": "https://www.reddit.com/gallery/1m6hfgj",
    "scraped_at": "2025-12-04T02:58:06.719775"
  },
  {
    "post_id": "1luly3n",
    "subreddit": "bronx",
    "title": "Shoutout to the 4 Train AC",
    "author": "benji997",
    "created_utc": "2025-07-08T07:19:04",
    "score": 79,
    "num_comments": 10,
    "text": "Never thought I’d make an appreciation post to the MTA but gotta give credit where credit is due, the 4 trains AC makes each car COLD in the summer which is so nice after getting on super hot and stuffy train platforms. Pretty sure the 5 is good on AC too, just a little thing I’m grateful of.",
    "url": "https://www.reddit.com/r/bronx/comments/1luly3n/shoutout_to_the_4_train_ac/",
    "scraped_at": "2025-12-04T02:58:09.338359"
  },
  {
    "post_id": "1lhrkaf",
    "subreddit": "bronx",
    "title": "Activities/socialization for seniors?",
    "author": "mineforever286",
    "created_utc": "2025-06-22T12:09:13",
    "score": 9,
    "num_comments": 16,
    "text": "I don't live in the Bronx, so I'm here looking for ideas/suggestions to give my 70 year old uncle for things to do in his free time. I pick him up/he comes to my place in Brooklyn for a weekend, every so often, but I can tell he gets lonely and a bit depressed at times. He lost his common law wife about 15 years ago after almost 30 years together, and since his step daughter moved out and started her own family a few years ago, he's alone a lot of the time. They're still in the Bronx, and they see each other frequently, but he needs more.\n\nAs most 70 year olds, he has some physical ailments and his share of doctors appointments and such, but he's still mobile and he has a car, but will take a bus or train for some things to avoid parking hassles. I've suggested he get out the house at least once a day and go to a park and go for a walk, and I'm thinking to get him a membership to the NYBG so he can go anytime he likes, but I think he needs more and he needs opportunities to hang with other peoole around his age, as unfortunately friends are dying off at this age. He's an OG, life-long, Boricua Bronx boy, he's into boxing (watching matches, not fighting. LOL), and carpentry (he made his living as a handy man, doing carpentry, plumbing and electrical work), so he's also into architecture and design - he LOVES my house because its from the 1800s and is always finding something to fidget with/fix when he comes over.\n\nI appreciate any direction/suggestions for stuff he can do/get into. He's generally between the Williams Bridge Metro North Station and Montefiore Hospital on East Gun Hill.",
    "url": "https://www.reddit.com/r/bronx/comments/1lhrkaf/activitiessocialization_for_seniors/",
    "scraped_at": "2025-12-04T02:58:10.987638"
  },
  {
    "post_id": "1lfozr1",
    "subreddit": "bronx",
    "title": "Just moved - vet recommendations in Riverdale?",
    "author": "Like-a-Boat",
    "created_utc": "2025-06-19T19:15:17",
    "score": 7,
    "num_comments": 15,
    "text": "Hi! I'm looking for reputable vets specifically in the Riverdale, as my cat isn't a huge fan of travel. \n\nThere are 3 near me: Riverdale Veterinary Group PC, Riverdale Animal Hospital, and Broadway Animal Hospital of Riverdale, but I'm not sure if they are reliable, and I'm not sure how to look into them without just asking here. \n\nThank you!",
    "url": "https://www.reddit.com/r/bronx/comments/1lfozr1/just_moved_vet_recommendations_in_riverdale/",
    "scraped_at": "2025-12-04T02:58:11.137624"
  },
  {
    "post_id": "1lafaf9",
    "subreddit": "bronx",
    "title": "New FDNY transport policy",
    "author": "Automatic_Motor918",
    "created_utc": "2025-06-13T08:59:06",
    "score": 11,
    "num_comments": 7,
    "text": "https://www.fox5ny.com/news/fdny-nyc-ambulances-closest-hospital",
    "url": "https://www.reddit.com/r/bronx/comments/1lafaf9/new_fdny_transport_policy/",
    "scraped_at": "2025-12-04T02:58:11.302680"
  },
  {
    "post_id": "1kyvctr",
    "subreddit": "bronx",
    "title": "Nice restaurant and fun neighborhood?",
    "author": "Happinessandharmony",
    "created_utc": "2025-05-30T00:27:42",
    "score": 8,
    "num_comments": 18,
    "text": "Hi! I’m bringing my niece this weekend to move into an apartment in the Bronx. Our hotel the first night is closer to Calvery Hospital on the east side. I don’t have a ton of free time with her, but I want to show her some fun and safe places near where she will be living. We will get there around 6pm, any ideas of fun places to eat and play near that area?",
    "url": "https://www.reddit.com/r/bronx/comments/1kyvctr/nice_restaurant_and_fun_neighborhood/",
    "scraped_at": "2025-12-04T02:58:12.921419"
  },
  {
    "post_id": "1kwjsj8",
    "subreddit": "bronx",
    "title": "Spare bedroom for physician",
    "author": "AffectionateTill9761",
    "created_utc": "2025-05-27T06:24:17",
    "score": 10,
    "num_comments": 0,
    "text": "Hi! I will be joining montefiore medical center as a new resident physician on july 1st and my hospital housing will be ready on July 1st aswell. My husband and I need a place to stay in the surrounding area for the last two weeks of June. We arrive on June 15th. \nI would really appreciate any guidance \n\nExcited to join the beautiful community of the Bronx! \n\nThanks ",
    "url": "https://www.reddit.com/r/bronx/comments/1kwjsj8/spare_bedroom_for_physician/",
    "scraped_at": "2025-12-04T02:58:13.083215"
  },
  {
    "post_id": "1kln36i",
    "subreddit": "bronx",
    "title": "🌐 Free WiFi for Hunts Point!",
    "author": "LeoThePointHunter",
    "created_utc": "2025-05-13T10:17:44",
    "score": 7,
    "num_comments": 2,
    "text": "Since 2017, the **Hunts Point Community Network (HPCN)** has been delivering **free, reliable internet** to homes and businesses through a **community-owned wireless mesh network**—built and maintained by local residents and businesses in Hunts Point.\n\n🏠 **Need WiFi at Home or Your Business?**  \nWe provide **free internet access in Hunts Point**. Roof access is usually needed to install equipment, though we make exceptions when possible. In some areas, we even offer **solar-powered setups** to ensure reliable service—especially during emergencies.\n\n💡 **Why HPCN Matters:**\n\n* Over **2,000 monthly users**\n* **12 local businesses** supported after Hurricane Sandy\n* **5 local jobs created**\n* **600+ Bronx residents trained** through our paid Digital Stewardship Training Academy (DSTA)\n* **Network usage has doubled** since COVID-19\n* A **replicable model** for community-owned infrastructure\n\n📶 Our mission is to **expand internet access in underserved communities** while **empowering residents** through hands-on education about how the internet works.\n\n🔗 **Sign up or learn more:** [https://www.thepoint.org/hpcn](https://www.thepoint.org/hpcn)",
    "url": "https://www.reddit.com/r/bronx/comments/1kln36i/free_wifi_for_hunts_point/",
    "scraped_at": "2025-12-04T02:58:13.177035"
  },
  {
    "post_id": "1kln1po",
    "subreddit": "bronx",
    "title": "Here Is Everything That Has Changed Since Congestion Pricing Started in New York",
    "author": "RecycleReMuse",
    "created_utc": "2025-05-13T10:16:02",
    "score": 48,
    "num_comments": 73,
    "text": "“Traffic has not surged in the South Bronx, as some predicted.”",
    "url": "https://www.nytimes.com/interactive/2025/05/11/upshot/congestion-pricing.html",
    "scraped_at": "2025-12-04T02:58:13.297792"
  },
  {
    "post_id": "1kfws54",
    "subreddit": "bronx",
    "title": "Where to live in Mott haven",
    "author": "Specialist_Fan9999",
    "created_utc": "2025-05-06T01:19:02",
    "score": 15,
    "num_comments": 79,
    "text": "Hi everyone, I'm a foreign medical graduate who will soon be starting my residency as a doctor in the Bronx, and I’m really excited to begin this new adventure!\n\nI'm looking for recommendations on where to live in Mott Haven. I want an immersive, first-hand experience to better understand the health-related challenges faced by the Mott Haven community and the surrounding neighborhoods.\n\nI’m married, so safety is a top priority. I’ve read that while the area has been improving and generally feels safer, there are still isolated incidents involving shootings, assaults, and drug activity. I'm personally okay with the urban environment and community vibe, but I want to make sure my wife feels safe and secure, especially when I’m working long hours.\n\nI’d love to hear from people with real experience in the area—what parts of Mott Haven would you recommend for someone in my situation?",
    "url": "https://www.reddit.com/r/bronx/comments/1kfws54/where_to_live_in_mott_haven/",
    "scraped_at": "2025-12-04T02:58:14.640749"
  },
  {
    "post_id": "1kb74pb",
    "subreddit": "bronx",
    "title": "Any great maternity wards in Bronx?",
    "author": "3portie",
    "created_utc": "2025-04-29T23:38:53",
    "score": 6,
    "num_comments": 12,
    "text": "My friend is moving to Bronx from out of town and should deliver her baby there. Any good hospital systems to recommend? Thanks!",
    "url": "https://www.reddit.com/r/bronx/comments/1kb74pb/any_great_maternity_wards_in_bronx/",
    "scraped_at": "2025-12-04T02:58:15.049888"
  },
  {
    "post_id": "1k3bq5h",
    "subreddit": "bronx",
    "title": "Punk Bars",
    "author": "Rough-Story6858",
    "created_utc": "2025-04-19T21:41:34",
    "score": 27,
    "num_comments": 45,
    "text": "Anyone know of any punk/anti fascist bars in the Bronx? Sick of going into\nManhattan to find them. ",
    "url": "https://www.reddit.com/r/bronx/comments/1k3bq5h/punk_bars/",
    "scraped_at": "2025-12-04T02:58:15.182467"
  },
  {
    "post_id": "1k1ie6c",
    "subreddit": "bronx",
    "title": "The Painted Hydrant That Says the Quiet Part Out Loud",
    "author": "Classic-Ask8135",
    "created_utc": "2025-04-17T13:22:53",
    "score": 0,
    "num_comments": 53,
    "text": "Sitting there right on a public street in the Bronx is a hydrant illegally painted in the colors of the a flag: green, white, and red. Not tucked away. Not hidden. Right there in the open, proudly. And not a single ticket. Not a single visit from the Department of Sanitation. Not a peep from the DOB. Meanwhile, immigrant business owners across the neighborhood get hit with fines for putting a sign an inch too wide, for leaving a fruit crate out front for 15 minutes too long, for painting a mural in a language not written in cursive.\n\nPainting a fire hydrant is not only illegal it’s dangerous. Hydrants are color-coded to inform firefighters of pressure levels and water sources. \n\nNow imagine if a Bangladeshi homeowner did the same thing. Painted it red and green for the flag. Or if a Yemeni deli owner tried blue, red, and black to represent his country. Can you picture the Facebook threads? The Nextdoor rants? The “concerned” 311 calls?\n\nThis hydrant isn’t just painted—it’s loud. Loud in its message. Loud in its permission. Loud in what it says about who gets to break rules and who gets policed for simply existing. \n\nQue in the Defensiveness, denial, deflection classic symptoms of a community more concerned with maintaining control than ensuring fairness. Is it harmless patriotism?Looks like code enforcement isn’t neutral, it’s cultural.\n\nThe perfect metaphor. A literal symbol of public safety co-opted for private pride. Painted illegally. Left untouched. Celebrated.\n\nThis is why the Morris Park series exists. Because every time someone says “you’re reading too much into it,” the neighborhood paints a hydrant and proves the entire point. They do it loudly, proudly, and then ask why people feel excluded. And just like that, the silent parts are shouted from the sidewalk.\n\nDefend the hydrant in the comments. Say it’s no big deal. That it’s been that way for years. That it’s a tradition. That it’s not hurting anyone.",
    "url": "https://i.redd.it/t6u7iytjhfve1.jpeg",
    "scraped_at": "2025-12-04T02:58:15.487899"
  },
  {
    "post_id": "1k04uib",
    "subreddit": "bronx",
    "title": "Morris Park: Selective Memory Is Not Community Pride",
    "author": "Classic-Ask8135",
    "created_utc": "2025-04-15T18:22:42",
    "score": 39,
    "num_comments": 104,
    "text": "You’ll hear it all the time walking through Morris Park. It might be at the corner deli, right after someone finishes complaining about traffic. It might come up at a community board meeting, right before the conversation turns into a monologue. Or maybe it’s just in passing, shared over a fence, muttered while someone drags their garbage can to the curb.\n\n*“We didn’t have these problems back in the day.”*  \n*“This neighborhood used to be clean. Quiet. Different.”*\n\nThey say it like it’s scripture. Like it’s a truth etched into concrete. Like anyone who’s lived here less than 20 years couldn’t possibly understand what was lost.\n\nIt usually comes from someone who’s been here a while, someone whose memories are soaked in the scent of fresh cannoli and the sound of a Saturday morning sweeping the sidewalk. They remember when the bakery on the corner was Italian-owned and knew your name. When block parties stretched down entire streets, and everyone brought a dish. When nobody locked their doors, not because crime didn’t exist, but because everyone knew everyone, and that was good enough.\n\nAnd maybe, to them, that world *did* feel safer. More familiar. More theirs. Maybe the ice cream truck played a little louder. Maybe kids played in the street without parents hovering from porches. Maybe you could leave your keys in the ignition and still come back to a car.\n\nIt sounds beautiful. It sounds like community. It sounds like something worth preserving. But nostalgia has a way of sanding down the edges. It blurs the inconvenient details, polishes the past, and presents it like a gift, one that’s only ever held by the people telling the story. And that’s the thing. It’s only part of the story. And the part it leaves out? That’s everything. Because when you really start looking, the cracks in the memory are just as real as the ones in the sidewalk. They just got painted over.\n\nLet’s rewind the tape. We’re not talking ancient history here, we’re talking 1990. Just over thirty years ago, right here in the 49th Precinct, which includes Morris Park, these were the real numbers:\n\n* 16 murders\n* 766 robberies\n* 1,439 burglaries\n* 2,991 grand larcenies auto\n\nThat’s not a neighborhood going through a rough patch. That’s a neighborhood hemorrhaging. That’s people waking up in the middle of the night to the sound of glass shattering or car alarms howling down the block. That’s chaining your steering wheel, buying The Club at the hardware store, and still coming out in the morning to find your car gone. That’s front doors fortified with two deadbolts and a metal gate. That’s parents walking their kids to school, not out of love, but out of fear. And yes, people walked with their keys wedged between their knuckles, just in case.\n\nThis wasn’t the Morris Park you hear about on the Facebook pages. Not the one wrapped in gingham tablecloth memories. Not the version where every neighbor waved, every child was safe, and every storefront was run by “people who knew your family.” No. This was a neighborhood in survival mode.\n\nLike much of the Bronx, Morris Park in the ‘80s and ‘90s was bruised by economic decline, white flight, arson-for-profit landlords, and underfunded city services. Public trust was eroding. The tax base was shrinking. Garbage pickup didn’t always come on time. Graffiti wasn’t a mural, it was a warning. Buildings sagged. Sidewalks cracked. The windows on the bus weren’t always intact. The crime wasn’t subtle. It was raging. And yet, when people reflect? What they remember is the deli. What they remember is “how clean the block was.” “How everyone knew each other.” “How you didn’t need a lock on your door.”\n\nBut that’s not memory, that’s mythology. It’s what happens when you choose to remember *comfort* over *context*. Because the truth is, for all the talk about how \"respectable\" the block used to be, the streets told a different story. A story with police tape. With squad cars. With sirens that became background noise. And through all of that, what people really long for isn’t just the past. It’s the feeling of being in control of it.\n\nBut now? Now a Yemeni kid opens a hookah lounge, not in secret, not in some shady backroom, but with permits, receipts, and late-night coffee on the menu, and suddenly, he’s the reason the neighborhood’s “going downhill.”\n\nNow a Bangladeshi family saves up, buys a home, and moves into a block where half the houses still have original aluminum siding, and somehow, *they’re* the problem. Their presence doesn’t signal hard work or pride, it’s seen as an invasion.\n\nNow a kid bumps music in Bengali, Arabic, Spanish, and that’s enough to spark angry Facebook threads about “what happened to our culture?”\n\nFunny how that works, isn’t it?\n\nA literal mafia boss could run murder contracts behind a salon chair and still be waved at with respect. But a Dominican mom opens a daycare, or a West African family starts a catering business out of their two-family, and suddenly folks are clutching pearls over “community standards.”\n\nYou’ve got people panicking over halal markets. Over African braid salons. Over Bangladeshi cab depots and Yemeni corner stores. Over names they don’t know how to pronounce and dishes they’ve never tasted. And let’s be honest, it’s not the crime that bothers them. It’s the change. Because deep down, this was never really about keeping the neighborhood safe. It was about keeping the neighborhood familiar. Familiar faces. Familiar languages. Familiar last names.\n\n**But here’s the uncomfortable truth:**\n\nControl used to come easy when everyone looked the same, worshipped the same, voted the same. Now it’s harder. Now the corner isn’t yours just because you say it is. Now you have to share. And for some, that’s the real threat. So instead of calling it what it is, a fear of losing power, they call it a crime wave. They call it a quality-of-life crisis. They call it everything but what it is: discomfort with a future that doesn’t center them.\n\nIf you only listened to the way some folks talk, you’d think Morris Park is on life support. You’d think crime is at an all-time high, that the streets are unsafe, that the community is being overrun. But the data? The data tells a very different story.\n\nIn 2022, the 49th Precinct, which covers Morris Park and surrounding areas, recorded:\n\n* 7 murders\n* 17 rapes\n* 273 robberies\n* 367 felony assaults\n* 133 burglaries\n* 611 grand larcenies\n* 371 grand larcenies auto\n\nThat’s still more crime than anyone wants, sure. But put it into perspective.  But that’s a 71.7% drop in crime across all major categories since the 90s. (Source: NYPD CompStat, [NYC.gov](https://www.nyc.gov)). And according to CrimeGrade.org, Morris Park now ranks in the 64th percentile for safety in the United States. That means it’s statistically safer than nearly two-thirds of neighborhoods in the entire country. (Source: CrimeGrade.org – Bronx/Morris Park neighborhood data)\n\nSo why the hysteria? Why the sudden panic over “what’s happening to the neighborhood?” It’s not the crime. It’s not the numbers. It’s not the facts. It’s because the deli changed hands. Because \"Tony’s Pizza\" is now \"Halal Bros.\" Because the signs on Morris Park Ave are written in Arabic, Bengali, Urdu, or Spanish, not cursive Italian script. Because a Dominican family moved in next door and turned the backyard into a weekend BBQ zone. Because the people walking home from the train at 6:00 p.m. don’t “look like they used to.” Let’s talk about who those people actually are.\n\nBetween 2000 and 2020, Morris Park saw a steady demographic shift:\n\n* The Italian-American population decreased as older generations aged out or moved to Westchester and Long Island.\n* Meanwhile, South Asian, Arab, African, and Latino families moved in, drawn by relatively affordable housing, access to transit, and proximity to major Bronx hospitals and schools. (Source: U.S. Census Bureau, American Community Survey)\n\nToday, Morris Park is home to a rich mix of cultures:\n\n* 19% Hispanic/Latino\n* 26% Black or African American\n* 18% Asian (including Bangladeshi, Pakistani, and Yemeni communities)\n* 33% White (majority Italian and Albanian descent) (Source: NYC Planning Demographic Profiles, Bronx CD11)\n\nWhile the faces on the block have changed, the value of the block has gone up. The schools are more diverse. The restaurants are buzzing. The homes are being cared for by people who bought in, not just moved in. And still, some folks act like we’re living in Gotham City. Why? Because deep down, they weren’t protecting the neighborhood from crime. They were protecting it from change.\n\nSelective memory isn’t just nostalgic. It’s dangerous. It might feel harmless, like an old photo album pulled off a dusty shelf, cracked edges, sepia tones, faded block parties, and neighbors who looked like family. But when selective memory becomes the foundation for present-day judgment, it doesn’t just distort the truth, it weaponizes it.\n\nIt takes a neighborhood that was struggling, with murders, robberies, crumbling infrastructure, disinvestment, and wraps it in this cozy myth of “better days.” It swaps out the facts for folklore. It turns crime scenes into charming anecdotes, and mob activity into neighborhood pride. It ignores the blood. Ignores the boarded-up windows. Ignores the sirens that screamed through the night. And in their place, it plants the phrase:\n\n*“We didn’t have these problems back then.”* That line doesn’t just erase history. It rewrites it. And what does this selective memory do next? It offers grace to mobsters, men who ran rackets, threatened families, and left bodies in their wake, and calls them *“gentlemen of the neighborhood.”*\n\nIt nods quietly at loan sharks, bookies, and enforcers, but draws the line at immigrant business owners who dare to repaint the awning on a storefront or put a sign in another language. It lets the guy who wore gold chains and ordered hits from a back room get a pass because *“he only hurt other bad guys,”* but turns around and labels a Bangladeshi family a threat because their kids play cricket in the street.\n\nIt doesn't hate crime. It hates outsiders. Because when crime came from someone who looked familiar, someone who showed up at church, someone who smiled at the meat market, it didn’t feel like a threat. It felt like tradition. But when the face changed, when the accent changed, when the last name stopped ending in a vowel, that’s when it became \"a problem.\"\n\nSelective memory says the neighborhood was only good when it was exclusive. When it was homogenous. When it was curated to fit one narrow idea of what it means to be “a good neighbor.” It wants to pretend that safety existed simply because everyone looked the same. It forgets that real safety never existed at all, just the illusion of it, protected by silence, pride, and denial. And now, when the neighborhood is statistically safer, more economically stable, and filled with families working just as hard, if not harder, to build a life here? That same memory gets used as a gatekeeping tool. To shame the new. To exile the unfamiliar. To push out those who came here with hope, not history.\n\nNostalgia is fine when it stays in the photo album. But when it starts writing policy, shaping opinion, or deciding who belongs? It becomes dangerous. It becomes discriminatory. It becomes a lie we use to protect our comfort instead of confronting our past. And in a neighborhood like Morris Park, where the truth has always lived just beneath the surface, selective memory isn’t just inaccurate. It’s complicit.\n\nLet’s be honest. The new families didn’t bring problems. They brought solutions, and receipts. They brought halal meat shops, daycares, cell phone stores, bakeries, pharmacies, tax prep offices, bodegas, afterschool programs, and some of the best damn empanadas and shawarma this neighborhood has ever seen.\n\nThey didn’t just move in, they invested. While others were busy complaining about what was changing, these families were fixing what had already fallen apart. They stabilized the housing market. When longtime landlords were selling off crumbling homes or illegally chopping up basements, it was immigrant families who bought in full. Who poured concrete, replaced plumbing, added vinyl siding, and swept the stoops clean. They didn’t just rent, they rooted themselves here.\n\nThey brought foot traffic, which any NYPD officer or small business owner will tell you is one of the biggest deterrents to street crime. They brought family events, Eid festivals, Dominican parades, Bengali Independence Day cookouts in the park. Not just gatherings for themselves, but celebrations that bring people together whether they speak English, Spanish, or Arabic. They brought diversity. Not as a buzzword. Not as a trend. But as a lived reality, the kind that makes a city like New York thrive.\n\nLook, Morris Park didn’t get better in spite of change. It got better because of it. The drop in crime didn’t just happen because someone put more cops on patrol. It happened because there were more eyes on the street, more stable households, more legitimate businesses, and more economic activity. More people who gave a damn about where they lived. The block that used to have stolen Hondas stripped for parts in the alley now has a halal food truck serving students and hospital workers. The storefront that sat empty for five years is now a pharmacy owned by a Bangladeshi couple working 7 days a week.\n\nSo when you say “the neighborhood is changing” like it’s a curse, let’s be clear about what’s really bothering you. Because if your biggest concern in 2025 is that a hookah lounge might attract *too many young people*… Or that a taco stand on Bronxdale might be *too successful*… Or that the sign on the pizza shop now includes Arabic… While the Morris Park of the 1990s had a grand larceny every hour and a mob boss on speed dial.\n\nThen let’s call this what it is. You’re not upset about safety. You’re upset about losing cultural control. You’re not mourning crime. You’re mourning dominance. The quiet, unspoken privilege of walking into any room, any store, any civic space and feeling like it’s built around *you*. And now, as the tables get longer, the menus get broader, the languages get louder, you feel outnumbered, not unsafe.\n\nThat’s not a safety issue. That’s insecurity disguised as nostalgia. And frankly? It’s getting old. You can love this neighborhood and still tell the truth about it. You can walk down Morris Park Avenue and feel a pang of nostalgia for the old pork store, the shoemaker’s shop, or the church bazaars, and still recognize that what’s happening here now is progress, not erasure. You can honor the old while making room for the new. But what you can’t do anymore, what you won’t get away with, is rewriting history to fit your bias.\n\nYou don’t get to ignore the decades of crime, corruption, and decline, then turn around and vilify the people cleaning it up, just because they don’t look like your grandfather. You don’t get to romanticize a version of the neighborhood where a mafia boss was “just part of the culture,” and then act like a Yemeni teenager running a juice bar is a threat to everything good. That double standard is dead weight. And it’s dragging your credibility down with it.\n\n**Let’s talk about what’s really happening:**\n\nMorris Park is safer. Morris Park is more vibrant. Morris Park is more alive today than it’s been in decades. The numbers prove it. The food proves it. The real estate market proves it. Let’s say that again, the real estate market proves it. Between 2013 and 2023, property values in Morris Park rose by over 40%.  \n(Source: Zillow Neighborhood Data; NYC Dept. of Finance) As more families move in, renovate homes, and open businesses, the value of staying here, literally and emotionally, is going up. And here’s the punchline:\n\nThe very people complaining today are sitting on what will soon be million-dollar homes.\n\nThat three-bedroom house that was “worth $150K back in the day” will sell for over $900,000 tomorrow, because the same immigrant families you’re grumbling about are the ones putting down roots, paying property taxes, and creating demand. And when that check hits? When the buyers show up from Manhattan, Westchester, and Queens because they want a neighborhood with culture, character, and good food, you won’t be talking about “what the neighborhood used to be.” You’ll be talking about how much you sold for.\n\nAnd here’s the irony: the newcomers you spent years resisting? They made that number possible. Because progress doesn’t just clean up the block. It builds equity. You don’t have to love every change. You don’t have to give up your identity. But you do have to get honest. Because this isn’t just about protecting a neighborhood. This is about choosing whether you want to be part of its future or cling to a version of the past that only ever worked for a few. And no matter how loud the nostalgia gets, facts don’t flinch.\n\nThere’s a new Economic Engine Morris Park. The neighborhood's resurgence is largely driven by the entrepreneurial spirit and purchasing power of its newer residents.​\n\n**Yemeni-American Entrepreneurs:**\n\nYemeni-American business owners have become integral to Morris Park's commercial landscape. Their investments range from corner delis to full-service restaurants, contributing to job creation and local economic growth. The Yemeni American Chamber of Commerce (YACC) actively promotes economic development and advocates for the interests of Yemeni-American businesses .​\n\n**Bangladeshi-American Contributions:**\n\nBangladeshi immigrants have established a variety of enterprises, including grocery stores, clothing boutiques, and technology services. Their entrepreneurial activities not only provide essential services but also stimulate economic activity and community engagement.​\n\n**Dominican-American Economic Impact:**\n\nThe Dominican-American community has significantly influenced the local economy through both entrepreneurship and consumer spending. Nationally, Hispanic buying power was estimated at $1.9 trillion in 2020, accounting for 11.1% of the total U.S. buying power . This economic influence is mirrored in Morris Park, where Dominican-owned businesses and consumers play a vital role in the neighborhood's vitality.​\n\n**Albanian-American Investments:**\n\nAlbanian-Americans have also contributed to Morris Park's economic development, with investments in real estate and small businesses. Their commitment to the neighborhood is evident in the maintenance and improvement of properties, enhancing the area's appeal and property values.​\n\nThese communities are not merely participants in Morris Park's economy, they are its driving force. Their collective efforts have led to increased property values, reduced crime rates, and a more dynamic local economy. Embracing this diversity isn't just a cultural imperative; it's an economic one.​\n\nLet’s talk about the Morris Park of today. It’s safer than it’s been in over 30 years. It’s more economically stable, thanks to the families investing in homes and businesses. It’s more vibrant, culturally, commercially, socially. It’s alive with languages, flavors, and entrepreneurship that’s turning this community into a model of what New York City was always meant to be. A place where people come to build, not just to belong.  This isn’t about erasing history, it’s about finally telling all of it. The truth about the past. The truth about the present. And the truth about who’s helping shape the future?\n\nIt’s not about going back. It’s about moving forward, together.\n\n  \nNext Up: [You’ll Hear a Lot About Values in Morris Park — But Look Closer](https://www.reddit.com/r/bronx/comments/1k0tfj5/youll_hear_a_lot_about_values_in_morris_park_but/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
    "url": "https://www.reddit.com/r/bronx/comments/1k04uib/morris_park_selective_memory_is_not_community/",
    "scraped_at": "2025-12-04T02:58:15.765683"
  },
  {
    "post_id": "1okgm44",
    "subreddit": "Manhattan",
    "title": "Subway WTC cortlandt",
    "author": "UnhappyCelery8215",
    "created_utc": "2025-10-30T20:35:13",
    "score": 0,
    "num_comments": 3,
    "text": "Hello! I have to go to the hospital for special surgery tomorrow and I’m wondering if someone can help me get from the Workd trade center Cortlandt station to East 72nd st and then I figured I’ll just walk from there to east 70th street any information is helpful thanks!",
    "url": "https://www.reddit.com/r/manhattan/comments/1okgm44/subway_wtc_cortlandt/",
    "scraped_at": "2025-12-04T02:58:19.062094"
  },
  {
    "post_id": "1ogjxwv",
    "subreddit": "Manhattan",
    "title": "Things to do in Chelsea",
    "author": "Impossible_Iron_3897",
    "created_utc": "2025-10-26T08:56:36",
    "score": 2,
    "num_comments": 9,
    "text": "Hey! I’m going to be staying at the Moxy in Chelsea nyc this end of November. I love to shop, eat, and try new fun activities. Any recs on your favorite places and or things to do in the cold?!",
    "url": "https://www.reddit.com/r/manhattan/comments/1ogjxwv/things_to_do_in_chelsea/",
    "scraped_at": "2025-12-04T02:58:19.179069"
  },
  {
    "post_id": "1ocvyjy",
    "subreddit": "Manhattan",
    "title": "Buildings open 24/7 near Mt Sinai West",
    "author": "Dead_deaf_roommate",
    "created_utc": "2025-10-21T22:07:31",
    "score": 3,
    "num_comments": 5,
    "text": "Long story but I’m in the city from upstate, came here for some testing and appointments at Mt Sinai. I’m supposed to leave town tomorrow with my friend who drove us. Unfortunately now they need me to stay til Thursday and do more imaging in the morning. \n\nI don’t have money to spare for another hotel night. I’m wondering if anyone knows of somewhere that’s open 24/7 where I could sit out the night until my appointment? \n\nI am working with the hospital/they’re trying to find me a place too, but.",
    "url": "https://www.reddit.com/r/manhattan/comments/1ocvyjy/buildings_open_247_near_mt_sinai_west/",
    "scraped_at": "2025-12-04T02:58:19.338735"
  },
  {
    "post_id": "1o7p8hb",
    "subreddit": "Manhattan",
    "title": "Doctor Accused of Using a Gun to Force a Woman Into Sex",
    "author": "rezwenn",
    "created_utc": "2025-10-15T18:27:54",
    "score": 6,
    "num_comments": 0,
    "text": "",
    "url": "https://www.nytimes.com/2025/10/14/nyregion/doctor-ny-nj-rape-charges.html?unlocked_article_code=1.tk8.xRY2.2G-FdThfK2PR",
    "scraped_at": "2025-12-04T02:58:21.038800"
  },
  {
    "post_id": "1o7ont3",
    "subreddit": "Manhattan",
    "title": "Salary and cost of living for Manhattan?",
    "author": "Equal-Bite-1631",
    "created_utc": "2025-10-15T18:03:20",
    "score": 2,
    "num_comments": 52,
    "text": "Hello community,\n\nI have been offered a relocation from London to NYC. I (US) would be moving with my wife (TH) and we are expecting a baby. We want to understand how much should be a good compensation package accounting for living in an upscale safe area of Manhattan (5-6k rent?) and having an all-inclusive healthcare. My wife will be unable to work there and the baby won't either in the near future. We should be able to save up a modest amount every month to account for frequent hospital checks and future school and housing expenses.\n\nI can imagine offers between 150k and 250k, but some family/friends living in DC said 300k would be the minimum, although other Reddit posts say otherwise. I have never lived there before and would appreciate a lot any help budgeting this. I have some leverage during negotiations so I should not be restricted by this salary band, but want to come with a good value proposition to make the relocation happen.\n\nMany thanks",
    "url": "https://www.reddit.com/r/manhattan/comments/1o7ont3/salary_and_cost_of_living_for_manhattan/",
    "scraped_at": "2025-12-04T02:58:21.152184"
  },
  {
    "post_id": "1o32998",
    "subreddit": "Manhattan",
    "title": "Indoor Beach Volleyball Rec Leagues Starting This Month",
    "author": "Worth_Tie_8642",
    "created_utc": "2025-10-10T10:21:16",
    "score": 2,
    "num_comments": 0,
    "text": "Sign up at [qbksports.com/leagues](http://qbksports.com/leagues)\n\nWhen it gets cold outside, beach volleyball moves indoors. \n\nLate Fall League = Epic 8 Week Season\n\nSign up as a team or free agent. \n\n🏐 Monday - 4x4 Int. Coed - starts 10/27\n\n🏐 Tuesday - 6x6 All Abilities Rec Coed - starts 10/21\n\n🏐 Thursday - 4x4 Int. Coed - starts 10/23\n\n🏐Thursday - 6x6 All Abilities Rec Coed - starts 10/23",
    "url": "http://qbksports.com/leagues",
    "scraped_at": "2025-12-04T02:58:21.444350"
  },
  {
    "post_id": "1o203wu",
    "subreddit": "Manhattan",
    "title": "Former JCPenney at Manhattan Mall in Manhattan, NYC Pictures & Videos",
    "author": "CroninChris",
    "created_utc": "2025-10-09T04:01:22",
    "score": 1,
    "num_comments": 0,
    "text": "Happen to be here for an event yesterday and saw lots of reminisce of JCPenney. This store opened in 2009 and closed in May 2020 due to COVID and never reopened \n\nLinks to store escalators & elevators are here: \n\nElevator: [https://www.youtube.com/watch?v=a48wEm68zWU](https://www.youtube.com/watch?v=a48wEm68zWU)\n\nEscalators: [https://www.youtube.com/watch?v=-UbE3QeVvfE](https://www.youtube.com/watch?v=-UbE3QeVvfE)",
    "url": "https://www.reddit.com/gallery/1o203wu",
    "scraped_at": "2025-12-04T02:58:21.593477"
  },
  {
    "post_id": "1o0ftnm",
    "subreddit": "Manhattan",
    "title": "Is Greenwich Village still relevant for Halloween?",
    "author": "Affectionate-Race864",
    "created_utc": "2025-10-07T10:09:25",
    "score": 0,
    "num_comments": 10,
    "text": "I haven’t been there since pre-Covid and I know things weren’t the same after the fact. Was wondering if it bounced back. If not— where is the spot to go for Halloween? Thanks in advance. ",
    "url": "https://www.reddit.com/r/manhattan/comments/1o0ftnm/is_greenwich_village_still_relevant_for_halloween/",
    "scraped_at": "2025-12-04T02:58:21.747015"
  },
  {
    "post_id": "1nwmr5f",
    "subreddit": "Manhattan",
    "title": "Squid Game NYC experience canceled. Need an immersive, active backup for my 14 & 9 year olds!",
    "author": "Acrobatic-Writer9234",
    "created_utc": "2025-10-02T22:01:10",
    "score": 1,
    "num_comments": 6,
    "text": " NYC folks. I need your help.\n\nWe had planned a trip to Manhattan in November to take our daughter (she’s been dying to go) to the Squid Game Experience, but now I just found out it’s closed. Now I’ve got to break the news to her, and I want something else epic to replace it.\n\nWe’re in for 4 people: me, my partner, a 14-year-old, and a 9-year-old. We’ve done Broadway shows, museums, etc., on past trips, but this time we want something immersive, active, “in the game” — not just watching, but doing.\n\nWhat immersive / active things do you recommend in NYC (or nearby) for a family with teens + preteens?\n\nSome qualities we’re hoping for:\n\t•\tIndoor (it’ll be cold in Nov)\n\t•\tPhysically engaging or interactive (not just passive)\n\t•\tImmersive / “experiential” vibes (projection, VR, games, puzzles, etc.)\n\t•\tGood for a tween / teen + younger kid\n\t•\tEasy to get to (ideally Manhattan or nearby)\n\nThank you in advance! I want to make this trip extra magical, even though the Squid Game plan fell through. 🙏🏻",
    "url": "https://www.reddit.com/r/manhattan/comments/1nwmr5f/squid_game_nyc_experience_canceled_need_an/",
    "scraped_at": "2025-12-04T02:58:21.880722"
  },
  {
    "post_id": "1nw7r0f",
    "subreddit": "Manhattan",
    "title": "LF events for my solo trip this weekend",
    "author": "Snoo_29332",
    "created_utc": "2025-10-02T11:59:15",
    "score": 1,
    "num_comments": 0,
    "text": "I'm flying in to NYC tomorrow night for a week long work trip, but Ill have Sat., Sun. and Mon. to do whatever I want. I used to live over there but its been a long time since I've been back. Looking for some cool stuff to get into.\n\n**Daytime,** I'm hoping to get into some more \"local\" events during the day - pop ups, markets, or one off events. Ill probably just wander around on foot, stop at some cafes, etc. I've already been to all the touristy spots in the past (museums, landmarks, etc.). I might swing by mood fabrics to get some materials for my wife.\n\n**Night time** is what I'm most excited about. I was hoping to find some good electronic/edm concert, a cool art show, or maybe a metal show at a crusty dive bar. I'm pretty open!\n\n**About me**: I'm 33/M. I was a goldsmith for 10 years but now I work in tech. I'm an artist, musician, craftsman, and extrovert. I love all kinds of music, but prefer smaller venues & house show vibes. Some of my favorite artists right now are Pinegrove, Fred Again, Max Cooper, Ty Segall, Amen Dunes, and generally anything mid-west emo/hardcore",
    "url": "https://www.reddit.com/r/manhattan/comments/1nw7r0f/lf_events_for_my_solo_trip_this_weekend/",
    "scraped_at": "2025-12-04T02:58:22.001808"
  },
  {
    "post_id": "1n050r8",
    "subreddit": "Manhattan",
    "title": "Got punched in the eye on my last night visiting NYC. Is this normal ? Should I report it ? And if yes, how ?",
    "author": "Large-Impression-528",
    "created_utc": "2025-08-25T18:38:56",
    "score": 0,
    "num_comments": 16,
    "text": "I was visiting NYC last week for the first time. My wife and I got pretty drunk on our last day (some place in hells kitchen) and decided to head for our air bnb. I had not had so much to drink in about a decade and I got \"blackout drunk\"...besides, I never mess with tequila but somehow, that day I did (I could give reasons but it wouldn't mask the stupidity). \n\nI just remember waking up the next morning with one of my eye punched into. While I don't remember any of of how it happens,  my wife rememberes bits and pieces ...she says it was a really angry black dude who punched me on the sidewalk and cursed me a lot as I fell to the ground. He later yelled at her \"take him the fuck away from here.\"\n\n Going by pictures and videos just about 30mins before that ...we were very very jolly and danc-y..I don't think there is something I would've done or said to invite this punch. In our videos I am struggling with sitting on the bar stool there is now at I could move with intention to start a physical altercation. \n I possibly can't think of any exchange that would have led to the person punching me in the eye !! \n\nI returned back to my country and went to the urgent care clinic yesterday .. after multiple tests and a CT scan, turns out I have fractures on the orbital bone and nose as well as a tiny puncture in the retina. Then there is of course the   blaring black eye which is quiet the conversation starter. I work in healthcare and have no idea how to get back to work.....\n\n\nI am scheduled to see an ophthalmologist, optometrist, plastic surgeon and my family doctor for multiple follow ups this week. \n\n\n Havig a tough time processing this...\n\n-Is this normal for NYC ? \n\n-We got an Uber pretty much from the place I got punched since my wife members I couldn't stand up and she had to sit on the sidewalk besides me as she called an Uber... This means we have that address. Does this help me report this incident ? Should I report this incident or is it just a normal day in Manhattan ? \n\nPS- I ofcourse know about responsible drinking and not acting like a teenager with parents on vacation. And I am doing my share of contemplating about this unprecedented behavior. All I hope for is to not lose any degree of my vision (among other things). I want to laugh about it one day as I tell the story of my first trip to NYC. \n\nAny kind words are much appreciated :) ",
    "url": "https://www.reddit.com/r/manhattan/comments/1n050r8/got_punched_in_the_eye_on_my_last_night_visiting/",
    "scraped_at": "2025-12-04T02:58:25.174604"
  },
  {
    "post_id": "1mjcva9",
    "subreddit": "Manhattan",
    "title": "Am I the only one who’s scared? W 39th St and the reality of living here lately",
    "author": "gotallthejuicynews",
    "created_utc": "2025-08-06T14:39:48",
    "score": 88,
    "num_comments": 221,
    "text": "Hi neighbors,\n\nI am writing this because I am honestly scared. I am actually terrified and I just want to know if anyone else is feeling this way or if I am alone.\n\nLately, West 39th Street has been filled with encampments. When I walk through, I get screamed at. I have been spit on. I have been chased, yelled at, followed, and I have stepped on needles more times than I can count. Most of the people here are mentally ill and it is honestly terrifying. Sometimes it feels like living in a zombie apocalypse, especially between 8th and 11th Avenue and from 23rd all the way up to 45th. I am scared and concerned. I am so tired of feeling like this every single day, multiple times a day, just trying to get home.\n\nFor what it is worth, I am a generous person and I always try to help when I can. Just last week I saw someone pleading for water and I went over to give him twenty dollars. As soon as I got close he suddenly screamed \"HOW MUCH,\" ripped the twenty from my hand and actually grabbed my arm, then ran off laughing. It honestly felt satanic. People nearby rushed over to check on me and there was a police officer nearby. He told me to stop giving money to the homeless because lately a lot of people who try to help are being robbed.\n\nI have reached out to the city council to tell them how unsafe and frustrated I feel. I have called the precinct to report what has been happening and the encounters I have had, but I am mostly told they are working on it but there is not much that can be done. The laws have changed. Loitering is not enforced. Drug use is basically legal now in NYC, even heroin. It feels like everything has spiraled.\n\nAm I the only one feeling this way in Hell’s Kitchen and Hudson Yards? Is anyone else dealing with daily fear and these same kinds of experiences? I really just want to hear from other people living here. I need to know if I am alone in this or if others feel the same.\n\nIf you are in the area and have stories, advice, or just want to talk about it, please comment. I am just tired of being scared in my own neighborhood.\n\nThanks for listening.",
    "url": "https://www.reddit.com/r/manhattan/comments/1mjcva9/am_i_the_only_one_whos_scared_w_39th_st_and_the/",
    "scraped_at": "2025-12-04T02:58:26.867984"
  },
  {
    "post_id": "1mhh8cx",
    "subreddit": "Manhattan",
    "title": "Slower-paced tourist ideas?",
    "author": "IncreaseSalt7444",
    "created_utc": "2025-08-04T11:53:29",
    "score": 3,
    "num_comments": 10,
    "text": "I’m visiting in October and have several chronic illnesses that make my energy level and fatigue vary from one day to the next. If I overdue it one day, I may be hard-pressed to get out of bed the next day!\n\nCouple of questions:\n—What are suggestions for some lower energy things to do in Manhattan that don’t require a ton of walking?\n—What are the best places to just sit and soak in the vibe or watch the world go by?\n—I’m hesitant to buy a lot of tickets/book reservations ahead of time since I never know how I’m going to feel on a given day. What things can you generally buy same day tickets for?\n\nThank you!",
    "url": "https://www.reddit.com/r/manhattan/comments/1mhh8cx/slowerpaced_tourist_ideas/",
    "scraped_at": "2025-12-04T02:58:28.166142"
  },
  {
    "post_id": "1lxh86y",
    "subreddit": "Manhattan",
    "title": "Seeking Participants for Research Study on OCD and the Brain",
    "author": "OCDResearch_MtSinai",
    "created_utc": "2025-07-11T16:18:01",
    "score": 0,
    "num_comments": 0,
    "text": "Join our study at the Icahn School of Medicine at Mount Sinai (IRB #24-01125), led by Dr. Amy Rapp. We're trying to learn more about how patterns of brain activity while making decisions are related to OCD symptoms and how people respond to treatment.\n\n**We need volunteers who have been diagnosed with OCD or who think they may have OCD. We also need volunteers who have NEVER had OCD.**\n\nParticipation in this study includes two in-person visits at the start and end of a 10-week period. We are located at 1428 Madison Avenue in Manhattan.  At the study visits, you will answer some questions, do some tests, and play games while we record the activity of your brain. \n\nDuring these 10 weeks, participants who are diagnosed with OCD will receive **no-cost psychotherapy** for OCD. \n\nYou will be compensated $200 for your time.\n\nIf you are interested, please contact us at [OCDResearch@mssm.edu](mailto:OCDResearch@mssm.edu) or 212-241-5288. \n\n",
    "url": "https://www.reddit.com/gallery/1lxh86y",
    "scraped_at": "2025-12-04T02:58:29.769075"
  },
  {
    "post_id": "1lpynkv",
    "subreddit": "Manhattan",
    "title": "Participants needed for a paid research study at Mount Sinai Hospital  (Ages 21-35)",
    "author": "clark_neuro_lab_nyc",
    "created_utc": "2025-07-02T11:22:06",
    "score": 1,
    "num_comments": 2,
    "text": "Researchers at Mount Sinai Hospital are seeking people to participate in a study examining health perceptions and behaviors in adults between the ages of 21 and 35 years old. The study includes up to 3 in person visits. Participants will be compensated for their time, up to $330. For more information, call a study coordinator at the Icahn School of Medicine at Mount Sinai at, 212- 241-6582 \\[or use the QR code attached to our flyer above to email a study team member for more information!\\]\n\nhttps://preview.redd.it/aooro1nnahaf1.png?width=1920&format=png&auto=webp&s=4312e2910e92c6ac8b91c5f4d44ee9bb7a452700\n\n",
    "url": "https://www.reddit.com/r/manhattan/comments/1lpynkv/participants_needed_for_a_paid_research_study_at/",
    "scraped_at": "2025-12-04T02:58:29.896490"
  },
  {
    "post_id": "1llyckr",
    "subreddit": "Manhattan",
    "title": "Rumored: NYC Hospital Closure",
    "author": "veryspicybanana",
    "created_utc": "2025-06-27T12:30:54",
    "score": 32,
    "num_comments": 11,
    "text": "I’ve heard from several sources that the next hospital signaled to begin shutting down services “soon” is Mount Sinai Morningside. Not many details were given to me at the time, but it feels important to bring some awareness to the rumor as Mount Sinai could fast track its closure like they did Beth Israel out of the blue. This hasn’t hit media outlets as it’s “under wraps” like most dealings, but i hope this serves the city well.\n\nUpdate (as urged by u/5oLiTu2e): as told by u/Far-Tea-7948, this rumor can be dismissed as this hospital is creating expansions in their clinical programs. More info. can be found in his comment on the thread.",
    "url": "https://www.reddit.com/r/manhattan/comments/1llyckr/rumored_nyc_hospital_closure/",
    "scraped_at": "2025-12-04T02:58:30.032233"
  },
  {
    "post_id": "1lce5v1",
    "subreddit": "Manhattan",
    "title": "Calling all NYC Activists: Citarella quietly swapped fresh-squeezed OJ for cold-pressed… without lowering the price. This is how civilizations collapse.",
    "author": "Puzzleheaded-Gur3750",
    "created_utc": "2025-06-15T19:28:56",
    "score": 13,
    "num_comments": 2,
    "text": "No signage. No disclosure. Still $20. Just pure corruption and greed.  \nOne day you’re grabbing your weekend juice like a normal Upper East Side resident — the next, you realize you’ve been cold-pressed, not blessed.\n\nThis isn’t just about citrus. It’s about trust. It’s about *transparency*. It’s about the working New Yorker who just wants an honest glass of overpriced vitamin C.\n\nIf we don’t demand accountability now, what’s next? $8 “fresh-baked” bread shipped from New Jersey?\n\nCall it what it is: **#OJGate.**  \nCall your reps. Call your juicer. Call Citarella and ask why they think we're pulp-brained. 🍊\n\n📢 **Sign the petition:** [https://chng.it/vcLSCvWmKT](https://chng.it/vcLSCvWmKT)",
    "url": "https://www.reddit.com/r/manhattan/comments/1lce5v1/calling_all_nyc_activists_citarella_quietly/",
    "scraped_at": "2025-12-04T02:58:30.208264"
  },
  {
    "post_id": "1lahnw2",
    "subreddit": "Manhattan",
    "title": "Bond vet is a scam",
    "author": "ConnectionMajestic66",
    "created_utc": "2025-06-13T10:41:11",
    "score": 22,
    "num_comments": 9,
    "text": "I should’ve read up about it more, but I went to Bond Vet and just want to warn people against doing the same. \n\nMy bf and I adopted his 15 year old family cat from his parents and she’s super healthy for a senior cat and never has health or behavioral problems. That being said, she’s an old indoor kitty and gets stressed out leaving the house for anything… so when she peed on the bed while we were in it (unusual) and spent the morning running in and out of the litter box and licking herself, we were concerned about a UTI and went to the closest vet as soon as it opened- Bond Vet in fidi. \n\nThe vet herself was super nice and you could tell was very good at handling pets. We went in saying that a UTI was a concern, and she ended up telling us it could be a variety of things and listed off at least 10 options. She said we can’t give her antibiotics without knowing it’s a UTI so we need to do testing… tried to charge us $900+ for ultrasound, anxiety meds (??), bloodwork, urinalysis, etc. We obviously would do anything for our cat so chose to do all of the tests and skip the anxiety meds because we know her well enough to know that wasn’t the cause of behavior. They said results in 24-48 hours (we went Monday 10 AM when they opened).\n\nAfter calling daily to check in, we learned Tuesday that they HAD the results, but needed a doctor to send us the email. The email finally came Thursday and meanwhile she’s uncomfortable, peeing all over the apt, and at risk of kidney infection with an untreated UTI. The email said it WAS a UTI (shocker)… and that we should pay $250 to test THE SAME SAMPLE THEY ALREADY HAVE for which type of bacteria. Then $400 for antibiotics after that testing. I’m sorry…. It took you 4 full days to give us the results of the test but the results are … not results? WHY would I pay another $250 for you to do what we already paid you to do? And potentially wait another 4 days while she’s suffering and potentially getting more serious damage as it spreads???? \n\nI know that vet bills are always pretty high without pet insurance, but Bond Vet is an absolute racket. They’re exploiting pet owner’s desire to help their pets who need urgent medical care and hoping we don’t look too much into it because we’ll be worried sick for the pet. I’ve never left a bad review but I dont want other pet owners to have this experience. Please please please don’t go to Bond Vet in NYC if you can avoid it. ",
    "url": "https://www.reddit.com/r/manhattan/comments/1lahnw2/bond_vet_is_a_scam/",
    "scraped_at": "2025-12-04T02:58:31.739512"
  },
  {
    "post_id": "1l4ic4r",
    "subreddit": "Manhattan",
    "title": "If you don’t have health insurance, read this. Especially if you’re in NY",
    "author": "insuranceagent007_",
    "created_utc": "2025-06-05T23:18:08",
    "score": 33,
    "num_comments": 0,
    "text": "A lot of folks still think you can only get health insurance once a year. That’s not true—especially if you qualify for Emergency Medicaid or Essential Plans in New York. These plans are for people who don’t have steady income, are between jobs, or just got here 🇩🇴🇵🇷🇯🇲🇭🇹🇧🇸\n\n✅ $0 or low monthly cost\n✅ Includes doctor visits, prescriptions, ER, mental health\n✅ No immigration status required for Emergency Medicaid\n✅ You can sign up right now\n\nI help people in the community (NYC, Long Island, Upstate) get covered every day. No BS, no scams—I’m certified by the NY State of Health.\n\nDM me if you have questions or need help enrolling. Even if you’ve been denied before, I’ll walk you through it. 💪🏾\n\nLet’s get you and your family covered. Health is wealth.",
    "url": "https://www.reddit.com/r/manhattan/comments/1l4ic4r/if_you_dont_have_health_insurance_read_this/",
    "scraped_at": "2025-12-04T02:58:31.881174"
  },
  {
    "post_id": "1k8wa9c",
    "subreddit": "Manhattan",
    "title": "Visiting Time Square on a Sunday, coming from central NJ, need some tips",
    "author": "New_IPNJNY",
    "created_utc": "2025-04-27T01:07:42",
    "score": 0,
    "num_comments": 25,
    "text": "I could use some advice for my trip. I'll be visiting Times Square on a Sunday and I'm coming from Central NJ. I’ve heard parking is free on Sundays and that there are no congestion tolls. I’m wondering where I can park my car for free and then take the subway or other public transport to get to NYC, especially the Times Square area. I’m open to parking on the NJ side if it's cheaper or more convenient. I’m not very familiar with NYC's public transportation options, and the toll bridges and tunnels are also a bit of a mystery to me. Thanks in advance for any tips!",
    "url": "https://www.reddit.com/r/manhattan/comments/1k8wa9c/visiting_time_square_on_a_sunday_coming_from/",
    "scraped_at": "2025-12-04T02:58:33.334127"
  },
  {
    "post_id": "1jzsdha",
    "subreddit": "Manhattan",
    "title": "Research Study on Decreasing Depression Symptoms in Teens",
    "author": "mindfulbrainproject",
    "created_utc": "2025-04-15T09:50:08",
    "score": 3,
    "num_comments": 0,
    "text": "Hello, I am a research assistant in the Department of Psychiatry at Columbia University. Our team is recruiting teens that are currently feeling depressed to participate in a paid research study on mindfulness meditation and the brain using magnetic resonance imaging (MRI). The study is aimed at learning how mindfulness meditation can help decrease depression symptoms. If you are a teen ages 13-18 or have/know a teen that is between ages 13-18, may currently be experiencing depression, and lives in the greater New York/New Jersey area, they may be eligible. Participants may be compensated up to $484 in total. \n\nOur team would: (1) interview you about current and past thoughts, feelings, and behaviors, (2) teach you mindfulness strategies, (3) collect brain activity data with MRI (non-invasive) while you practice mindfulness, and (4) send short surveys to your smartphone through the MetricWire app. The MRI scan will take place at the Zuckerman Mind Brain Behavior Institute at Columbia University, and the interviews will take place remotely through Zoom. \n\nInterested parents or teens can contact us at [mindfulbrain@nyspi.columbia.edu](mailto:mindfulbrain@nyspi.columbia.edu), call/text 646-818-0602, or fill out the following interest form: [https://redcap.link/mindfulbrain](https://redcap.link/mindfulbrain)\n\nThank you!\n\nJamaal  \nResearch Assistant  \nDivision of Child and Adolescent Psychiatry  \nColumbia University Irving Medical Center  \n[https://www.auerbachlab.com/](https://www.auerbachlab.com/)\n\nhttps://preview.redd.it/6x2joua670ve1.png?width=920&format=png&auto=webp&s=273b7cd51a6b3f734f09a33456cfee73797fec95\n\n",
    "url": "https://www.reddit.com/r/manhattan/comments/1jzsdha/research_study_on_decreasing_depression_symptoms/",
    "scraped_at": "2025-12-04T02:58:33.544945"
  },
  {
    "post_id": "1jsxctm",
    "subreddit": "Manhattan",
    "title": "This West Village Spot Might Close—Let’s Help Them Out Before It’s Too Late",
    "author": "Routine_Monitor_2185",
    "created_utc": "2025-04-06T11:57:25",
    "score": 0,
    "num_comments": 3,
    "text": "Saw this article about a [small restaurant in the West Village](https://g.co/kgs/FVrrAay) that's struggling to stay open because of congestion pricing and rising costs. They're not asking for handouts—just trying to survive by serving good food. If you’re in NYC, maybe consider grabbing a meal there this week. Sometimes a few extra tables can make all the difference.\n\nHere’s the article:  \n[https://nypost.com/2025/04/04/us-news/trendy-west-village-eatery-blames-congestion-pricing-for-impending-closure-were-just-open-to-pay-bills](https://nypost.com/2025/04/04/us-news/trendy-west-village-eatery-blames-congestion-pricing-for-impending-closure-were-just-open-to-pay-bills)\n\nLet’s flood them with love instead of letting another good place disappear.",
    "url": "https://www.reddit.com/r/manhattan/comments/1jsxctm/this_west_village_spot_might_closelets_help_them/",
    "scraped_at": "2025-12-04T02:58:34.390941"
  },
  {
    "post_id": "1jpsi3u",
    "subreddit": "Manhattan",
    "title": "PSA: New FDNY EMS Hospital Transport Policy",
    "author": "MarkAdamsK",
    "created_utc": "2025-04-02T12:13:00",
    "score": 16,
    "num_comments": 1,
    "text": "Posted this on the UES subreddit, but thought I would pass this along here too - FDNY has a new policy for ambulance transports that does not allow EMS crews to take a patient to any hospital besides what their on-board computer says is the closest hospital. So, for example, if Bellevue is closer but you want to go NYU Langone - in most cases, the crew cannot honor that request even if you have existing care or insurance there. \n\nSince there are lot of hospitals in Manhattan and people may have places that they want or do not want to go to, this is important.\n\nPrior to this new policy, crews had some discretion about where to transport a person and to honor request for reasonable nearby hospitals.\n\nThis policy has apparently caused quite a bit of frustration for people - especially those receiving ongoing care at certain facilities or who have concerns about insurance acceptance at other facilities.\n\nAlso, this applies to all 911 ambulances - so FDNY, Lenox, NYP, Mount Sinai etc.",
    "url": "https://www.reddit.com/r/manhattan/comments/1jpsi3u/psa_new_fdny_ems_hospital_transport_policy/",
    "scraped_at": "2025-12-04T02:58:34.524876"
  },
  {
    "post_id": "1j8j86p",
    "subreddit": "Manhattan",
    "title": "With Vornado plan stalled, Penn Station gets a new megaproject pitch",
    "author": "Black_Reactor",
    "created_utc": "2025-03-11T01:01:04",
    "score": 2,
    "num_comments": 0,
    "text": "A group of Midtown politicians is backing a new plan for high-rise housing around Penn Station, urging Gov. Kathy Hochul to finally ditch the stalled megaproject that would rely on office towers built by Vornado Realty Trust.\n\nThe proposal by Assemblyman Tony Simone would scrap the existing plan — which would allow for 10 skyscrapers almost entirely limited to commercial use — and replace it with a mixed-use complex consisting of about one-third apartments and two-thirds offices. The proposal has support from Manhattan Borough President Mark Levine and City Councilman Erik Bottcher, and some support from neighboring landlords because, unlike the existing plan, it would not use eminent domain to seize private property.\n\nIt would, however, still rely on a general project plan, a development tool that allows the state to override local zoning laws in order to build. Then-Gov. Andrew Cuomo first proposed allowing Vornado to erect office towers in the area and using the tax revenue generated by the project to fund a rehabilitation of Penn Station. His successor, Hochul, “decoupled” the station improvements from the plan in 2023, but there has been little action on either front since then.\n\n“The current GPP that was created to fund a new Penn Station is outdated. It was created in a pre-Covid world,” Simone, who represents Manhattan’s West Side in the state Assembly, said during a press conference outside the rail hub Thursday. “We don't need that — we need housing first.”\n\nSimone’s framework, which is not finalized, calls for expanding the general project plan from eight to nine sites but turning the lot of the now-demolished Hotel Pennsylvania into a public park rather than the skyscraper envisioned by Vornado. The new complex would span 13.9 million gross square feet, compared with 18.3 million under the old plan, with room for about 5,000 housing units, compared with 1,800 in the existing plan.\n\nHochul, who has near-unilateral power to reopen the general project plan at any time, is “open to” the new proposal, Simone said. The revisions may be less palatable to Vornado, which has pursued a neighborhood-reshaping megaproject for years and has insisted its office-oriented initiative remains alive.\n\nSimone said he is discussing the proposal with Vornado and suggested it would be in the developer’s interest to “have a thriving community around the office buildings they want to build, which there's no market for right now.” A Vornado spokesman declined to comment.\n\n \nOffice of Assemblymember Tony Simone\nDiagrams showing the existing (left) and proposed (right) general project plans for the Penn Station area, with commercial space highlighted red and residential space yellow.\nMatthew Gorton, a spokesman for Empire State Development — the state entity spearheading the project — said in a statement that “Gov. Hochul remains committed to her vision for a new and improved Penn Station, anchored by hundreds of new homes, seamless access to transit, and major improvements to the surrounding streets and sidewalks.\n\n“The governor will continue to work with all stakeholders to deliver a station worthy of New York while advancing her bold plan for swift action to address the state’s housing shortage,” Gorton added.\n\nOther neighborhood landlords would be a factor as well. Simone’s proposal calls for expanding the general project plan to cover the half-block west of Broadway between 33rd and 34th streets, partly owned by Empire State Realty Trust. Supporters say they have been in talks with the trust and other owners.\n\nThe housing-oriented proposal won early praise from leaders of Manhattan Community Boards 4 and 5. It also has support from residents of “Block 780” — the much-discussed city block immediately south of Madison Square Garden, which stands to be razed under the existing general project plan but would be left intact under Simone’s plan. (Amtrak has long insisted that expanding Penn Station would require taking over that block, but transit advocates who favor an alternate scheme disagree.)\n\nLabor unions could also influence the outcome. Gary LaBarbera, the construction-union boss who leads the Building and Construction Trades Council, signaled support for the new plan — saying in a statement that it would provide much-needed housing and “also create thousands of family-sustaining union careers for hardworking New Yorkers, thanks to the requirement of a project labor agreement.”\n\nSome recent policy changes have fueled hopes that more housing could be added to the Penn area. Last year’s state budget included a provision, first reported by Crain’s, that allows future general project plans to build bigger apartment buildings by exceeding a cap on residential density.",
    "url": "https://www.crainsnewyork.com/politics-policy/manhattan-leaders-pitch-new-penn-station-megaproject-more-housing",
    "scraped_at": "2025-12-04T02:58:34.644607"
  },
  {
    "post_id": "1ohvkru",
    "subreddit": "StatenIsland",
    "title": "BP gives $ to SIUH, great! But do we not have public hospital with constant funding to private hospitals here. Advance link attached",
    "author": "Alarming-Library4466",
    "created_utc": "2025-10-27T20:36:11",
    "score": 9,
    "num_comments": 19,
    "text": "This is a question I’ve wanted to ask for a while with ALOT of funding going both RUMC and SIHU hospital of late. That is incredible. However, we desperately need another hospital. Are our politicians not looking at a public hospitals with just giving money to our private hospitals? Maybe bigger question to dive into, are they being lobbied or funded to keep a public hospital out. Couldn’t we just use the money they give to these hospitals, and build another hospital altogether? \n\nFollow up question . Where would you put another hospital . My personal thought is when Amazon, or ikea  closes one of the warehouses here. City buys the land to buy public hospital. \n\nhttps://www.silive.com/entertainment/2025/10/bp-fossella-champions-staten-islands-health-with-13-million-investment-in-advanced-medical-technology-at-siuh.html",
    "url": "https://www.reddit.com/r/statenisland/comments/1ohvkru/bp_gives_to_siuh_great_but_do_we_not_have_public/",
    "scraped_at": "2025-12-04T02:58:37.978832"
  },
  {
    "post_id": "1o65a6k",
    "subreddit": "StatenIsland",
    "title": "Staten Island Quarantine War",
    "author": "Lonely_Lemur",
    "created_utc": "2025-10-13T23:49:50",
    "score": 15,
    "num_comments": 5,
    "text": "Staten Island once burned its own quarantine hospital to the ground. The courts called it self-defense. Anyone know if there’s a historical marker near the old site?\n\nhttps://open.substack.com/pub/theedgeofepidemiology/p/the-night-staten-island-burned-its?r=7fxyg&utm_medium=ios ",
    "url": "https://www.reddit.com/r/statenisland/comments/1o65a6k/staten_island_quarantine_war/",
    "scraped_at": "2025-12-04T02:58:38.161252"
  },
  {
    "post_id": "1o4rtf2",
    "subreddit": "StatenIsland",
    "title": "Indoor basketball on the island",
    "author": "Zayphonso",
    "created_utc": "2025-10-12T11:21:20",
    "score": 9,
    "num_comments": 26,
    "text": "It’s getting cold and I wanna keep up my summer habit of hooping for cardio ",
    "url": "https://www.reddit.com/r/statenisland/comments/1o4rtf2/indoor_basketball_on_the_island/",
    "scraped_at": "2025-12-04T02:58:38.313240"
  },
  {
    "post_id": "1ne8i25",
    "subreddit": "StatenIsland",
    "title": "Silive's Brian Laline's Letter to the Editor from this morning",
    "author": "zombiexsp",
    "created_utc": "2025-09-11T09:14:09",
    "score": 62,
    "num_comments": 48,
    "text": "Brian Laline wrote a piece on the political division we're seeing lately. Thought it was poignant.\n\n>Hello,\n\n>I didn’t begin with my traditional “Hi Neighbor” today. It just doesn’t seem appropriate.\n\n>I’m no longer sure who I can call a neighbor. Or who wants to call me a neighbor. As a society, we are fraught with tension.\n\n>Yesterday’s murder of a young conservative, an ally of President Trump, a charismatic guy doing all he could to lure young people to the Republican Party, has left me shaken.\n\n>As I write this, the murderer has not been found and no motive for the shooting has been confirmed.\n\n>But what else could it be?\n\n>Some twisted individual, who thinks they have a higher purpose, decided they have the right, the power, to thwart opposing opinion, opinion with which they violently disagree, to take the life of a young man to make that sick statement.\n\n>It has left me shaken for so many reasons.\n\n>A first reaction of any thinking person, of course, is abject horror.  No matter their political position.\n\n>What is happening to America, they’ll demand, with all the heartfelt passion they can muster.\n\n>The more liberal among us will blame violence in America on Donald Trump and his bombastic style, belittling anyone and everyone in his path, creating the enormous divide we see in our country.\n\n>The more conservative among us -- the president included -- will blame it on the left-leaning ilk of our country.  Woke America. Why else, they’ll demand, would anyone murder someone preaching “traditional values\" that millions of Americans voted for that put their guy back in the White House.\n\n>When are we going to face it, Staten Island? When is America going to face it?\n\n>We are an angry nation. Often a violent nation.\n\n>Let’s take it down to the streets of Staten Island.  You’ve seen road rage.  Or at least the beginnings of it.  You’ve had someone blast the car horn at you the second the traffic light turns green.  Maybe you’ve done it yourself. Neighbors battle neighbors over the silliest things.\n\n>Don't dare park in front of my house!\n\n>Countless times, reporters have been threatened by crime suspects who are subject of news stories detailing their arrest and whatever crime they've been accused.\n\n>You’re destroying my life, they threaten. What goes unsaid -- they committed the crime.\n\n>Judges in criminal trials are threatened.  Prosecuting attorneys in those same trials are threatened.\n\n>Twisted Americans hell-bent on making some twisted statement shoot up a classroom of second graders.\n\n>A maniac plows a car through revelers at an outdoor concert\n\n>The result of the stress of the world in which we now live? Think again.\n\n>European settlers landed on on our shores in the 1700s when there were an estimated three million Native Americans living here.\n\n>By1900, there were fewer than 300,000.\n\n>Today, corral the few left on a reservation somewhere in Connecticut, give them a fancy casino and tell them to do they best they can.\n\n>Imagine yourself Black in Jim Crow's America.  Work the fields all day, but don’t think of having a Coca Cola at the 5 & 10 lunch counter when done.\n\n>Today, people we don't like face deportation.  Then, they faced a tree and a rope.\n\n>It’s not what we’ve become, neighbors. It’s what we’ve always been.\n\n>Those who’ll curse   me -- and there’ll be many – for disparaging this great country, will never acknowledge the horrors that got us here.\n\n>I despise the gun culture in which we live.  But gun control will never stop the violence we saw this week in Utah.\n\n>Maybe.  Just maybe, if we tone down the ugly rhetoric.  If we heal the divide between Republicans and Democrats, maybe there'll be one less nasty argument between neighbors over the picket fence.\n\n>Maybe, just maybe, there'll be one less American murdered simply because they don’t agree with what the neighbor on the other side of the fence believes.\n\n>Or maybe, just maybe, it’s all Pollyanna thinking at a time when, as a nation, we should be grieving. Not just for the man murdered.  But for the contry we think we are.\n\n>Brian\n\n>Executive Editor\n\n>[SILive.com](http://SILive.com) and Staten Island Advance [laline@siadvance.com](mailto:laline@siadvance.com) \n\nPosting here semi-delusionally hoping everyone in the comments won't be dicks to each other. Remember rule 1 for this sub",
    "url": "https://www.reddit.com/r/statenisland/comments/1ne8i25/silives_brian_lalines_letter_to_the_editor_from/",
    "scraped_at": "2025-12-04T02:58:39.790942"
  },
  {
    "post_id": "1na7uov",
    "subreddit": "StatenIsland",
    "title": "Has anyone noticed a lot of people \"bumble\" around on SI sidewalks? lol",
    "author": "ordrius098",
    "created_utc": "2025-09-06T15:04:28",
    "score": 26,
    "num_comments": 24,
    "text": "OK, full honestly  the walking equivalent of an aggressive driver-- im very fast im a tallish guy with long legs, and if you're in front of me on the sidewalk ill go around you as politely but swfitly as possible and I notice it startles a lot of people.  Having said that, for an island known for aggressive drivers, the walking is opposite... People will just stare at the sky and roam around the sidewalk walking Hella slow as if no other human beings are sharing the sidewalk. Is it bc of the large boomer/older population on the island maybe? So they're just in their own kinda world? Or am I just intensely neurotic and getting annoyed at minor stuff?  Would like ppls opinions lol",
    "url": "https://www.reddit.com/r/statenisland/comments/1na7uov/has_anyone_noticed_a_lot_of_people_bumble_around/",
    "scraped_at": "2025-12-04T02:58:40.175022"
  },
  {
    "post_id": "1n6103j",
    "subreddit": "StatenIsland",
    "title": "Likely going to start working in Manhattan next summer. Considering living next to the St. George ferry since it’s $1.45 for disabled vets. Seeing conflicting things about the area. Any recent thoughts?",
    "author": "aguer056",
    "created_utc": "2025-09-01T17:15:31",
    "score": 25,
    "num_comments": 83,
    "text": "\nLong COVID messed me up pretty good so I won’t be doing much except working. Looking for a chill neighborhood and an easy commute to Hells Kitchen that’s affordable. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1n6103j/likely_going_to_start_working_in_manhattan_next/",
    "scraped_at": "2025-12-04T02:58:40.382987"
  },
  {
    "post_id": "1mnknau",
    "subreddit": "StatenIsland",
    "title": "College/Trade School",
    "author": "witchypunkz",
    "created_utc": "2025-08-11T14:14:23",
    "score": 11,
    "num_comments": 20,
    "text": "No clue what I want to do with my life I just know I need to make more money & want to work somewhere that isn’t overstimulating, I currently work in retail & the loud music & tons of rude people is exhausting. I’m interested in psychology/counseling like being an RBT but I have no prior experience, also I wouldn’t mind computer science, I’d also like working with my hands in a trade but I don’t think I’m physically strong enough being 5’2 & 100lb, plus every trade school I’ve researched nearby has negative reviews & I don’t want to work in a career that doesn’t have much job security, I know nothing about starting my own business. I applied to CityTech in bk for Radiography but I’m really intimidated by the math aspect & also participating in surgeries, Dental Hygienist also interested me but I went with radiology because there were less credits required to enter into the program. CSI also has a free community health worker program that I was interested in because if I get the certificate I can work at the pride center, but that’s a long shot & a lot of people were saying they hated being a CHW. If I don’t hear back from either program I’m probably gonna take the CASAC-T training course at CSI to be a SUD counselor. Working in healthcare interests me because of the job security but I’m worried working in a hospital will be just as stressful if not moreso, I’ve also never been a very good student & graduated HS with my GED. My score was 640 so I don’t qualify for any four year programs at CityTech, which is 650. Math has always been a huge weakness for me. \n\nMy question is where did you go to school, what do you do & what works for you? If you went to CSI what program do you feel is the most promising? Maybe I can figure something out that I haven’t considered before. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1mnknau/collegetrade_school/",
    "scraped_at": "2025-12-04T02:58:41.796513"
  },
  {
    "post_id": "1mi1yzp",
    "subreddit": "StatenIsland",
    "title": "A list of open Bars on Staten Island",
    "author": "Zealousideal_Ride693",
    "created_utc": "2025-08-05T02:43:02",
    "score": 0,
    "num_comments": 16,
    "text": "It's hard to find a place for a glass of cold beer..any suggestions.. especially Dongan Hills and nearby",
    "url": "https://www.reddit.com/r/statenisland/comments/1mi1yzp/a_list_of_open_bars_on_staten_island/",
    "scraped_at": "2025-12-04T02:58:41.994088"
  },
  {
    "post_id": "1mceopc",
    "subreddit": "StatenIsland",
    "title": "Remembering Susan Dalton — Her 1996 Murder on Grymes Hill Remains Unsolved.",
    "author": "Missing_people",
    "created_utc": "2025-07-29T11:35:59",
    "score": 68,
    "num_comments": 0,
    "text": "In September 1996, the body of 37-year-old Susan Dalton, a Staten Island resident, was found about 40 feet into the woods off Campus Road near Howard Avenue on Grymes Hill — not far from Wagner College.\n\nShe had been strangled, stabbed (causing a fatal splenic injury), and had burn marks. Her body was found placed atop discarded auto parts, suggesting she may have been dumped there after being killed elsewhere.\n\nSusan lived on Seaview Avenue. Her landlord called police after noticing she hadn't been seen all weekend — and her three dogs were left unattended.\n\nWhen police entered her apartment, they found the iron still hot, TV and radio still on, and a shirt laid out on the board — as if she had left suddenly or was interrupted.\n\nHer case remains unsolved, and there’s been very little attention or follow-up over the years. I’m sharing this here in case any long-time Staten Islanders remember the case or have insight. It deserves to be remembered.\n\nIf you have any information don't hesitate to contact: \n\nNew York City Police Department (NYPD) – Homicide Squad\n- Phone: (212) 477-7000\n- 🌐 www.nyc.gov/nypd\n\nCrime Stoppers (Anonymous Tip Line)\nIf you wish to remain anonymous, you can contact Crime Stoppers.\n- 📞 Phone: 1-800-577-TIPS (8477)\n-🌐 www.nypdcrimestoppers.com\n\nhttps://www.silive.com/news/erry-2018/12/5d03d1bfc05988/body-found-in-woods-recalls-un.html\n\nNote: The only article linked above still available about Susan's case mentions an \"unidentified woman\" also found on Staten Island. That woman has since been identified as Christine Belusko from New Jersey — her murder occurred in 1991 and her 2-year-old daughter Christa remains missing. Details about their case can be found here: https://www.silive.com/crime-safety/2025/05/a-secret-adoption-a-grisly-murder-and-a-30-year-mystery-timeline-of-staten-island-scorpion-cold-case.html\n\n",
    "url": "https://i.redd.it/yg6yl9et1uff1.jpeg",
    "scraped_at": "2025-12-04T02:58:43.995993"
  },
  {
    "post_id": "1m95ng2",
    "subreddit": "StatenIsland",
    "title": "First time I haven’t seen scammers outside of Whitehall in years",
    "author": "aidanjwout",
    "created_utc": "2025-07-25T13:38:21",
    "score": 80,
    "num_comments": 32,
    "text": "No scammers in vests outside the terminal today nor outside Battery Park. Last time that was the case was probably Covid. There were a number of officers standing in different spots. Between that and the new signs, maybe there’s a new enforcement push. Let’s see how long it lasts. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1m95ng2/first_time_i_havent_seen_scammers_outside_of/",
    "scraped_at": "2025-12-04T02:58:44.097188"
  },
  {
    "post_id": "1m6gbdd",
    "subreddit": "StatenIsland",
    "title": "Vet hospital closed",
    "author": "kingfrank243",
    "created_utc": "2025-07-22T10:57:32",
    "score": 50,
    "num_comments": 29,
    "text": "I haven't been down in new dorp lately, when did the vet hospital closed i felt like it been there for a while",
    "url": "https://i.redd.it/foizkwpkwfef1.jpeg",
    "scraped_at": "2025-12-04T02:58:44.338629"
  },
  {
    "post_id": "1lg4ta9",
    "subreddit": "StatenIsland",
    "title": "Rumc vs SIUH Labor and Delivery",
    "author": "Wayward-Sojourn",
    "created_utc": "2025-06-20T10:04:04",
    "score": 17,
    "num_comments": 38,
    "text": "Hi All,\n\nWe just found out we’re pregnant! I’ve only seen OBs in Manhattan, so I’m not sure how things work on Staten Island. Everyone I’ve called is booking into September or later. Do you have any advice on which hospital is best for L&D and nursing care—SIUH with the new maternity ward or RUMC with great nurses? I’m feeling a bit stuck.\n\nThanks!",
    "url": "https://www.reddit.com/r/statenisland/comments/1lg4ta9/rumc_vs_siuh_labor_and_delivery/",
    "scraped_at": "2025-12-04T02:58:46.145813"
  },
  {
    "post_id": "1lft67x",
    "subreddit": "StatenIsland",
    "title": "Seaview Children’s Hospital",
    "author": "babarambo",
    "created_utc": "2025-06-19T22:45:15",
    "score": 255,
    "num_comments": 28,
    "text": "",
    "url": "https://www.reddit.com/gallery/1lft67x",
    "scraped_at": "2025-12-04T02:58:46.384734"
  },
  {
    "post_id": "1laj8zn",
    "subreddit": "StatenIsland",
    "title": "Recommendation needed - Eye doctor for my dog",
    "author": "distantthunder",
    "created_utc": "2025-06-13T11:44:51",
    "score": 1,
    "num_comments": 4,
    "text": "Hi, redditors! Any recommendations for an eye doctor for my dog within a 25 minute drive of the Island? Willing to travel, I love my doggo. He's a very good boy and his left eye has gone cloudy and blood red. We've seen two different vets, the drops have improved the redness but he needs an eye doctor. Thanks ever so much.",
    "url": "https://www.reddit.com/r/statenisland/comments/1laj8zn/recommendation_needed_eye_doctor_for_my_dog/",
    "scraped_at": "2025-12-04T02:58:46.612759"
  },
  {
    "post_id": "1kz28ke",
    "subreddit": "StatenIsland",
    "title": "North Shore veterinarian to treat dog anxiety?",
    "author": "Outrageous-Use-5189",
    "created_utc": "2025-05-30T07:50:54",
    "score": 7,
    "num_comments": 14,
    "text": "I'm looking for new vet after our vet office closed shop not long ago (CompleteCare on Clove). We discussed medication for our dog with our prior veterinarian but decided to hold off. Now that our household routine is changing, we think it is time to explore medication to ease the transition. I'm hoping to find a new regular caregiver for our dog, so it would be great to find someone on the north shore, but it is more important that the vet be a sophisticated practitioner in whatever area of veterinary science deals with dog emotions. I'd love both suggestions, and to know WHY you suggest them. Thanks!\n\nFYI, for us, Bay Street Animal Hospital is a Hard, Absolute, Eternal NO. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1kz28ke/north_shore_veterinarian_to_treat_dog_anxiety/",
    "scraped_at": "2025-12-04T02:58:47.927216"
  },
  {
    "post_id": "1k80533",
    "subreddit": "StatenIsland",
    "title": "Doctors in Staten Island that will prescribe GLP-1?",
    "author": "sal740",
    "created_utc": "2025-04-25T20:24:03",
    "score": 9,
    "num_comments": 12,
    "text": "Recently found out a coworker of mine was prescribed Wegovy injection for weight loss and our job's health insurance paid in full.   I was interested in getting a consultation from a physician to see if I would be a candidate but I don't want to waste time going to multiple doctors that are unwilling to prescribe GLP-1's.    \nHave any of our Staten island Redditors had a good experience and willing to share the name of the clinic or doctor's office they go to?",
    "url": "https://www.reddit.com/r/statenisland/comments/1k80533/doctors_in_staten_island_that_will_prescribe_glp1/",
    "scraped_at": "2025-12-04T02:58:49.266810"
  },
  {
    "post_id": "1k4gaz9",
    "subreddit": "StatenIsland",
    "title": "We’re transportation and public interest reporters at Advance/SILive.com. Ask us anything about public transit, traffic, and why your bus never shows up on time",
    "author": "statenislandadvance",
    "created_utc": "2025-04-21T11:26:21",
    "score": 47,
    "num_comments": 98,
    "text": "Hi everyone. We’re Mike Matteo and Erik Bascome—reporters at Advance/SILive.com who cover transportation on Staten Island. That includes all the things that drive you crazy: unreliable bus routes, traffic congestion, delays, potholes, the daily struggle of getting from point A to point B. (**And, of course, bad drivers.)**\n\nWe’ve spent a lot of time digging into issues and speaking to riders, drivers, elected officials, and agencies about the borough’s state of transportation, including the Staten Island Ferry — and we’re looking to hear more from you.\n\nWe’ll be here tomorrow—Tuesday, April 22 from 1-2pm ET—to answer your questions about what’s going wrong (and right) with our city’s transportation system. \n\nDrop your questions below!\n\nProof: ([Photo of Mike](https://imgur.com/a/VE1Zumw)) ([Photo of Erik](https://imgur.com/a/gemDEyi))\n\n>Thank you all so much for the great questions! We tried to get through as many as we could. Keep an eye out in the coming weeks: We’re starting a series focusing on the Island’s local bus network. You can always email Mike with questions to that end, or in general, at: mmatteo@siadvance.com.\n>\n>Additionally, here’s where you can check for planned service changes that may affect your travel: https://www.mta.info/alerts?selectedRoutes= \n>\n>If you have a specific issue with a bus skipping a stop or other problems, we recommend grabbing either the Bus ID number (ex. 8186) or run number (ex. 403) to report to the MTA. Here’s a pic showing where to find those numbers. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1k4gaz9/were_transportation_and_public_interest_reporters/",
    "scraped_at": "2025-12-04T02:58:49.420228"
  },
  {
    "post_id": "1jtxvir",
    "subreddit": "StatenIsland",
    "title": "Sick of Uber and need a new car service",
    "author": "Luke_is_a_fish",
    "created_utc": "2025-04-07T18:12:52",
    "score": 41,
    "num_comments": 58,
    "text": "If you take Ubers on Staten Island, you’ve probably dealt with long wait times (even when it says two min away), drivers cancelling your ride, drivers refusing to take you if you’re going to Brooklyn, etc. When I’m in areas close to the VZ bridge, I almost always get cancelled on, especially late at night. Meanwhile I’m just trying to get around the island to see my family and go to doc appointments. So I need a new car service. Clove Lakes Cars is 0/10, Speed doesn’t go to most areas I need to be in (sunnyside, rosebank) and that’s pretty much my list. Anyone have any suggestions? ",
    "url": "https://www.reddit.com/r/statenisland/comments/1jtxvir/sick_of_uber_and_need_a_new_car_service/",
    "scraped_at": "2025-12-04T02:58:51.300693"
  },
  {
    "post_id": "1jiypms",
    "subreddit": "StatenIsland",
    "title": "CSI Center for the Arts",
    "author": "OKHnyc",
    "created_utc": "2025-03-24T14:58:57",
    "score": 12,
    "num_comments": 8,
    "text": "Does anyone know if it will ever reopen for shows? It seems to have shut down for Covid and seemingly never reopened. \nShame because it was a good place to see a show. ",
    "url": "https://www.reddit.com/r/statenisland/comments/1jiypms/csi_center_for_the_arts/",
    "scraped_at": "2025-12-04T02:58:51.637605"
  },
  {
    "post_id": "1jezvv8",
    "subreddit": "StatenIsland",
    "title": "Trucks Aren't Rerouting into the Bronx or Staten Island to Avoid Congestion Pricing, Says NYC Traffic Expert",
    "author": "streetsblognyc",
    "created_utc": "2025-03-19T11:38:29",
    "score": 55,
    "num_comments": 15,
    "text": "",
    "url": "https://nyc.streetsblog.org/2025/03/19/gridlock-sam-trucks-arent-rerouting-into-the-bronx-or-staten-island-to-avoid-congestion-pricing",
    "scraped_at": "2025-12-04T02:58:51.781362"
  },
  {
    "post_id": "1je83v4",
    "subreddit": "StatenIsland",
    "title": "(TW:animal abuse) abandoned dog found behind locked gate",
    "author": "Grizzlyfrontignac",
    "created_utc": "2025-03-18T11:48:35",
    "score": 108,
    "num_comments": 18,
    "text": " We found this girl, malnourished, scared, cold, and very hurt. We think she was thrown over the gate because it was locked with no way in. We were able to pull the doors apart far enough that her tiny body could squish through.\n\nWe took her to the vet but then had to take her to the shelter once the hospital wouldn't see her. The vet confirmed she had just had puppies and judging by the scars all over the her body, she was most likely used for dog fighting as well. The pictures don't show it but she also had an injury on her left shoulder and was limping. \n\nI cannot afford the vet bills on my own and even if I could, I don't have any space to keep her. I had to leave her at the shelter sadly. She was incredibly friendly, she did not bark when she saw other dogs, and despite her condition, she was walking around like she was ok, eager to explore. She's such a good girl. I'm posting here in hopes someone can see this and maybe consider fostering her. She's at the ACC in tottenville. I can even help with some of the bills if necessary. It breaks my heart that she will go from one lonely place to another. It's so unfair what has happened to her in her short life and I think she could thrive if she was given the chance to. \n\nShe was found at the corner of Nicholas Ave and slaight st. in Port Richmond. If you know who might have done this, please consider reporting to the police. They still have her puppies. ",
    "url": "https://www.reddit.com/gallery/1je83v4",
    "scraped_at": "2025-12-04T02:58:51.987630"
  },
  {
    "post_id": "1j9ulsw",
    "subreddit": "StatenIsland",
    "title": "Bird flu was detected at Staten Island live poultry market",
    "author": "statenislandadvance",
    "created_utc": "2025-03-12T16:53:22",
    "score": 101,
    "num_comments": 18,
    "text": "",
    "url": "https://www.silive.com/news/2025/03/bird-flu-was-detected-at-staten-island-live-poultry-market.html?utm_medium=social&utm_source=redditsocial&utm_campaign=redditor",
    "scraped_at": "2025-12-04T02:58:52.193401"
  },
  {
    "post_id": "1iwbqti",
    "subreddit": "StatenIsland",
    "title": "Staten Island Mall wants to eliminate bus stops on its grounds. (Bad news for public transit users)",
    "author": "Outrageous-Use-5189",
    "created_utc": "2025-02-23T09:48:54",
    "score": 101,
    "num_comments": 80,
    "text": " For some reason Brookfield Properties wants to make it harder and more dangerous to use the bus to get to the mall.\n\nArticle from SI Advance 2/23/25:\n\nPlan calls for removal of some MTA bus stops from Staten Island Mall\n\nSTATEN ISLAND, N.Y. -- A number of  bus stops at the Staten Island Mall in New Springville could soon be removed under a new plan.\n\nState Assemblymember Sam Pirozzolo (R-Mid-Island) recently revealed a plan from the commercial real estate management firm, Brookfield Properties, which owns the Mall, to remove bus stops from four local lines on the property’s private road.\n\n“This afternoon, I was informed of a plan by Brookfield Properties, the owners of the Staten Island Mall, to remove the MTA’s ability to run its bus routes through Ring Road and most of the Mall’s property beginning on April 1st,” said Pirozzolo in a statement.\n\nAccording to Pirozzolo, the management company wants to remove stops for the S44, S59, S94 and S79 SBS from Ring Road, which circles the Staten Island Mall.\n\nThese bus stops would be relocated to both sides of Richmond Avenue. Stops for the S55 and S56, which are not located on Ring Road, would be unaffected, according to the statement.\n\n“At a time when we should be improving public transit and supporting our seniors, individuals with disabilities, and working families, this poorly planned move instead forces riders to navigate a large, often congested parking lot, raising serious concerns about both safety and accessibility,” Pirozzolo continued, calling the decision “baffling.”\n\nRepresentatives for Brookfield Properties did not return a request for comment at the time of publication.\n\n“Despite months of discussions with Brookfield Properties to keep the existing bus stops at their current locations along Ring Road for the safety and convenience of customers, we were unable to reach an agreement, and the stops will be relocated off the private road to nearby Richmond Avenue,” said Kayla Shults, an MTA spokesperson.\n\n\nThe main sign of the Staten Island Mall as traffic drives past on Richmond Avenue. Under a recently revealed plan, bus stops for routes like the S44 would be moved from Staten Island Mall property to Richmond Avenue by early April. Thursday Feb. 20, 2025. (Staten Island Advance/Mike Matteo)Mike Matteo\nIn November, the management company revealed plans to expand commercial space by developing “outparcels” of land surrounding the shopping center.\n\nThis would be done by converting underused parking lots into a total of seven new retail spaces over the next five years.\n\nThe proposed pads would be set back along Richmond and Platinum avenues, developed in the parking lots of the Staten Island Mall and “would not have the potential to adversely affect neighborhood character,” the document noted.\n\nThe project is similar to what the developer did with the addition of a stand-alone Krispy Kreme in 2022, and -- if approved -- will take approximately five years to complete.\n\nEarlier this year, additional MTA bus stops were removed from private property on Staten Island and relocated at the behest of the property owner.\n\nThe S52 bus, which runs between the St. George Ferry Terminal and Staten Island University Hospital in Ocean Breeze, had its route adjusted to remove two bus stops inside the hospital’s North Campus.\n\n\nSIUH requested that the MTA discontinue the University Drive/Medical Arts Pavilion East and University Drive/Northwell Health Labs bus stops that bookended the route between St. George and the hospital.\n\nThe new first stop for the buses back to St. George is now at Seaview Avenue and Mason Avenue, according to a spokesperson from the MTA.\n\nThe last stop for buses heading to the hospital is now Seaview Avenue and Nugent Avenue.\n\n\n\n",
    "url": "https://www.reddit.com/r/statenisland/comments/1iwbqti/staten_island_mall_wants_to_eliminate_bus_stops/",
    "scraped_at": "2025-12-04T02:58:53.850754"
  },
  {
    "post_id": "1isqlep",
    "subreddit": "StatenIsland",
    "title": "Easiest way to see the abandoned Seaview Hospital building?",
    "author": "Maya-kardash",
    "created_utc": "2025-02-18T18:27:15",
    "score": 26,
    "num_comments": 51,
    "text": "",
    "url": "https://www.reddit.com/r/statenisland/comments/1isqlep/easiest_way_to_see_the_abandoned_seaview_hospital/",
    "scraped_at": "2025-12-04T02:58:54.280124"
  }
]
